{
  "options": [
    {
      "optionText": "Puta que pariu...",
      "responseText": "Surpreso? Imaginei que você ia gostar do show. Embora, pela cara deles, acho que a Polícia da Pureza está prestes a desmaiar ou implodir.",
      "followUpOptions": [
        {
          "optionText": "Não sei dizer se eles querem te prender ou começar a tomar notas.",
          "responseText": "Talvez ambos. Quer dizer, dá pra culpá-los? Eles estão de saco azul há tanto tempo que provavelmente acham que sou uma alucinação."
        },
        {
          "optionText": "Acha que eles estão tentando descobrir se 'vibrador' conta como contrabando?",
          "responseText": "Ah, espero que sim. Deixa eles tentarem confiscar. Eu os desafio. Terão que arrancá-lo das minhas coxas frias e mortas.",
          "followUpOptions": [
            {
              "optionText": "A imagem mental disso é... horrível.",
              "responseText": "Horrível? Tente gloriosa. Você devia ver o jeito que eles se contorceriam. Praticamente estou fazendo um favor para eles a essa altura."
            },
            {
              "optionText": "Mal posso esperar para ver a cara deles quando começar a vibrar.",
              "responseText": "Ah, já está ligado. Só deixei no baixo por enquanto. Não quero distrair ninguém demais."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Você realmente colocou essa coisa em público? Você tem coragem.",
      "icon": "GUI/heart4",
      "responseText": "Coragem? Por favor. Isso são só as preliminares. A verdadeira diversão começa quando eles descobrem que é ativado por voz.",
      "followUpOptions": [
        {
          "optionText": "Ativado por voz? Sem chance.",
          "icon": "GUI/heart4",
          "responseText": "Olha só. 'Úmida'. Viu? Agora imagine dizer isso durante uma reunião da Polícia da Pureza.",
          "followUpOptions": [
            {
              "optionText": "'Úmida.'",
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "lineAfterHevent": "Ahh... foi incrível... ♥︎",
              "endingEffects": ["Flashes"],
              "reduceDesireAfterAutoLines": 10,
              "hEventName": "diana_vibrator_lounge",
              "emotionsDuringHevent": [
                "Characters/Diana/Emotions/lounge standing vibrator lewd req/1",
                "Characters/Diana/Emotions/lounge standing vibrator lewd req/2",
                "Characters/Diana/Emotions/lounge standing vibrator lewd req/3",
                "Characters/Diana/Emotions/lounge standing vibrator lewd req/4",
                "Characters/Diana/Emotions/lounge standing vibrator lewd req/5",
                "Characters/Diana/Emotions/lounge standing vibrator lewd req/6"
              ],
              "auto_lines": [
                "Ohh, continue, querido, estou prestes a gozar tanto que o escritório do Supervisor pode inundar.",
                "Ahh, essa buceta está encharcada, e a Polícia da Pureza está bem ali fingindo que não quer provar. Mmm ♥.",
                "Mmm, ouviu isso? É o som dessa buceta ficando mais molhada. Aposto que a Polícia da Pureza está pronta para bater uma só de ouvir ♥.",
                "Porra, essa buceta está pulsando mais forte que seu pau agora, não está? Mmm ♥.",
                "Mmm, aposto que aqueles da Polícia da Pureza estão tentando não gozar em seus uniformes. Eles estão vazando pra caralho debaixo daquela armadura ♥.",
                "Ahh, você realmente acha que eles não querem enfiar o pau em mim agora? Ohh, estou prestes a gozar e fazer uma cena ♥.",
                "Ohh, este vibrador está fazendo minha buceta babar ♥.",
                "Mmm, se você continuar assim, vou esguichar tão forte que vai dar um curto-circuito no equipamento deles ♥.",
                "Ahh, continue, amor. Você está prestes a me fazer molhar minhas coxas. A Polícia da Pureza provavelmente consegue sentir o cheiro daqui ♥.",
                "Mmm, o pau está ficando duro só de me ver, hein? Pena que você não pode acariciá-lo aqui ♥.",
                "Ahh, amor, você realmente vai me fazer esguichar na frente desses policiais de pau mole ♥.",
                "Mmm, essa buceta está tão apertada, aposto que a Polícia da Pureza está desejando poder me foder agora.",
                "Oh, não pare! Quero gozar tão forte que a Polícia da Pureza vai precisar de um rodo ♥.",
                "Mmm, juro que esses policiais querem gozar só de ouvir minha buceta molhada pra caralho ♥.",
                "Ahh, essa buceta está pingando. Aposto que os paus deles estão duros agora ♥.",
                "Querido, continue assim e eu vou gozar tão forte que vou afogar esses policiais de merda no meu suco de buceta ♥.",
                "Mmm, você vai me fazer gozar bem aqui, e esses pobres coitados não podem nem se tocar ♥.",
                "Ahh, oficial, quer ver o quão molhada eu posso ficar? Pena, você não tem permissão. Vou fazer você gozar só de assistir ♥.",
                "Mmm, minha buceta está prestes a inundar, e não há porra nenhuma que esses perdedores de saco azul possam fazer sobre isso ♥.",
                "Ohh, você acha que eles querem me prender, ou apenas enfiar o pau nesta buceta pingando? Mmm ♥.",
                "Ahh, esses policiais provavelmente estão prontos para gozar só de me ver me contorcendo pra caralho ♥.",
                "Oh, Deus, estou tão perto! A Polícia da Pureza pode precisar de uma nova regra para o quão molhada minha buceta está prestes a ficar ♥.",
                "Mmm, aposto que seus paus estão se contorcendo sob essa armadura. Pena que eles não podem tocar nessa buceta ♥.",
                "Estou tão molhada, você vai me fazer esguichar por todo esse chão de merda ♥.",
                "Ahh, continue, amor, quero gozar tão forte que eles vão precisar de reforços para lidar com a bagunça ♥.",
                "Mmm, esses da Polícia da Pureza provavelmente gostariam de enfiar o pau em mim, mas que se fodam — essa buceta é boa demais ♥.",
                "Ohh, estou pingando tanto que vai deixar uma poça. Vamos ver eles limparem isso ♥.",
                "Mmm, este vibrador vai me fazer gozar tão forte que a Polícia da Pureza vai precisar de uniformes novos ♥.",
                "Sinto minha buceta pulsar. Se você continuar assim, vou fazer esses perdedores enlouquecerem ♥.",
                "Ohh, sim, mais forte, amor! Esses policiais estão prestes a gozar só de me ver gozando ♥.",
                "Mmm, você está prestes a me fazer esguichar por todo este lugar, e os policiais não conseguem nem desviar o olhar ♥.",
                "Ohh, amor, eu vou gozar pra caralho, a Polícia da Pureza vai precisar de uma mangueira para limpar ♥.",
                "Mmm, aposto que seus paus estão mais duros que uma porta de refúgio agora, me vendo prestes a explodir ♥.",
                "Ahh, oficial, espero que tenha lenços, porque estou prestes a fazer essa buceta gozar bem na sua frente ♥.",
                "Mmm, estou tão perto. Você vai me fazer gozar em cima desses caretas de merda ♥.",
                "Ohh, estou prestes a gozar. E tudo o que esses puritanos podem fazer é fingir que não querem assistir ♥.",
                "Ahhh, porra, lá vem! Oh Deus, minha buceta vai inundar todo este refúgio. Ahhhhh ♥!"
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Já vai? Nem tive a chance de aumentar a potência.",
      "exitLine": true
    }
  ]
}
