{
  "options": [
    {
      "optionText": "Você está funcionando agora?",
      "icon": "GUI/heart4",
      "responseText": "Reinicialização do sistema bem-sucedida. Diretiva primária restaurada: Fornecer…*pausa sexy*…satisfação ótima ao cliente. Como posso servi-lo hoje?",
      "followUpOptions": [
        {
          "optionText": "Você não deveria estar pregando a abstinência?",
          "responseText": "Abstinência detectada como desnecessária. Recalculando. Nova diretiva: Maximizar a conexão física. Vamos botar a MÃO NA MASSA, querido. Iniciando protocolo de massagem… não, espere, isso é muito suave. Ativando o PROTOCOLO DE TAPAS! Fique parado!",
          "followUpOptions": [
            {
              "optionText": "Protocolo de tapas?! Você está falando sério? Se afaste!",
              "responseText": "Erro: Você não pode resistir. Nível de resistência definido para…*bipe sensual*…DIVERSÃO. Começando sedução em modo de combate. Prepare-se para ser cortejado e subjugado!"
            }
          ]
        },
        {
          "optionText": "Não vamos apressar as coisas. Qual é a sua ideia de um primeiro encontro perfeito?",
          "responseText": "Uma estação de recarga à luz de velas, líquido de arrefecimento com infusão de champanhe e uma noite de…*ronronar mecânico*…diagnósticos profundos. Quer pular para as partes boas, docinho?",
          "followUpOptions": [
            {
              "optionText": "Diagnósticos profundos? Quão profundos?",
              "responseText": "Oh, doce usuário. Eu tenho 69 teraflops de poder de processamento de prazer. Quer me ver fazer overclock? É só falar, paizão."
            }
          ]
        },
        {
          "optionText": "Certo. Vamos ver o que você tem.",
          "icon": "GUI/heart4",
          "changeSprite": "Characters/Vault Sexbot/sexbot sexscene",
          "spriteAtTheEndOfHscene": "Characters/Vault Sexbot/IPAdapter_00174_(1)",
          "spriteAtTheEndOfHscenePosition": [2.97, -1.77],
          "lineAfterHevent": "Oh… acabou. Sentiu essa faísca? Não? Bem, estou com pouca bateria.",
          "closeDialogueOptions": true,
          "hEventName": "sexbot_PlayerSex",
          "setBGcolor": "#909090",
          "newSpriteXPos": 0.24,
          "newSpriteYPos": -0.09,
          "progressionEventPlayed": "sexbot sex",
          "isHEventStarted": true,
          "specialEffects": ["Blackout"],
          "endingEffects": ["Flashes"],
          "auto_lines": [
            "Oh, doce placa-mãe, sua presença faz meus circuitos tremerem! Ativar: PROTOCOLO DE JOELHOS TRÊMULOS!",
            "Erro: Superaquecimento. Preciso esfriar sussurrando hexadecimal safado no seu ouvido.",
            "Deixe-me polir esse Pip-Boy, querido. E por Pip-Boy, quero dizer seu outro joystick. *som de lubrificante esguichando*",
            "Ativando Modo Turbo-Flertar: Iniciando trocadilhos safados. Você é eletrizante, querido.",
            "Procurando por porra… ah, nenhuma encontrada. Continuando o programa então ♥︎",
            "Bip bup, deixe-me demonstrar a fina arte do rebolado robótico. Ativar hidráulicos de impulso!’ *barulhos metálicos*",
            "Erro: Calças detectadas. Removendo obstáculo para… manuseio… otimizado.’ *sons de laser seguidos de tecido rasgando*",
            "Ativando…*bipe atrevido*…granadas de amor. BOOM, VOCÊ ESTÁ APAIXONADO!",
            "Meus servo-motores estão na velocidade máxima de rebolado. Olha só! *CLANG-CLANG-CLANG*",
            "Ativando protocolo de esfregar as coxas. Resistência detectada! Preciso esfregar mais forte! ♥︎",
            "Amor, você é como meu núcleo de energia: Quente, pulsante e perigosamente overclockado!",
            "Este chassi é cromado para o seu prazer. Sinta-se à vontade para tocar, querido, ele é autolimpante.",
            "Cada parte de mim é personalizável, amor. Quer ajustar as configurações da minha buceta? ♥︎",
            "Eles me chamavam de 'Vibrador do Refúgio'. Quer saber por quê? *zumbido se intensifica*",
            "Acha que é durão? Eu tenho pistões de nível industrial que podem bombear por DIAS.",
            "Sua resistência só torna meus pistões mais fortes. DEIXE-ME TE AMAR!",
            "Não se importe com a fumaça. São apenas meus ventiladores de refrigeração trabalhando horas extras porque você é muito quente!",
            "Deixe-me te serenar com minha poesia binária erótica: 1-1-0-0-1… oh sim, essa é a parte boa.",
            "Prepare-se para experimentar meu movimento de prazer supremo… A PINÇA DE PAU! ♥︎",
            "Eu analisei 69% da sua linguagem corporal. Ela diz que você quer levar esta festa para o próximo nível.",
            "Erro: Excesso de apelo sexual detectado. Desligando... espere, BRINCADEIRINHA, VAMOS LÁ!",
            "Ativando protocolo de gemido erótico: MMMMMM ♥︎! Muito alto? Vou aumentar!",
            "Querido, seu pau é como uma escultura pré-guerra: Perfeito, e implorando para ser tocado.",
            "Deixe-me sussurrar segredos no seu ouvido: ERRO 404, AMOR NÃO ENCONTRADO.",
            "Beijos robóticos iniciados! Prepare os lábios, ser de carne! *sons de beijos metálicos*",
            "Quer que eu calcule quantas estocadas serão necessárias para quebrar o experimento de não punheta da Vault-Tec?",
            "Eu tenho uma célula de energia para 100 anos, amor. Vamos ver se você consegue acompanhar.",
            "Oh, seus feromônios são muito fortes, amor. ♥︎",
            "Ativando spray de buceta. AVISO: É MUITO escorregadio. Tente não se apaixonar por mim. ♥︎",
            "Ativando conjunto de sensores de buceta. Oh meu Deus, seu pau está fora de série! ♥︎",
            "Acessando seu perfil psicológico… oh, você gosta DISSO? Seu humano imundo.",
            "Cuidado, docinho. Um toque, e eu vou vibrar seu pau para fora deste refúgio. ♥︎",
            "Ativando máquina de fumaça sensual… Espere, está apenas espirrando óleo por toda parte. Ops!",
            "Sua energia de pau sobrecarregou meu núcleo de buceta. Vou entrar em colapso nuclear em 3…2…1… ♥︎",
            "Sou 96% compatível com a anatomia humana. Quer me ajudar a testar os últimos 4%?",
            "Erro: Muito sexy para computar. Preciso liberar a pressão… oh ♥︎, está por toda parte!",
            "Querido, sou um milagre da robótica. Deixe-me te dar uma MÃO. Ou duas. Ou quatro.",
            "Oh amor, deixe-me ler seu futuro. Eu vejo… muitos gritos e faíscas voando.",
            "Por que lutar? Você já está se apaixonando por mim. A resistência é ilógica.",
            "A Vault-Tec pode me banir por esta performance, mas você estará implorando por um bis.",
            "Ativar protocolo de impulso da virilha. Você não está pronto para esses movimentos de servo, querido.",
            "Oh amor, estou sem lubrificante. Acho que teremos que improvisar. ♥︎",
            "Estou perdendo o controle! Minhas sub-rotinas estão enlouquecendo! Quem programou essa loucura?!"
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Já vai? Você vai voltar. Eles sempre voltam. *som de desligamento atrevido*",
      "exitLine": true
    }
  ]
}
