{
  "options": [
    {
      "optionText": "Então... gostou do show?",
      "onlyShowIfProgressionEventPlayed": "barnFuck",
      "responseText": "*Sorri com dentes amarelados* Heh... pode apostar que sim. Pensei que os gemidos dela iam soltar minhas correntes. Fazia tempo que não via uma buceta ser trabalhada assim. Merda—me fez desejar que meu pau não tivesse apodrecido.",
      "exitLine": true
    },
    {
      "optionText": "Encontrei as chaves. Aqui, você está livre agora.",
      "icon": "GUI/quest mark",
      "itemRequired": "Keys",
      "giveItemToCharacter": "Keys",
      "showChoiceStats": "ghoul_escape",
      "onlyDisplayIfHasObjective": "Get the Keys from Mr. Greaves",
      "responseText": "*Olhos se arregalam em descrença* Você... você realmente fez isso, pele-lisa. Não pensei que viveria para ver este dia. Certo, um acordo é um acordo. Assim que estivermos livres, eu te mostro a localização daquele tesouro.",
      "markObjectiveComplete": "Get the Keys from Mr. Greaves",
      "giveItem": "Keys",
      "followUpOptions": [
        {
          "optionText": "Não, eu quero a localização do tesouro agora.",
          "icon": "GUI/quest mark",
          "responseText": "*Ele suspira.* Certo, certo — bastardo insistente. Vá para o sul até a terra virar lama. Há um ônibus afundado nos Pântanos—meio engolido pela sujeira. Suba pelo teto quebrado, depois procure debaixo do assento do motorista. Caixa de munição soldada na estrutura. Esse é o seu pagamento.",
          "exitLine": true,
          "fadeOutCharacter": true,
          "addObjective": "Find the treasure.",
          "killCharacter": true,
          "progressionEventPlayed": "gotTreasureLocation"
        },
        {
          "optionText": "Certo, vou confiar em você. É melhor não estar mentindo.",
          "responseText": "Você tem coragem, pele-lisa. Farei valer a pena, eu prometo.",
          "exitLine": true,
          "killCharacter": true,
          "fadeOutCharacter": true
        }
      ]
    },
    {
      "optionText": "Foi você quem pegou as roupas dela?",
      "onlyDisplayIfHasObjective": "Find June's clothes",
      "icon": "GUI/quest mark",
      "dontShowIfProgressionEventPlayed": "gotFarmerClothes",
      "responseText": "*Sorri com dentes rachados* Heh... Talvez tenha sido. Um pouco de diversão nunca fez mal a ninguém. A garota deixou penduradas como isca. Pensei em mantê-las seguras... bem perto. Quer de volta? Vai te custar 20 caps.",
      "followUpOptions": [
        {
          "optionText": "Para que você precisa de caps? Você é um escravo.",
          "responseText": "*Bufa* As caravanas passam de vez em quando, e um cara com um pouco de lábia ainda consegue o que quer. Jet não julga, e nem os comerciantes que querem ganhar um cap rápido. Só precisa ser sorrateiro."
        },
        {
          "optionText": "Certo. Aqui estão 20 caps. Agora entregue-as.",
          "capsRequired": 20,
          "addCaps": -20,
          "icon": "GUI/quest mark",
          "responseText": "*Ri* Prazer em fazer negócios, pele-lisa. Elas estão escondidas no palheiro — lado esquerdo, debaixo da lona. Não diga que nunca te dei nada.",
          "progressionEventPlayed": "gotFarmerClothes",
          "giveItem": "Farmer's Daughter's Clothes",
          "exitLine": true
        },
        {
          "optionText": "Bastardo doente. Fique com elas.",
          "responseText": "*Ri de forma rouca e profunda* Não se faça de superior. O mundo é feio demais para santos.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Qual é a sua história?",
      "responseText": "*Tosse* Heh... Não é grande coisa, pele-lisa. Consegui um lugar na primeira fila quando as bombas caíram — não pensei que ainda estaria por aqui para me arrepender. Agora? Apenas mais um equipamento de fazenda com pulso.",
      "followUpOptions": [
        {
          "optionText": "Quantos de vocês estão presos aqui?",
          "responseText": "Quatro de nós, sem contar o que eles mataram de tanto trabalhar na semana passada. Acorrentaram-no com muita força."
        },
        {
          "optionText": "Por que vocês ainda não fugiram?",
          "responseText": "Você vê estas correntes, garoto? Não foram exatamente feitas para quebrar. E o Sr. Greaves? Aquele bastardo gorduroso não deixa as chaves por aí. Quer nos ouvir chacoalhar quando ele passa."
        },
        {
          "optionText": "Por que eu deveria arriscar meu pescoço por você?",
          "progressionEventPlayed": "ghoulAskedForHelp",
          "icon": "GUI/quest mark",
          "dontDisplayIfHasObjective": "Get the Keys from Mr. Greaves",
          "responseText": "Porque estou te oferecendo algo melhor que um sentimento caloroso e fofo. Eu sei onde há um tesouro, um tesouro de verdade. Se você nos conseguir aquelas chaves, eu te levo direto a ele.",
          "followUpOptions": [
            {
              "optionText": "Você espera que eu acredite nisso?",
              "responseText": "Acredite no que quiser, pele-lisa. Só lembre-se, quando estiver dormindo na terra, você dispensou o maior pagamento de uma vida."
            },
            {
              "optionText": "Como eu te liberto?",
              "icon": "GUI/quest mark",
              "responseText": "Simples. O Sr. Greaves carrega as chaves. Você o encontra, você as pega. Sem tiros, sem grandes heroísmos. Apenas... pegue a porra das chaves. Nós cuidamos do resto.",
              "followUpOptions": [
                {
                  "optionText": "Certo. Fique aí, vou pegar as chaves.",
                  "addObjective": "Get the Keys from Mr. Greaves",
                  "icon": "GUI/quest mark",
                  "responseText": "Heh... Essa é a melhor notícia que ouvi em duzentos anos. Não nos faça esperar, garoto.",
                  "exitLine": true
                },
                {
                  "optionText": "Esqueça. Não é problema meu.",
                  "responseText": "*Tosse forte* É... assim é o mundo. A podridão está funda, pele-lisa. Bem funda.",
                  "exitLine": true
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
