{
  "options": [
    {
      "optionText": "História engraçada—sua filha provavelmente já virou carne de mutante. Vendi ela para um bando de super mutantes famintos. Precisava dos caps. Espero que entenda.",
      "onlyShowIfProgressionEventPlayed": "grace_sold_to_supermutants",
      "responseText": "Você… fez o quê? Seu desgraçado doente. Você entra na MINHA fortaleza, me encara nos olhos, e admite que entregou minha carne e sangue para aquelas abominações babonas? É melhor rezar para estar brincando, porque a morte é rápida demais para o inferno que vou te mostrar se estiver falando sério.",
      "followUpOptions": [
        {
          "optionText": "Falando seríssimo. Aqueles malucos pagam bem—especialmente quando tem carne fresca envolvida.",
          "exitLine": true,
          "responseText": "Eu já arranquei a pele de homens por muito menos. Você não vai sair daqui vivo—mas vou garantir que cada minuto doa mais que o anterior."
        },
        {
          "optionText": "Ei, negócios são negócios. Não é minha culpa se sua princesinha preciosa não conseguiu um preço melhor em outro lugar.",
          "exitLine": true,
          "responseText": "Então vamos falar de negócios, vadia. Quantos ossos você acha que precisa quebrar antes de estarmos 'quites'? Eu vou contando. Você só grita."
        },
        {
          "optionText": "Calma, Barão. Ela pode estar viva, provavelmente como o bicho de estimação ou matriz de algum mutante agora. Talvez você possa comprá-la de volta?",
          "responseText": "Comprá-la de volta? Foda-se isso—vou massacrar cada mutante que encontrar, depois pregar seu cadáver se contorcendo nos meus portões como um lembrete para qualquer um estúpido o suficiente para me cruzar.",
          "followUpOptions": [
            {
              "optionText": "Bem, merda, não pensei que você realmente se importaria tanto.",
              "exitLine": true,
              "responseText": "Importar? É sobre orgulho, babaca. Você mijou no meu nome. Vou mijar ácido nas suas feridas abertas."
            },
            {
              "optionText": "Talvez devesse me agradecer—pense nisso como amor bruto. Ela precisava endurecer de qualquer maneira.",
              "exitLine": true,
              "responseText": "Vou ter isso em mente quando meus rapazes alimentarem os cães com seus dedos. Vamos ver quão durão você é então."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Seu problema com a Irmandade foi resolvido.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Report back to Baron.",
      "markObjectiveComplete": "Report back to Baron.",
      "responseText": "Bem, foda-me de lado. Pensei que você ia amarelar, mas parece que você tem culhões, afinal. Diga-me, nosso pequeno 'profeta do pau' guinchou quando você o estripou, ou ele gostou até o amargo fim?",
      "followUpOptions": [
        {
          "optionText": "Digamos que os gritos dele foram orgásmicos.",
          "exitLine": true,
          "addCaps": 200,
          "responseText": "Ha! Essa é exatamente a poesia fudida que eu esperava. Aqui estão seus caps, mais um extra pela arte. Você é um doente, e eu respeito isso."
        },
        {
          "optionText": "Ele implorou por misericórdia, então não dei nenhuma.",
          "exitLine": true,
          "addCaps": 200,
          "responseText": "Misericórdia é só preliminares de qualquer maneira. Fico feliz em ouvir que você não decepcionou. Aceite isso—moralidade é uma doença, e fico feliz em ver que você finalmente está curado."
        },
        {
          "optionText": "Fique com seus caps. Cansei da sua merda de psicopata.",
          "exitLine": true,
          "responseText": "Ah, por favor. Você finge que está enojado, mas vai rastejar de volta quando seus bolsos ficarem vazios. A violência é como uma puta barata—uma vez que você prova, não tem mais volta."
        }
      ]
    },
    {
      "optionText": "Trouxe sua preciosa filha, velho. Viva, na maior parte.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Bring Grace to her father.",
      "progressionEventPlayed": "met_graces_father",
      "responseText": "Hm. Então você é o verme que tirou a Grace daquelas Vadias Saqueadoras. Você espera aplausos, herói?",
      "followUpOptions": [
        {
          "optionText": "Sem aplausos. Caps servem.",
          "icon": "GUI/quest mark",
          "responseText": "Caps, hein? Quantos pedaços de lixo você acha que vieram farejando por aqui atrás de caps? Você tem sorte que ela está viva, ou eu teria sua cabeça decorando meu portão.",
          "followUpOptions": [
            {
              "optionText": "Me ameace de novo, e eu devolvo a Grace para aquelas saqueadoras, pedaço por pedaço.",
              "exitLine": true,
              "icon": "GUI/quest mark",
              "markObjectiveComplete": "Bring Grace to her father.",
              "addCaps": 500,
              "showChoiceStats": "grace_returned_home",
              "removeFollower": "Grace",
              "responseText": "Você tem culhões, admito. Conversa perigosa no meu território. Mas divertida o suficiente. Certo. 500 caps. Mais do que você vale. Pegue-os e lembre-se da generosidade do fodido Barão Voss."
            },
            {
              "optionText": "Quero ver você tentar, velho.",
              "exitLine": true,
              "addCaps": 500,
              "icon": "GUI/quest mark",
              "removeFollower": "Grace",
              "markObjectiveComplete": "Bring Grace to her father.",
              "showChoiceStats": "grace_returned_home",
              "responseText": "Ha! Você é louco ou o bastardo mais burro andando por esta terra devastada. De qualquer forma, é divertido. Vou te pagar 500 caps pelo entretenimento. Agora vá embora, antes que eu reconsidere."
            }
          ]
        },
        {
          "optionText": "Grace mencionou que você pagaria bem pelo retorno dela. Parece que ela exagerou seu amor.",
          "responseText": "Amor? Merda sentimental apodrece mais rápido que cadáveres nesta terra devastada. Grace é uma propriedade valiosa. Você recuperou meu investimento—só isso. Não confunda isso com gratidão."
        },
        {
          "optionText": "Aquelas Vadias Saqueadoras tinham grandes planos para a Grace. Ouvi dizer que você não era exatamente o pai do ano.",
          "responseText": "Divertido. Saqueadoras fofocando como donas de casa da wasteland. A verdade é que sou pior do que imaginam. Faço a violência delas parecer misericordiosa. Lembre-se disso da próxima vez que pensar em me ameaçar com as palavras delas."
        }
      ]
    },
    {
      "optionText": "Que lugar é este, afinal? Parece um pouco... limpo demais para a wasteland.",
      "progressionEventPlayed": "met_graces_father",
      "responseText": "Cumorah Crest. É limpo porque jogamos o lixo para fora—rápida e violentamente. Muros mantêm os problemas afastados, e dentro, minhas regras mantêm os encrenqueiros quietos.",
      "followUpOptions": [
        {
          "optionText": "Esses muros não impediram que a Grace fosse raptada, no entanto.",
          "responseText": "Cuidado, forasteiro. Agradeço seu esforço—mas desrespeite meus muros de novo, e a única maneira de você entrar em Cumorah Crest será como fertilizante."
        },
        {
          "optionText": "Estrutura impressionante. Como conseguiu construir algo assim?",
          "responseText": "Do mesmo jeito que tudo que vale a pena é construído aqui—caps, sangue e ossos quebrados. É uma receita simples; as pessoas esquecem o terceiro passo até que eu as lembre."
        },
        {
          "optionText": "Grace mencionou que você era um 'Barão'. É algum título de merda do mundo antigo, certo?",
          "responseText": "Títulos são poder. Você zomba do que teme, mas as pessoas se curvam à força—mundo antigo ou novo.",
          "followUpOptions": [
            {
              "optionText": "Então, você comanda um pequeno reino da wasteland aqui?",
              "responseText": "Reino, ditadura—chame como quiser. O fato é que, lá fora você é presa. Aqui dentro, você é útil ou fertilizante."
            },
            {
              "optionText": "E a Grace? Ela é apenas mais uma ferramenta para o seu poder?",
              "responseText": "Ela é sangue. Sangue significa legado, e legado é sobrevivência. Mas até o sangue pode esfriar se se tornar um fardo."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Algum trabalho por aqui? Você parece alguém com... problemas.",
      "dontDisplayIfHasObjective": "Eliminate the outcast.",
      "dontDisplayIfObjectiveComplete": "Eliminate the outcast.",
      "dontShowIfProgressionEventPlayed": "refused_baron_quest",
      "icon": "GUI/quest mark",
      "responseText": "Todo mundo tem problemas. A diferença é que meus problemas geralmente deixam manchas de sangue e gritos. Você está a fim desse tipo de resolução de problemas?",
      "followUpOptions": [
        {
          "optionText": "Depende. Os caps correspondem aos gritos?",
          "icon": "GUI/quest mark",
          "responseText": "Os caps fluem mais rápido quando os gritos ficam mais altos. Tem um renegado da Irmandade por aí pregando viadagem, corrompendo cada mancha de merda que encontra. Ele tem um alto-falante improvisado também—transmitindo seu lixo de culto por metade das terras devastadas. Quero a cabeça dele decorando meu portão—de preferência ainda gritando.",
          "followUpOptions": [
            {
              "optionText": "A Irmandade não costuma deixar seus cavaleiros soltos. Qual é a dele?",
              "responseText": "Versão oficial? Ele não conseguia manter o pau na calça perto dos outros cavaleiros. Agora ele está recrutando os rejeitados da wasteland—transformando degenerados em viados com a mesma mentalidade. É ruim para os meus negócios, e ainda pior para a minha digestão."
            },
            {
              "optionText": "Você está me pagando para matar um homem só porque ele prefere pau?",
              "icon": "GUI/quest mark",
              "responseText": "Eu não poderia me importar menos onde ele enfia. O problema é que ele transformou seus gostos de quarto em uma maldita religião—com batidas de baixo e 'louvado seja o pau' ecoando por quilômetros. Todo viciado de vontade fraca está fazendo fila para adorar em seu altar—e esse altar está perto demais dos meus muros.",
              "followUpOptions": [
                {
                  "optionText": "Certo. Dobre meu pagamento e eu o prego nos seus portões pessoalmente.",
                  "icon": "GUI/quest mark",
                  "exitLine": true,
                  "addObjective": "Eliminate the outcast.",
                  "progressionEventPlayed": "accepted_baron_quest",
                  "showChoiceStats": "accepted_baron_quest2",
                  "responseText": "Agora você está falando minha língua. Certifique-se de que ele esteja vivo o suficiente para se arrepender de cada palavra que já pregou. Quanto mais sangrenta a mensagem, maior seu bônus."
                },
                {
                  "optionText": "Não estou interessado em ser seu carrasco pessoal.",
                  "exitLine": true,
                  "progressionEventPlayed": "refused_baron_quest",
                  "showChoiceStats": "refused_baron_quest",
                  "responseText": "Moralidade? Aqui? Fofo. Talvez eu te deixe ir—e quando ele eventualmente aparecer com sua gangue de chupa-rolas, vamos te enforcar ao lado dele."
                }
              ]
            },
            {
              "optionText": "Um exilado da Irmandade formando seu próprio culto? Parece interessante.",
              "responseText": "Ele é patético e merda patética ainda fede. O fedor dele está passando por cima dos meus muros. Apague-o antes que eu decida que você faz parte do problema."
            }
          ]
        },
        {
          "optionText": "Acho que vou passar. Já vi sangue demais por hoje.",
          "exitLine": true,
          "responseText": "Então você não vai durar muito por aqui. A wasteland devora os estômagos fracos primeiro."
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Fora. Se nos encontrarmos de novo, não serão palavras que trocaremos.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Você parece perdido, andarilho. Continue andando, a menos que queira se voluntariar para fertilizar meu jardim."
  ],
  "showShadowFigures": "Cumorah Crest Guard"
}
