{
    "options": [
    {
        "optionText": "[Report to the Purity Police]",
        "responseTexts": ["You really think tattling is gonna make your dick any bigger? Go ahead, try me. I’ve got dirt on them that’ll make your head spin!"],
        "emotion": "Characters/Overseer Daughter/emotions/angry",
        "exitLine": true, 
        "fadeOutCharacter": true,
        "specialEffects": ["removeBlur", "removeVignette"],
        "reported": 5
    },
    {
        "optionText": "[Watch secretly]",
        "specialEffects": ["removeBlur"],
        "exitLine": true,
        "icon": "GUI/eye icon",
        "isHEventStarted": true,
        "closeDialogueOptions": true, 
        "hEventName": "daughter_boogie_fuck",
        "progressionEventPlayed": "daughter_boogie_fuck",
        "emotionsDuringHevent": ["none", "Characters/Overseer Daughter/emotions/sex with boogey/1", "Characters/Overseer Daughter/emotions/sex with boogey/2", "Characters/Overseer Daughter/emotions/sex with boogey/3", "Characters/Overseer Daughter/emotions/sex with boogey/4", "Characters/Overseer Daughter/emotions/sex with boogey/5", "Characters/Overseer Daughter/emotions/sex with boogey/6" ],
        "lineAfterHevent": "Ahh... it was amazing... ♥︎",
        "auto_lines": ["Ahh, fuck! Who knew the Boogie was packing a dick like a deathclaw?! ♥︎",
"Mmm, ohh, you’re deeper in my ass than the vault’s fucking security!",
"Ahh, keep going... make me cum!",
"Fuck, who needs contraband when you’re smuggling that between your legs. ♥︎",
"Mmm, you’re gonna break me, and I fucking love it, ahh! ♥︎",
"Holy shit, that dick feels like it’s gonna unlock a new vault door!",
"Mmm, ohh, fuck, if my dad knew about this, he’d have a stroke—and I’m about to have one too!",
"Ahh, you’re making my pussy cum like a busted water pipe! ♥︎", 
"Fuck, you better sell that dick on the black market because I’d pay a lot for this!",
"Mmm, ohh, fuck, you’re making me cum harder than a super mutant on Jet!",
"Ahh, who knew breaking the Overseer’s rules would feel this fucking good ♥︎",
"Mmm, ohh, I’m gonna cum so hard, my ass’s gonna need a fucking reboot!", 
"Mmm, keep going, you’re drilling deeper than a mole rat in heat!",
"Ahh, your dick should come with a fucking radiation warning!",
"Mmm, I’m cumming harder than a deathclaw on a rampage! ♥︎",
"Fuck, don’t stop until I’m more spent than our fucking water purifier!",
"Ahh, mmm, your dick’s a fucking super stimpack, and I’m fucking addicted!",
"Ohh, I swear you’re gonna turn my ass into a fucking vault door with how hard you’re pounding!",
"Mmm, ahh, keep fucking me like you’re raiding the Overseer’s office!",
"Ohh, I’m cumming harder than when I sabotaged the fucking power core!",
"Fuck, your dick’s making my ass cum like a broken reactor!",
"Ahh, ohh, my pussy’s dripping like a leaky radaway pouch!", 
"Fuck, you’re hitting me harder than the Purity Police with their Bonk Batons!",
"Ahh, if I cum any harder, I’m gonna crash the fucking vault’s entire power grid!",
"Mmm, ohh, you’re more dangerous than half the shit you sell!", 
"Mmm, your dick’s like a fucking fusion core, and I’m overheating! ♥︎",
"Fuck, you’re pounding me harder than my dad pounds those dumb vault rules!",
"Ahh, mmm, I haven’t cum this hard since I fucked up the Overseer’s last meeting!",
"Mmm, you’re gonna make me squirt like a broken water valve!",
"Ohh, I swear I can feel your dick in my fucking stomach!",
"Fuck, you’re making my pussy wetter than the fucking purification plant!",
"Ahh, I’m cumming so hard, I’m seeing stars... or maybe that’s just the lack of oxygen!",
"Mmm, ohh, your dick should be illegal in this vault—it’s a fucking weapon of mass destruction!",
"Fuck, you’re pounding my ass like a fucking radscorpion attack!",
"Mmm, I’m cumming so hard, I might need to start selling this experience!",
"Mmm, keep going, or I’m telling everyone the Boogie’s got a weak dick!",
"Ahh, I’m gonna cum harder than the time we flooded the Overseer’s quarters!",
"Ahh, I’m cumming harder than a Yao Guai charging at full speed! Ahhhhh! ♥︎" ],
    "endingEffects": ["Flashes"]
    }
    ],
    "auto_lines": ["Mmm, keep going, or I’m telling everyone the Boogie’s got a weak dick!",
    "Ahh, ohh, my pussy’s dripping like a leaky radaway pouch! ♥︎" ] 
}
