{
  "options": [
    {
      "optionText": "[Denunciar para a Polícia da Pureza]",
      "responseTexts": [
        "Você realmente acha que dedurar vai fazer seu pau crescer? Vai em frente, tenta a sorte. Eu tenho podres sobre eles que vão te deixar de cabelo em pé!"
      ],
      "emotion": "Characters/Overseer Daughter/emotions/angry",
      "exitLine": true,
      "fadeOutCharacter": true,
      "specialEffects": ["removeBlur", "removeVignette"],
      "reported": 5
    },
    {
      "optionText": "[Observar secretamente]",
      "specialEffects": ["removeBlur"],
      "exitLine": true,
      "icon": "GUI/eye icon",
      "isHEventStarted": true,
      "closeDialogueOptions": true,
      "hEventName": "daughter_boogie_fuck",
      "progressionEventPlayed": "daughter_boogie_fuck",
      "emotionsDuringHevent": [
        "none",
        "Characters/Overseer Daughter/emotions/sex with boogey/1",
        "Characters/Overseer Daughter/emotions/sex with boogey/2",
        "Characters/Overseer Daughter/emotions/sex with boogey/3",
        "Characters/Overseer Daughter/emotions/sex with boogey/4",
        "Characters/Overseer Daughter/emotions/sex with boogey/5",
        "Characters/Overseer Daughter/emotions/sex with boogey/6"
      ],
      "lineAfterHevent": "Ahh... foi incrível... ♥︎",
      "auto_lines": [
        "Ahh, porra! Quem diria que o Boogie tinha um pau do tamanho de um deathclaw?! ♥︎",
        "Mmm, ohh, você está mais fundo na minha bunda do que a porra da segurança do refúgio!",
        "Ahh, continue... me faça gozar!",
        "Porra, quem precisa de contrabando quando você está escondendo isso entre as pernas. ♥︎",
        "Mmm, você vai me quebrar, e eu amo isso pra caralho, ahh! ♥︎",
        "Puta que pariu, esse pau parece que vai destravar uma nova porta de refúgio!",
        "Mmm, ohh, porra, se meu pai soubesse disso, ele teria um derrame—e eu estou prestes a ter um também!",
        "Ahh, você está fazendo minha buceta gozar como um cano de água estourado! ♥︎",
        "Porra, é melhor você vender esse pau no mercado negro porque eu pagaria muito por isso!",
        "Mmm, ohh, porra, você está me fazendo gozar mais forte que um super mutante chapado de Jet!",
        "Ahh, quem diria que quebrar as regras do Supervisor seria tão bom pra caralho ♥︎",
        "Mmm, ohh, vou gozar tanto que minha bunda vai precisar de um reboot!",
        "Mmm, continue, você está perfurando mais fundo que uma ratazana no cio!",
        "Ahh, seu pau deveria vir com um aviso de radiação!",
        "Mmm, estou gozando mais forte que um deathclaw enfurecido! ♥︎",
        "Porra, não pare até eu estar mais acabada que a porra do nosso purificador de água!",
        "Ahh, mmm, seu pau é um super stimpack, e eu estou viciada pra caralho!",
        "Ohh, juro que você vai transformar minha bunda numa porta de refúgio de tanto que está me batendo!",
        "Mmm, ahh, continue me fodendo como se estivesse invadindo o escritório do Supervisor!",
        "Ohh, estou gozando mais forte do que quando sabotei o núcleo de energia!",
        "Porra, seu pau está fazendo minha bunda gozar como um reator quebrado!",
        "Ahh, ohh, minha buceta está pingando como uma bolsa de radaway furada!",
        "Porra, você está me batendo mais forte que a Polícia da Pureza com seus Cacetetes Bonk!",
        "Ahh, se eu gozar mais forte, vou derrubar toda a rede elétrica do refúgio!",
        "Mmm, ohh, você é mais perigoso que metade da merda que vende!",
        "Mmm, seu pau é como um núcleo de fusão, e eu estou superaquecendo! ♥︎",
        "Porra, você está me batendo mais forte do que meu pai bate naquelas regras idiotas do refúgio!",
        "Ahh, mmm, não gozo tão forte desde que fodi a última reunião do Supervisor!",
        "Mmm, você vai me fazer esguichar como uma válvula de água quebrada!",
        "Ohh, juro que consigo sentir seu pau na porra do meu estômago!",
        "Porra, você está deixando minha buceta mais molhada que a porra da estação de purificação!",
        "Ahh, estou gozando tanto que estou vendo estrelas... ou talvez seja só a falta de oxigênio!",
        "Mmm, ohh, seu pau deveria ser ilegal neste refúgio—é uma arma de destruição em massa!",
        "Porra, você está batendo na minha bunda como um ataque de radscorpion!",
        "Mmm, estou gozando tanto que talvez precise começar a vender essa experiência!",
        "Mmm, continue, ou vou dizer a todos que o Boogie tem um pau fraco!",
        "Ahh, vou gozar mais forte do que quando inundamos os aposentos do Supervisor!",
        "Ahh, vou gozar mais forte que um Yao Guai avançando a toda velocidade! Ahhhhh! ♥︎"
      ],
      "endingEffects": ["Flashes"]
    }
  ],
  "auto_lines": [
    "Mmm, continue, ou vou dizer a todos que o Boogie tem um pau fraco!",
    "Ahh, ohh, minha buceta está pingando como uma bolsa de radaway furada! ♥︎"
  ]
}
