{
    "options": [
        {
            "optionText": "What the hell happened to the prices? Are you running a scam, or did inflation hit the vault overnight?",
            "responseText": "Oh, inflation hit, alright. Right after a certain someone went running their mouth to the Purity Police. Guess that someone forgot that loose lips raise prices... especially when they’re *my* prices.",
            "priceMultiplierHigherThan": 1,
            "hideOptionIfReqCheckFailed": true
        },
        {
            "optionText": "Gotta say, never thought I'd see you upright again after watching you fuck the Overseer's daughter.",
            "dontShowIfProgressionEventPlayed":"got_holotape_from_boggie",
            "onlyShowIfProgressionEventPlayed": "daughter_boogie_fuck",
            "responseText": "Shit, kid. You got keen eyes. You caught that, huh? Little bitch damn near drained me dry. Listen—keep your mouth shut, and I'll give you first dibs on my premium merchandise. Or fuck, maybe next time you wanna tag-team?",
            "followUpOptions": [ 
                {
                    "optionText": "Fuck yeah, count me in next time. I've wanted to taste that pussy for so long.",
                    "responseText": "Heh, knew you had it in you. Next time I'll make sure there's plenty of her left dripping for you—no promises I'll leave her coherent, though."
                },
                {
                    "optionText": "Was it her moaning 'Daddy Overseer' throughout?",
                    "responseText": "Tch—bitch has a thing for power play. Made me wear the old man's hat while she rode me like a radstag."
                },  
                {
                    "optionText": "Maybe I should tell the Overseer. Unless you sweeten the deal a little more.",
                    "responseText": "Damn, you're ruthless. Fine—I got a custom holotape featuring your favorite little vault princess herself. Take it for a spin, but keep your lips sealed.",
                    "progressionEventPlayed": "got_holotape_from_boggie",
                    "giveItem": "Project Peach: Daddy’s Not Home",
                    "exitLine": true
                }
            ]
        }, 
        {
            "optionText": "I want to buy things...",
            "isTrading": true,
            "neverGreyOut": true,
            "icon": "GUI/trade icon",
            "random_auto_line": ["Step into my office… Just kidding, my office is wherever we don’t get caught. So, what are you buying?","You’re one shady decision away from being my favorite customer. What’s your vice?", "Trading with the Boogeyman, huh? Your parents must be so proud. Or dead. Probably dead. Either way, let’s get down to it."]
        },
        {
            "optionText": "Uh... who are you?",
            "responseText": "Names are for those who can afford to be caught. But if you insist... They call me the Boogeyman. Or just Boogie. Your favorite salesman. I'm the guy who gets things—the things you're craving from outside Vault 6969. You looking to satisfy an itch or two?",
            "followUpOptions": [
                {
                    "optionText": "What kind of 'itch' we talking?",
                    "responseText": "The kind that could get us both thrown out. You want mags, toys, chems, or somethin'... wetter?",
                    "followUpOptions": [
                        {
                            "optionText": "Got anything that'll relieve stress—fast?",
                            "responseText": "Heh. I got jet, psycho, and a couple old holotapes that'll blow your mind—and maybe something else too."
                        },
                        {
                            "optionText": "You smuggle in actual porn? In Vault 6969?",
                            "responseText": "Damn right, kid. The Overseer's rules only make folks hornier. Supply and demand—basic economics."
                        }
                    ]
                },
                {
                    "optionText": "Sounds risky. What's in it for you?",
                    "responseText": "Caps, favors, pleasure. You name it. In here, everyone's desperate. And desperation pays well."
                },
                {
                    "optionText": "Why do they call you the Boogeyman?",
                    "responseText": "Because I’m the thing that goes bump in the night, the whisper you hear when you're all alone. I’m the dealer your parents warned you about."
                }
            ]
        } 
    ],
    "auto_lines": ["You look like you’ve seen some things. Lucky for you, I sell things that’ll make you forget all about them… until you remember halfway through a nervous breakdown."]
}
