{
  "options": [
    {
      "optionText": "O que está acontecendo aqui? Pensei que a Irmandade estivesse acima dessa merda de saqueador.",
      "progressionEventPlayed": "foundFarmersWife",
      "responseText": "Cuidado com esse tom, andarilho. Estamos ensinando lealdade a um fazendeiro local que achou que podia negar suprimentos para a Irmandade. A esposa dele se voluntariou como tributo—após alguma persuasão. Agora ela está aprendendo exatamente como é a autoridade da Irmandade.",
      "followUpOptions": [
        {
          "optionText": "Parece que seu 'treinamento' a quebrou direitinho.",
          "responseText": "Duas semanas em rotação com o esquadrão inteiro, e ela já está implorando por mais pau do que comida. Ela pode ter odiado no começo, mas agora ela geme como uma vadia da Irmandade toda vez que passamos por perto. Em breve, ela vai implorar para nunca a deixarmos ir.",
          "followUpOptions": [
            {
              "optionText": "O que acontece quando terminarem com ela?",
              "responseText": "Quando ela estiver completamente viciada em pau da Irmandade e devidamente inseminada, vamos mandá-la rastejando de volta para o marido, pingando nossa porra como um lembrete. Ou talvez a gente a mantenha aqui—todo posto avançado precisa de um depósito de porra dedicado."
            },
            {
              "optionText": "Qualquer um pode dar uma vez, ou isso é exclusivo da Irmandade?",
              "responseText": "Normalmente, é buceta só da Irmandade—mas se você estiver desesperado o suficiente, pode assistir. Talvez se estivermos nos sentindo generosos, deixaremos você bater uma ao som da autoridade da Irmandade batendo contra a buceta de fazendeira."
            },
            {
              "optionText": "Que porra é essa que ela está vestindo?",
              "responseText": "Heh, notou, hein? Nós a vestimos com equipamento de cavaleiro depenado—peitos nus saindo por uma armadura de reconhecimento aberta. A coleira no pescoço dela diz 'Depósito de Porra', só para ela não esquecer para que serve.",
              "followUpOptions": [
                {
                  "optionText": "Então vocês transformaram seu equipamento em roupa de vadia?",
                  "responseText": "Armadura é para guerreiros; roupa de vadia é para os bichinhos da Irmandade. Ajuda a lembrá-la exatamente a quem ela pertence—além disso, é fácil acesso sempre que o esquadrão precisa de alívio."
                }
              ]
            }
          ]
        },
        {
          "optionText": "Quebrar mulheres é uma prática comum da Irmandade agora?",
          "responseText": "Apenas quando os camponeses esquecem seu lugar. A Irmandade tem necessidades—comida, munição, buceta. Os locais fornecem de bom grado ou assistem a gente transformar suas esposas e filhas em brinquedos sexuais da Irmandade. Princípios são flexíveis por aqui. Se espalhar nosso domínio significa quebrar algumas vadias pelo caminho, que seja. Melhor uma puta cheia de porra do que um fazendeiro rebelde."
        },
        {
          "optionText": "A família está esperando que ela volte para casa.",
          "onlyDisplayIfHasObjective": "Bring the Farmer's Wife back",
          "icon": "GUI/quest mark",
          "exitLine": true,
          "dontShowIfProgressionEventPlayed": "gotFarmersWife",
          "responseText": "Então eles são tolos. A mulher que saiu não é a mesma que está aqui agora. Ela é propriedade da Irmandade. Mesmo que a deixássemos ir, ela não saberia mais onde fica sua casa."
        },
        {
          "optionText": "Você sabe daquele pregador falastrão? Ele virou comida de verme agora. Acho que você me deve uma por isso. Que tal deixá-la ir?",
          "onlyDisplayIfHasObjective": "Bring the Farmer's Wife back",
          "onlyDisplayIfObjectiveComplete": "Eliminate the Brotherhood outcast.",
          "icon": "GUI/quest mark",
          "fadeOutCharacter": true,
          "killCharacter": true,
          "dontShowIfProgressionEventPlayed": "gotFarmersWife",
          "progressionEventPlayed": "gotFarmersWife",
          "addFollower": "Mira",
          "exitLine": true,
          "responseText": "Heh… Aquele degenerado era uma mancha em nossas fileiras. Não posso dizer que sentimos falta de sua pequena 'filosofia'. Não é assunto da Irmandade, claro… mas você nos fez um favor. Certo. Leve a mulher. Só saiba que ela não é quem você lembra—e não venha chorando quando ela esquecer como viver fora de uma cadeia de comando."
        },
        {
          "optionText": "Eu troco este rifle por ela.",
          "onlyDisplayIfHasObjective": "Bring the Farmer's Wife back",
          "itemRequired": "Laser Rifle Mk IV",
          "hideOptionIfReqCheckFailed": true,
          "icon": "GUI/quest mark",
          "fadeOutCharacter": true,
          "killCharacter": true,
          "dontShowIfProgressionEventPlayed": "gotFarmersWife",
          "progressionEventPlayed": "gotFarmersWife",
          "addFollower": "Mira",
          "exitLine": true,
          "responseText": "Agora *essa é* uma oferta que vale a pena considerar. O estoque da Irmandade sempre precisa de brinquedos novos… e ela é apenas um buraco com peitos. Certo. Leve-a—o rifle primeiro. Mas não pense que ela vai parar de desejar o pau da Irmandade."
        },
        {
          "optionText": "Vocês são cavaleiros da Irmandade, não saqueadores. Tenham um pingo de dignidade.",
          "responseText": "Dignidade? Tivemos dignidade uma vez—ficou chato rápido. Agora preferimos obediência. Não finja que não faria o mesmo, forasteiro. Com ou sem armadura potente, a buceta fica ainda melhor quando chora 'Ad Victoriam'."
        }
      ]
    }
  ],
  "showShadowFigures": "BoS random",
  "auto_lines": [
    "F-foda-se... meu marido nunca me preencheu assim... M-mais, por favor... Eu—porra—preciso... uhhhnn... de pau da Irmandade... não consigo... respirar sem... paus dentro de mim...",
    "P-papai Paladino... por favor, arruíne... uhh—essa puta inútil... d-deus, me encha... engravide meu útero de vadia...",
    "P-por favor... senhor... n-não espere mais... goze dentro de mim de novo... serei um bom buraco... eu juro... uhh, porra—apenas me use...",
    "E-eu sou... porra—sou o bichinho de foda da Irmandade... n-não consigo mais pensar... apenas me encha, me foda, me engravide... m-mais pau, por favor... estou viciada... fooooda-se..."
  ]
}
