{
  "options": [
    {
      "optionText": "Que tipo de inferno eu acabei de soltar?",
      "onlyDisplayIfObjectiveComplete": "Turn the Mega Speaker on.",
      "responseText": "Oh, você acabou de dar à luz a um apocalipse induzido pelo baixo! Saqueadores estão gozando nas calças, mutantes estão se cagando, e virgens finalmente vão transar esta noite. Deus, aquela virada foi orgásmica!",
      "followUpOptions": [
        {
          "optionText": "E se os locais não gostarem?",
          "responseText": "Foda-se eles! Você não pode lutar contra a batida. É como herpes—contagioso e veio para ficar!"
        }
      ]
    },
    {
      "optionText": "Puta merda... isso foi intenso. Você já morreu, ou vamos para o segundo round?",
      "responseText": "Porra, papai, me dá um segundo! Você foi mais duro que o pau do Liberty Prime sem lubrificante! Se estiver pronto para o segundo round, pelo menos cuspa nele primeiro.",
      "followUpOptions": [
        {
          "optionText": "Que porra você disse? Guarde essa merda gay para você, esquisito.",
          "responseText": "Oh? Alguém ficou com medo que o pau tenha mexido quando eu gemi. Tudo bem, homofóbico-kun, vou guardar minha 'merda gay' para mim—a menos que você se incline e implore por ela.",
          "followUpOptions": [
            {
              "optionText": "Tenta a sorte, viado. Vou grampear seu cu e fazer você cagar sua espinha.",
              "exitLine": true,
              "responseText": "Mmm, ameaças violentas fazem meu pau pulsar. Continue falando assim e eu vou gozar só pelo abuso verbal. Continue—me machuque com palavras. Papai precisa de um motivo para chorar em sua armadura potente manchada de porra."
            }
          ]
        },
        {
          "optionText": "Eu nunca lutei com alguém como você. Talvez eu precise de terapia.",
          "responseText": "Terapia? Foda-se isso, abrace o trauma! Engarrafe, fermente e deixe explodir na melhor maratona de assassinatos movida a sexo com raiva!"
        }
      ]
    },
    {
      "optionText": "O que é 'O Caminho do Pau'?",
      "dontDisplayIfHasObjective": "Turn the Mega Speaker on.",
      "dontDisplayIfObjectiveComplete": "Turn the Mega Speaker on.",
      "dontShowIfProgressionEventPlayed": "refused_joinning_gay_bos",
      "icon": "GUI/quest mark",
      "responseText": "É a VERDADE. Uma filosofia de alta testosterona e ultra-dominante forjada nos fogos das academias pré-guerra! É sobre IRMANDADE. É sobre DOMINÂNCIA. É sobre agarrar a vida—e seus inimigos—pelos culhões e nunca mais soltar. E agora, você vai se juntar à minha tribo!",
      "followUpOptions": [
        {
          "optionText": "Foda-se, estou dentro. Vamos espalhar a palavra do Pau!",
          "dontShowIfProgressionEventPlayed": "refused_joinning_gay_bos",
          "progressionEventPlayed": "agreed_joinning_gay_bos",
          "showChoiceStats": "agreed_joinning_gay_bos",
          "addPerk": "twink_massacre",
          "responseText": "Eu sabia, porra! Bem-vindo a bordo, seu bastardo lindo e assassino. Vamos fazer Maxson engasgar de inveja—e talvez com outra coisa mais tarde. Agora, que tal me ajudar a espalhar a palavra com nosso Mega Alto-Falante, também conhecido como o grito de guerra mais alto e violentamente erótico que a wasteland já ouviu?",
          "followUpOptions": [
            {
              "optionText": "Onde você conseguiu essa coisa?",
              "responseText": "Oh, este garotão não estava simplesmente por aí. Nós o CONSTRUÍMOS—peça por peça gloriosa—como um filho suado e movido a testosterona da engenharia e pura, desenfreada excitação. Meses de sangue, suor e… claro, porra!"
            },
            {
              "optionText": "Certo, eu ajudo.",
              "icon": "GUI/quest mark",
              "addObjective": "Turn the Mega Speaker on.",
              "dontDisplayIfHasObjective": "Turn the Mega Speaker on.",
              "dontDisplayIfObjectiveComplete": "Turn the Mega Speaker on.",
              "exitLine": true,
              "responseText": "Isso aí, PORRA! Eu sabia que você tinha testosterona para aguentar isso. Aquele alto-falante grande e suculento estava implorando por alguém com culhões para ligá-lo, e agora, você vai fazer isso. Hora de engravidar a wasteland com batidas doentias!"
            },
            {
              "optionText": "E se matar todo mundo por perto?",
              "responseText": "Então morreremos como lendas. Imagine as lápides: 'Morte por orgasmo induzido pelo baixo.' Nossos ancestrais ficariam orgulhosos!"
            },
            {
              "optionText": "Não vou tocar nessa coisa.",
              "responseText": "Qual é o problema, com medo de um pouco de *energia homo*? Não se preocupe, ainda há tempo para criar culhões."
            }
          ]
        },
        {
          "optionText": "Eu não sou um viado de merda, guarde sua cruzada do pau para você.",
          "exitLine": true,
          "progressionEventPlayed": "refused_joinning_gay_bos",
          "dontShowIfProgressionEventPlayed": "agreed_joinning_gay_bos",
          "showChoiceStats": "refused_joinning_gay_bos",
          "responseText": "Oof, a negação bate mais forte que uma gangbang de super mutantes. Como quiser—mas você vai sonhar comigo esta noite."
        }
      ]
    },
    {
      "optionText": "Qual é a sua?",
      "responseText": "A MINHA? Ah, a minha é espalhar *O Caminho do Pau*! Estou aqui para transformar esta wasteland em uma cúpula do trovão homoerótica—um paraíso oleado de carne masculina, dominância da Irmandade e batidas tão fortes que arrancarão a pele dos culhões de um deathclaw. E VOCÊ acabou de provar que tem culhões para aguentar!",
      "followUpOptions": [
        {
          "optionText": "O que a Irmandade pensa da sua 'filosofia'?",
          "responseText": "Eles AMAM pra caralho! Bem, exceto o Elder Maxson. Aquele puritano engomadinho me baniu depois que usei o PA de sua preciosa Prydwen para transmitir meu remix de 'Pau de Aço'. Algo sobre 'minar a disciplina'. Pfft. Disciplina meu cu—embora eu não me importasse se Maxson tentasse. Os verdadeiros guerreiros? Eles sabem que sou o que a wasteland precisa: grande energia homo com uma pitada de BOOM."
        },
        {
          "optionText": "Você é completamente louco.",
          "responseText": "Oh, não finja que não está excitado. Eu vi aquela contração suspeita nas suas calças. Você quer me odiar, mas no fundo, sabe que estou certo. A dominância homo é o FUTURO, querido, e ou você está neste trem de carne de aço ou será atropelado por ele!"
        },
        {
          "optionText": "Você é nojento pra caralho.",
          "exitLine": true,
          "responseText": "Oh, olha quem fala! Aí todo suado. Não me odeie porque tenho um cu tão apertado. Odeie a si mesmo por ser fraco demais para admitir que quer um pedaço!"
        }
      ]
    },
    {
      "optionText": "[Matar o Renegado para o Barão Voss]",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Eliminate the outcast.",
      "markObjectiveComplete": "Eliminate the outcast.",
      "addObjective": "Report back to Baron.",
      "progressionEventPlayed": "gay_bos_killed",
      "killCharacter": true,
      "showChoiceStats": "gay_bos_killed",
      "specialEffects": ["stab"],
      "responseText": "Uau, que safado. Não pensei que você—Espere, espere, ESPERE! Se quer me esfaquear, mire baixo, papai!",
      "exitLine": true
    },
    {
      "optionText": "Tchau.",
      "responseText": "Escuta, papai, não estou dizendo que quero que você me enforque na batalha de novo, mas se estiver a fim, estarei aqui, com a armadura potente oleada e pronta para a briga.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Oh. Oh, DOCE PAU DO ÁTOMO. Você acabou de—ohhh, acho que gozei. Oh. Com certeza. Você bate mais forte que uma orgia da Irmandade a todo vapor. PUTA QUE PARIU, olha o que você fez comigo! Já pensou em se juntar ao 'O Caminho do Pau', garoto?"
  ],
  "showShadowFigures": "BoS"
}
