{
  "options": [
    {
      "optionText": "Obrigado pela ‘soneca’ de ontem. O olho roxo ainda está pulsando... diferente da Gina.",
      "reqProgressionEvent": "buster_punch",
      "responseText": "OH, SEU FILHO DA PUTA! VOCÊ VEM AQUI COM SUA CARA ARREBENTADA E CULHÕES MAIORES? VOCÊ TEM SORTE DE EU NÃO TER ARRANCADO SUA ALMA COM UM TAPA!",
      "followUpOptions": [
        {
          "optionText": "Ei, não precisa se estressar, Buster. Ouvi dizer que a Gina gosta dos homens dela… calmos.",
          "responseText": "*Veias saltando* CALMO?! EU ESTOU ZEN PRA CARALHO! ESTOU TÃO CALMO QUE PODERIA MEDITAR ENQUANTO TE ENFORCO COM UMA MÃO! CONTINUE FALANDO, E VOCÊ NÃO VAI CONSEGUIR GRITAR ‘ZEN’ QUANDO EU QUEBRAR SEU MAXILAR COMO UM GALHO!",
          "followUpOptions": [
            {
              "optionText": "Você medita? Pensei que você só ficava sentado aí enquanto eu dava as ‘aulas’ para a Gina.",
              "playSound": "punch",
              "specialEffects": ["Blackout", "Blur"],
              "advanceDayWithStatusMessage": "Você acorda no seu quarto—de novo—com o maxilar doendo como se um super mutante o tivesse usado para praticar tiro ao alvo."
            }
          ]
        },
        {
          "optionText": "A propósito, a Gina me disse que você bate como uma vadia. Palavras dela, não minhas.",
          "responseText": "OH, VOCÊ QUER IR POR AÍ, HEIN?! QUE TAL EU TE MOSTRAR O QUE ACONTECE QUANDO EU REALMENTE PERCO A CABEÇA? SPOILER: TERMINA COMIGO TE PARTINDO AO MEIO, E A GINA RINDO ENQUANTO EU ARRASTO SEU CORPO PARA FORA DO REFÚGIO!",
          "followUpOptions": [
            {
              "optionText": "Oh, você acha que a Gina estava rindo de você? Não, aquilo era só êxtase pós-orgasmo.",
              "playSound": "punch",
              "specialEffects": ["Blackout", "Blur"],
              "advanceDayWithStatusMessage": "Você acorda no seu quarto—de novo—com a cabeça girando e o maxilar deslocado. Buster não lida bem com desrespeito."
            }
          ]
        },
        {
          "optionText": "Só queria te agradecer, Buster. Toda vez que me olho no espelho, lembro de como seu tapa foi fraco.",
          "responseText": "FRACO?! EU TE MANDEI VOANDO PELA SALA! VOCÊ SE ACHA ENGRAÇADO, HEIN? TALVEZ EU DEVESSE REARRANJAR O OUTRO LADO DA SUA CARA PARA COMBINAR. JURO, MAIS UMA PALAVRA E VOCÊ VAI BEBER DE CANUDINHO!",
          "followUpOptions": [
            {
              "optionText": "Voar pela sala? Por favor, Buster. A Gina bateu mais forte quando estava por cima.",
              "playSound": "punch",
              "specialEffects": ["Blackout", "Blur"],
              "advanceDayWithStatusMessage": "Você acorda com os dois olhos inchados e fechados. A boa notícia? Você provavelmente verá estrelas por um tempo. A má notícia? Buster ainda está puto."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Uh, Buster... você parece um pouco *exposto* aí, camarada.",
      "responseText": "Ah, sim, cara... isso é só parte do fluxo natural das coisas, sabe? O universo é sobre deixar as coisas *soltas*. Você tem que deixar respirar.",
      "followUpOptions": [
        {
          "optionText": "Que tal um boquete rápido entre manos para aliviar o estresse?",
          "emotion": "Characters/Buster/emotions/buster shock",
          "responseText": "O QUÊ?! Mano! De jeito nenhum! Que porra é essa?! Você acha que eu curto essa merda gay?! Cara, eu não sou um desses malucos do refúgio! Eu mantenho a minha parada hétero—tipo, reto como uma *flecha*! Só de você pensar nisso me dá vontade de te *flexionar* para fora do refúgio!",
          "followUpOptions": [
            {
              "optionText": "Ei, cara, só estou oferecendo... pensei que talvez você estivesse reprimido.",
              "emotion": "none",
              "responseText": "*Reprimido*? Sim, estou reprimido, mas não vou deixar um cara cuidar do meu negócio! Eu sou todo da Gina, mano! Eu não sou assim! Ajeita sua cabeça, ou eu vou ter que ajeitá-la *para você*!"
            },
            {
              "optionText": "Qual é, é só uma coisa de mano para mano, certo?",
              "emotion": "none",
              "exitLine": true,
              "responseText": "*DE MANO PARA MANO*?! Em que tipo de refúgio doentio você está vivendo?! Não é assim que funciona, cara! Não aqui! Eu sou um maldito *segurança*, e estou protegendo a Gina de pervertidos... e agora tenho que me proteger de você?! Você precisa de um banho frio, mano!"
            }
          ]
        }
      ]
    },
    {
      "optionText": "O que você acha da Gina *se exibindo* desse jeito?",
      "emotion": "none",
      "responseText": "Mano, é como se... ela estivesse me testando, sabe? É o jeito dela de dizer, ‘Buster, confio em você para manter os pervertidos na linha.’ Mas, uh, entre nós... é difícil, cara. Bem difícil... em mais de um sentido, se é que me entende. Mas eu sou todo sobre *contenção*... tenho que ficar *zen*, mesmo quando os peitos dela estão... bem ali.",
      "followUpOptions": [
        {
          "optionText": "Esses são uns peitos bonitos, né?",
          "responseText": "Cara, não me faça pensar nisso... aqueles perfeitos, redondos... *foco, Buster, foco!* É tudo sobre *proteger* ela, cara. Aqueles peitos? Fora dos limites. Para *todos*. Até para mim. Eu sou tipo... o escudo dela, mano. Mas caramba, eles são... algo."
        },
        {
          "optionText": "Ela tem uma buceta perfeita, né?",
          "responseText": "Ah, cara... você está me provocando, mano. Mas eu sou um *guerreiro*, ok? Eu consigo lidar com a visão daquela... buceta de deusa *imaculada* sem perder a cabeça. É pura... intocada. E sou eu quem a mantém assim. Qualquer tarado do refúgio que tentar algo? Vou flexioná-los para fora da existência."
        },
        {
          "optionText": "E se eu te dissesse que vou fodê-la agora mesmo?",
          "responseText": "VOCÊ O QUÊ?! Por cima do meu *cadáver*, mano! Você acha que eu fiquei aqui sentado, flexionando pra caralho, mantendo-a segura só para um tarado do refúgio como você chegar? De jeito nenhum! Vou te quebrar ao meio antes mesmo de você chegar perto! A Gina é uma deusa, cara, e você não é digno nem de olhar na direção dela, muito menos de *fodê-la*!",
          "followUpOptions": [
            {
              "optionText": "Uou, calma. Eu só estava *brincando*... na maior parte.",
              "responseText": "BRINCANDO?! Mano, é melhor você medir suas palavras antes que eu flexione sua alma para fora do seu corpo! A Gina está sob *minha* proteção, e qualquer um que sequer *pensar* em tocá-la vai ter que lidar com esses músculos. *Ele aponta para os bíceps, tremendo de raiva* É melhor você recuar antes que eu te mostre o quão *sério* eu sou!"
            },
            {
              "optionText": "Ah, qual é, Buster. Você realmente acha que vai me parar?",
              "responseText": "TE PARAR? MANO, EU VOU TE ANIQUILAR! Você não tem ideia do que esses músculos podem fazer! Vou flexionar tão forte que toda a sua *existência* vai se dobrar! Você acha que a Gina sequer olharia para você depois que eu terminasse com você? Você tem sorte de eu ser todo zen, ou eu já teria te dado um mata-leão!"
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Certo, mano... mas lembre-se: se vir alguém sequer *pensando* na Gina, me avise. Vou arrancar a cabeça deles com uma flexão.",
      "exitLine": true
    }
  ]
}
