{
  "options": [
    {
      "optionText": "Quem diabos é você?",
      "icon": "GUI/quest mark",
      "responseText": "Eu sou a Candy. Sim, esse é meu nome de verdade. E não, você não pode rir agora. Temos problemas maiores—como o enxame de insetos que quer fazer das suas bolas o lanche da meia-noite deles.",
      "followUpOptions": [
        {
          "optionText": "Do que diabos você está falando?",
          "icon": "GUI/quest mark",
          "responseText": "Chupa-Sacos, gênio. Pequenas merdas voadoras que se agarram em você e drenam suas joias da família como um Capri Sun. Agora pare de ficar aí de boca aberta e me ajude antes que nós dois viremos uvas passas enrugadas.",
          "followUpOptions": [
            {
              "optionText": "Chupa-Sacos? Você está falando sério?",
              "responseText": "Parece que estou brincando, novato? Já vi três caras acordarem com os sacos murchos, e digamos que eles não estão com pressa de mostrar o rosto de novo."
            },
            {
              "optionText": "Como eles são?",
              "responseText": "Grandes e feios pra caralho, com asas. Parecem um cruzamento de uma vespa com a pior ressaca de Satanás. Ouviu aquele som agudo 'zzzzreep'? Esse é o seu aviso para dar o fora."
            },
            {
              "optionText": "Não podemos simplesmente nos esconder?",
              "responseText": "Claro, tente se esconder. Me diga como é acordar com o saco parecendo uma uva passa seca. Eu espero... na verdade, não, não vou esperar. Vá em frente, se esconda, e me diga como isso funciona para você."
            },
            {
              "optionText": "E como exatamente eu os mato?",
              "responseText": "Matá-los? Querido, se eu soubesse disso, não estaria aqui perdendo meu tempo com você. Tente esmagá-los, eletrocutá-los, inferno, grite com eles se isso te fizer sentir melhor. Mas você vai ter que descobrir isso sozinho."
            },
            {
              "optionText": "Certo, eu ajudo.",
              "exitLine": true,
              "fadeOutCharacter": true,
              "icon": "GUI/quest mark",
              "addObjective": "Kill 5 Nutsuckers",
              "responseText": "Ok, o plano é o seguinte: não morra, não seja chupado, e encontre algo—*qualquer coisa*—que possa esmagar ou fritar esses pequenos pervertidos."
            }
          ]
        },
        {
          "optionText": "Por que eu deveria me importar?",
          "responseText": "Ah, não sei. Talvez porque você goste de andar por aí com um par de bolas entre as pernas? Ou você está planejando entrar em alguma fase de monge e isso simplesmente não importa mais para você?",
          "followUpOptions": [
            {
              "optionText": "Espera, como sei que você não está me zoando?",
              "responseText": "Pfft. Eu pareço ter tempo para piadas? Você acha que eu corri até aqui só para zoar o novato? Se você ouvir um zumbido, não vou ficar por perto para dizer ‘eu te avisei’."
            }
          ]
        }
      ]
    }
  ],
  "auto_line": [
    "Bom dia, Cinderela! Espero que tenha dormido bem, porque temos um problema do caralho. A menos que você goste da ideia de insetos sugando a vida das suas bolas enquanto você dorme, é melhor levantar essa bunda!"
  ]
}
