{
    "options": [ 
        {
            "optionText": "I didn’t mean to walk in while you were... like this.",
            "responseText": "Oh please, don’t act like you’re complaining. You’re the one who gave me these panties, remember? Looks like you got exactly what you wanted.",
            "followUpOptions": [ 
                {
                    "optionText": "Not gonna lie, you look amazing in them.",
                    "responseText": "Well, that’s the reaction I was hoping for. Maybe you’ve got better taste than I thought."
                },
                {
                    "optionText": "Those panties look even better on you than I imagined.",
                    "responseText": "Oh, you imagined me in them, huh? Now you’re making me curious about what else you’ve imagined. Go on, don’t be shy.",
                    "followUpOptions": [ 
                        {
                            "optionText": "I imagined a lot more than just seeing you in them...",
                            "responseText": "Oh really? Care to share those fantasies?",
                            "followUpOptions": [  
                                {
                                    "optionText": "In my fantasy, those panties come off with my teeth.",
                                    "responseText": "Teeth? Oh, now we’re getting creative. But let’s be real—you’d probably be drooling so much you’d choke before you even got to the waistband. ♥︎"
                                }, 
                                {
                                    "optionText": "Let’s just say I’d be using my tongue for more than just talking.",
                                    "responseText": "Oh, you’d love that, wouldn’t you? Too bad you’d probably cum the second your tongue got near my pussy. I need more than just enthusiasm, sweetie."
                                }, 
                                {
                                    "optionText": "I imagined you sitting on my face.",
                                    "responseText": "Now we’re getting somewhere. But be careful what you wish for—because once I’m up there, you might just cum before you can even breathe.",
                                    "followUpOptions": [
                                        {
                                            "optionText": "Cumming is the plan. You like it messy, right?",
                                            "responseText": "Oh, you dirty little thing. I don’t mind a little mess, but you better hope you’ve got some stamina left afterward. ♥︎"
                                        }
                                    ]
                                },
                                {
                                    "optionText": "I imagined your pussy dripping on me while I cum.",
                                    "responseText": "Oh, so you like it wet, huh? I doubt you'd last long once I got started. But nice fantasy. ♥︎",
                                    "followUpOptions": [
                                        {
                                            "optionText": "Trust me, I can handle anything you give me.",
                                            "responseText": "Oh, confident now, are we? I like that. But I’m not convinced yet—talk is cheap."
                                        },
                                        {
                                            "optionText": "We both know I’d cum the second you touched me.",
                                            "responseText": "*laughs* Oh, no question about it. But that’s the fun part, isn’t it? Watching you lose control the moment I get close. Don’t worry, I won’t hold it against you... much."
                                        }
                                    ]
                                }
                                
                            ]
                        },
                        {
                            "optionText": "Okay, I didn’t just imagine—I've been dreaming about this.",
                            "responseText": "Dreaming, huh? Well, dreams are nice, but reality’s a lot more fun."
                        }
                    ]
                }
            ]
        } 
    ]
}
