{
  "options": [
    {
      "optionText": "Eu não queria entrar enquanto você estava... assim.",
      "responseText": "Ah, por favor, não finja que está reclamando. Foi você quem me deu esta calcinha, lembra? Parece que você conseguiu exatamente o que queria.",
      "followUpOptions": [
        {
          "optionText": "Não vou mentir, você está incrível nela.",
          "responseText": "Bem, essa era a reação que eu esperava. Talvez você tenha um gosto melhor do que eu pensava."
        },
        {
          "optionText": "Essa calcinha fica ainda melhor em você do que eu imaginei.",
          "responseText": "Oh, você me imaginou nela, hein? Agora estou curiosa sobre o que mais você imaginou. Continue, não seja tímido.",
          "followUpOptions": [
            {
              "optionText": "Eu imaginei muito mais do que apenas te ver nela...",
              "responseText": "Oh, é mesmo? Quer compartilhar essas fantasias?",
              "followUpOptions": [
                {
                  "optionText": "Na minha fantasia, essa calcinha sai com meus dentes.",
                  "responseText": "Dentes? Oh, agora estamos sendo criativos. Mas sejamos realistas—você provavelmente estaria babando tanto que engasgaria antes mesmo de chegar na cintura. ♥︎"
                },
                {
                  "optionText": "Digamos que eu usaria minha língua para mais do que apenas falar.",
                  "responseText": "Oh, você adoraria isso, não é? Pena que provavelmente gozaria no segundo em que sua língua chegasse perto da minha buceta. Preciso de mais do que apenas entusiasmo, docinho."
                },
                {
                  "optionText": "Eu imaginei você sentando na minha cara.",
                  "responseText": "Agora estamos chegando a algum lugar. Mas cuidado com o que deseja—porque uma vez que eu estiver lá em cima, você pode gozar antes mesmo de conseguir respirar.",
                  "followUpOptions": [
                    {
                      "optionText": "Gozar é o plano. Você gosta de bagunça, certo?",
                      "responseText": "Oh, seu safadinho. Não me importo com um pouco de bagunça, mas é melhor você ter alguma estamina de sobra depois. ♥︎"
                    }
                  ]
                },
                {
                  "optionText": "Eu imaginei sua buceta pingando em mim enquanto eu gozo.",
                  "responseText": "Oh, então você gosta molhado, hein? Duvido que você durasse muito depois que eu começasse. Mas boa fantasia. ♥︎",
                  "followUpOptions": [
                    {
                      "optionText": "Confie em mim, eu aguento qualquer coisa que você me der.",
                      "responseText": "Oh, confiante agora, estamos? Eu gosto disso. Mas ainda não estou convencida—conversa é barata."
                    },
                    {
                      "optionText": "Nós dois sabemos que eu gozaria no segundo em que você me tocasse.",
                      "responseText": "*risos* Ah, sem dúvida. Mas essa é a parte divertida, não é? Ver você perder o controle no momento em que eu chego perto. Não se preocupe, não vou te culpar por isso... muito."
                    }
                  ]
                }
              ]
            },
            {
              "optionText": "Ok, eu não apenas imaginei—tenho sonhado com isso.",
              "responseText": "Sonhando, hein? Bem, sonhos são bons, mas a realidade é muito mais divertida."
            }
          ]
        }
      ]
    }
  ]
}
