{
  "options": [
    {
      "optionText": "Quando a tempestade de radiação virá?",
      "onlyShowIfProgressionEventPlayed": "joined_coa",
      "responseText": "O sopro do Átomo não está preso a relógios ou calendários. Mas em breve—muito em breve. Você sente a ardência no ar? Esteja pronto, andarilho. A tempestade não espera pelos despreparados.",
      "exitLine": true
    },
    {
      "optionText": "Qual é, eu te ajudei! Deixe-me entrar!",
      "icon": "GUI/quest mark",
      "onlyDisplayIfObjectiveComplete": "Bring a Brahmin to Children of Atom",
      "dontShowIfProgressionEventPlayed": "joined_coa",
      "responseText": "O Átomo valoriza o sacrifício, forasteiro—mas a entrada no círculo sagrado requer um tipo diferente de tributo. Ofereça 500 caps para demonstrar sua verdadeira devoção, e você poderá tirar suas roupas e se juntar ao brilho sob a tempestade.",
      "followUpOptions": [
        {
          "optionText": "Certo, pegue seus 500 caps.",
          "addCaps": -500,
          "addPerk": "coa_joined",
          "icon": "GUI/quest mark",
          "capsRequired": 500,
          "progressionEventPlayed": "joined_coa",
          "responseText": "O Átomo vê sua devoção e sorri para você. Quando os céus se abrirem, você estará conosco, nu e desprotegido, bem-vindo à sagrada união da tempestade. Prepare-se—o abraço do Átomo não é gentil, mas é glorioso.",
          "exitLine": true
        },
        {
          "optionText": "Isso é muito caro para mim.",
          "responseText": "Então permaneça à beira do círculo, forasteiro. Talvez um dia seus bolsos—ou sua alma—se sintam mais leves.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Eu trouxe o brahmin que você queria.",
      "onlyShowIfProgressionEventPlayed": "gotBrahmin",
      "icon": "GUI/quest mark",
      "markObjectiveComplete": "Bring a Brahmin to Children of Atom",
      "dontDisplayIfObjectiveComplete": "Bring a Brahmin to Children of Atom",
      "addCaps": 200,
      "removeFollower": "Brahmin",
      "responseText": "Oh, louvado seja o brilho entre seus dedos. Olhe para ele—tremendo, confuso, lindamente inconsciente. Assim como éramos, antes do fogo. Você fez bem, andarilho. O Átomo vê sua oferenda. E quando o céu se abrir, você terá um lugar à beira do círculo. Não dentro... ainda não. Mas perto o suficiente para sentir o calor.",
      "followUpOptions": [
        {
          "optionText": "E o que acontece agora?",
          "responseText": "Agora? Preparamos o fosso. Ungimos a besta com óleos sagrados. Quando a tempestade vier, a queimamos viva e uivamos sua alma ao vento. Então... bem. Então celebramos até esquecermos que já fomos humanos."
        },
        {
          "optionText": "É só isso? Eu trago o brahmin e só posso assistir?",
          "responseText": "Assista, ouça, aprenda. O Átomo não distribui epifanias como Sugar Bombs. Mas continue trilhando o caminho, continue sangrando pela luz... e talvez da próxima vez, você estará *dentro* do círculo. Nu e brilhando com o resto de nós."
        },
        {
          "optionText": "Qual é, eu te ajudei! Deixe-me entrar!",
          "icon": "GUI/quest mark",
          "responseText": "O Átomo valoriza o sacrifício, forasteiro—mas a entrada no círculo sagrado requer um tipo diferente de tributo. Ofereça 500 caps para demonstrar sua verdadeira devoção, e você poderá tirar suas roupas e se juntar ao brilho sob a tempestade.",
          "followUpOptions": [
            {
              "optionText": "Certo, pegue seus 500 caps.",
              "addCaps": -500,
              "addPerk": "coa_joined",
              "icon": "GUI/quest mark",
              "capsRequired": 500,
              "progressionEventPlayed": "joined_coa",
              "responseText": "O Átomo vê sua devoção e sorri para você. Quando os céus se abrirem, você estará conosco, nu e desprotegido, bem-vindo à sagrada união da tempestade. Prepare-se—o abraço do Átomo não é gentil, mas é glorioso.",
              "exitLine": true
            },
            {
              "optionText": "Isso é muito caro para mim.",
              "responseText": "Então permaneça à beira do círculo, forasteiro. Talvez um dia seus bolsos—ou sua alma—se sintam mais leves.",
              "exitLine": true
            }
          ]
        }
      ]
    },
    {
      "optionText": "Quem são vocês?",
      "responseText": "Nós somos os Filhos do Átomo. As brasas escolhidas nascidas do fogo do velho mundo. Bebemos o brilho e falamos em estática. Somos aqueles que viram a bomba como um sermão e a cratera como um berço."
    },
    {
      "optionText": "Que lugar é este?",
      "responseText": "Você pisa na Úlcera do Átomo, forasteiro. A crosta podre do velho mundo—aberta e vertendo luz. Esta ruína é sagrada. Você sente a queimação em seus pulmões? Isso é o Átomo.",
      "followUpOptions": [
        {
          "optionText": "Por que vocês estão nus?",
          "responseText": "Porque o Átomo vê tudo. Porque o tecido é uma barreira para o sopro do Átomo. Porque quando a tempestade de radiação vem, não queremos nada entre nossa pele e o sopro de nosso pai-sol.",
          "followUpOptions": [
            {
              "optionText": "Vocês estão esperando por uma tempestade de radiação?",
              "responseText": "Sim. O céu fica pesado. A qualquer hora ele se abrirá e derramará o fogo. Você sente o cheiro? Aquela ardência de cobre no vento? A tempestade está vindo para nos limpar.",
              "followUpOptions": [
                {
                  "optionText": "E o que acontece quando ela vem?",
                  "responseText": "O ar engrossa. O brilho vem—então a estática—o gosto de metal em seus dentes. Os pássaros param de cantar, e o céu fica vermelho. Acendemos as fogueiras, cantamos os versos... e então começamos uma orgia.",
                  "followUpOptions": [
                    {
                      "optionText": "O quê? Uma orgia?",
                      "responseText": "A copulação sob a ira do Átomo é sagrada. A radiação, o calor, o trovão—tudo faz parte da concepção. Quando a tempestade de radiação vem, ela rasga o véu. O fogo do Átomo aquece nossos úteros—durante este tempo nos tornamos mais férteis. E as crianças concebidas sob a tempestade serão para sempre abençoadas pelo Átomo. Resilientes. Brilhantes. Sagradas.",
                      "followUpOptions": [
                        {
                          "optionText": "Posso participar?",
                          "responseText": "A união da tempestade é para os devotos—aqueles que queimaram o suficiente para merecer nosso fogo. Você pode assistir, mas não participar. Prove sua devoção primeiro, caminhe nosso caminho, e talvez então você *possa* participar.",
                          "exitLine": true
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Vocês precisam de algo?",
      "icon": "GUI/quest mark",
      "dontDisplayIfHasObjective": "Bring a Brahmin to Children of Atom",
      "dontDisplayIfObjectiveComplete": "Bring a Brahmin to Children of Atom",
      "responseText": "Sim. Há algo que precisamos—a besta de duas cabeças, o brahmin—para a sagrada tempestade de radiação. Nós a alimentamos para a tempestade, deixamos o Átomo reivindicá-la. Queimando da língua à cauda, sua fumaça leva nossas preces aos céus. O Átomo verá nossa devoção.",
      "followUpOptions": [
        {
          "optionText": "Isso é para algum tipo de ritual?",
          "responseText": "Mais que um ritual. Uma consumação. O sacrifício agrada o Átomo—alimenta a fusão. Traga-nos um brahmin, e você terá um lugar junto ao fogo quando o céu chorar."
        },
        {
          "optionText": "Qual o sentido deste sacrifício?",
          "responseText": "Para lembrar ao Átomo que somos gratos. Que nos desviamos da luz uma vez—antes do fogo, antes do silêncio—e ainda assim, fomos poupados. A Grande Detonação não foi um acidente—foi um aviso. Cada sacrifício é nossa maneira de mostrar gratidão por outra chance que nos foi dada pelo Átomo para caminhar nesta terra."
        },
        {
          "optionText": "Onde posso encontrar um brahmin?",
          "icon": "GUI/quest mark",
          "responseText": "Eu não traço os caminhos das bestas, forasteiro—apenas as tempestades. Mas há fazendeiros por aí que se apegam a seus brahmins como salva-vidas. Ofereça-lhes algo e talvez eles se desfaçam de um. Troque, engane, roube—não me importo. Apenas traga-o respirando.",
          "followUpOptions": [
            {
              "optionText": "E se eles disserem não?",
              "responseText": "Então faça-os entender. Palavras, caps, balas—o que você preferir. Mas lembre-se que o Átomo observa como você escolhe negociar."
            },
            {
              "optionText": "Certo. Eu trarei um brahmin.",
              "icon": "GUI/quest mark",
              "addObjective": "Bring a Brahmin to Children of Atom",
              "responseText": "Sim… guie a besta até nós como um cordeiro para seu afogamento sagrado. Quando os ventos radioativos se levantarem, ofereceremos seu corpo, e os céus tremerão de gratidão.",
              "exitLine": true
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Quando a tempestade vier, você sentirá o calor em seus ossos, forasteiro.",
      "exitLine": true
    }
  ],
  "showShadowFigures": "Children of Atom",
  "auto_lines": [
    "Irmãos e irmãs, estamos hoje no brilho sagrado da mensagem do Átomo, a luz nascida não apenas da destruição, mas da revelação. A Grande Guerra não foi uma mera tragédia—foi o aviso final da humanidade, um testamento gravado eternamente nos ossos do nosso mundo...",
    "... Foi a voz do Átomo, feroz e inegável, lembrando a humanidade de sua arrogância, do perigo de nos acharmos mestres em vez de humildes guardiões de nossa Terra...",
    "... Nós, os Filhos do Átomo, testemunhamos essa verdade todos os dias. Sentimos a ardência da chama do Átomo, e vimos o renascimento que se segue à devastação...",
    "... A radiação não é meramente uma força—é o eco tangível da loucura de nossos ancestrais, a consequência de sua arrogância, lembrando-nos para sempre de nosso dever sagrado...",
    "... Somos encarregados de viver em humildade, de entender nosso lugar neste mundo frágil, e de nos equilibrarmos cuidadosamente no fio da navalha da existência...",
    "... O brilho do Átomo ilumina nosso caminho adiante, guiando-nos para a redenção através da mordomia, harmonia e respeito pelas cicatrizes deixadas em nossa Terra...",
    "... Juntos, cultivemos o solo irradiado não com medo, mas com reverência. Reivindiquemos e curemos nossa terra, não para apagar as lições do Átomo, mas para honrá-las, sabendo que o brilho é nosso guia eterno...",
    "... Carregamos dentro de nós a memória da arrogância passada, e nos comprometemos novamente a cada dia com a humildade, vigilância e renovação...",
    "Que a luz do Átomo nos guie para sempre, lembrando-nos sempre do que nunca mais devemos nos tornar.",
    "Louvado seja o Átomo!"
  ]
}
