{
    "options": [
        {
            "optionText": "Damn, radiation kink unlocked. You freaks really don't hold back.",
            "progressionEventPlayed": "radstormOrgy",
            "responseText": "Kink? No, this is revelation. When the glow burns brightest, we fuck like animals beneath his gaze, glowing and soaked, our holes spread wide for his judgment. This storm makes us wet, wanderer, and we embrace the burn with open legs and cocks in every crevice."
        }, 
        {
            "optionText": "Can radiation really make you fertile?",
            "progressionEventPlayed": "radstormOrgy",
            "responseText": "Atom's power is mysterious and divine. When Atom pumps us full during the storm, something holy takes root. Those conceived under his glow inherit his resilience, his strength. Doubt if you must, but the proof walks among us."
        }, 
        {
            "optionText": "Alright, I'll just... uh... be behind that rock, absolutely not jerking off. Don't mind me.",
            "progressionEventPlayed": "radstormOrgy",
            "responseText": "Enjoy yourself, outsider. Atom sees all—and tonight, he sees every dripping hole, every glowing cock buried deep our sisters' pussies. Our glow isn't easy to forget. When you dream tonight, you'll wake up hard, cum-stained, and still tasting static.",
            "exitLine": true
        } 
    ],
    "auto_lines": [ "Fuck yes, stretch me like the glowing crater—break my pussy open!",
        "Mmm, feel how wet the radstorm makes me. Shove that glowing dick deeper!", 
        "Yes! Split me open like the atom, make me scream louder than the thunder!", 
        "Ah, fuck—yes! Breed me under Atom's burning gaze!", 
        "Feel that radiation soaking into my skin—fuck, I'm melting on your cock!", 
        "Mmm, your dick feels hotter than atomic fire—fuck me raw!", 
        "Yes, yes—deeper! Fill my pussy with Atom's holy seed!",  
        "Ahhh! Atom, yes! Fuck me harder—burn your glow inside my pussy!", 
        "Mmm, that's it—fuck my dick harder than the Great Detonation!", 
        "Atom, I'm gonna cum! Fuck me full of your glowing blessing!", 
        "Ahh, your cock is like pure radiation—burn me from inside!", 
        "Mmm, yes, fuck my mouth—I’ll swallow your glowing cum!", 
        "Yes, breed me, fill me—make me glow with your cum!", 
        "Ah, fuck—hold me down and fuck me in Atom's radioactive rain!", 
        "Mmm, take my pussy—it's soaked from the storm and begging for you!",  
        "Yes, yes, shove that thick cock inside—let Atom hear me scream!", 
        "Oh fuck, I’m cumming—Atom, fill me with your holy fire!", 
        "Mmm—ahhh! Let’s fuck until the storm tears us apart!",
        "Feel the glow in your bones, brothers and sisters! Let Atom’s fire purge your souls!",
        "The storm blesses us—embrace the heat, embrace the fury!",
        "Atom's breath is upon us—let it strip away all that is false and leave only truth!",
        "Together beneath Atom's gaze, we find renewal!"
    ],
    "showShadowFigures": "RadstormOrgy"
} 