{
  "options": [
    {
      "optionText": "Caralho, fetiche por radiação desbloqueado. Vocês, malucos, realmente não se seguram.",
      "progressionEventPlayed": "radstormOrgy",
      "responseText": "Fetiche? Não, isso é revelação. Quando o brilho queima mais forte, fodemos como animais sob o olhar dele, brilhando e encharcados, nossos buracos abertos para seu julgamento. Essa tempestade nos deixa molhadas, andarilho, e nós abraçamos a queimadura com pernas abertas e paus em cada fresta."
    },
    {
      "optionText": "A radiação pode mesmo te deixar fértil?",
      "progressionEventPlayed": "radstormOrgy",
      "responseText": "O poder do Átomo é misterioso e divino. Quando o Átomo nos enche durante a tempestade, algo sagrado se enraíza. Aqueles concebidos sob seu brilho herdam sua resiliência, sua força. Duvide se quiser, mas a prova caminha entre nós."
    },
    {
      "optionText": "Certo, eu vou só... uh... ficar atrás daquela pedra, com certeza não batendo uma. Não se importem comigo.",
      "progressionEventPlayed": "radstormOrgy",
      "responseText": "Divirta-se, forasteiro. O Átomo vê tudo—e esta noite, ele vê cada buraco pingando, cada pau brilhante enterrado fundo nas bucetas de nossas irmãs. Nosso brilho não é fácil de esquecer. Quando você sonhar esta noite, acordará duro, manchado de porra e ainda sentindo o gosto de estática.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Fode sim, me estique como a cratera brilhante—arrombe minha buceta!",
    "Mmm, sinta como a tempestade de radiação me deixa molhada. Enfia esse pau brilhante mais fundo!",
    "Sim! Me parta como o átomo, me faça gritar mais alto que o trovão!",
    "Ah, porra—sim! Me engravide sob o olhar ardente do Átomo!",
    "Sinta essa radiação encharcando minha pele—porra, estou derretendo no seu pau!",
    "Mmm, seu pau parece mais quente que fogo atômico—me foda sem dó!",
    "Sim, sim—mais fundo! Encha minha buceta com a semente sagrada do Átomo!",
    "Ahhh! Átomo, sim! Me foda mais forte—queime seu brilho dentro da minha buceta!",
    "Mmm, isso mesmo—foda meu pau mais forte que a Grande Detonação!",
    "Átomo, eu vou gozar! Me encha com sua bênção brilhante!",
    "Ahh, seu pau é como radiação pura—me queime por dentro!",
    "Mmm, sim, foda minha boca—vou engolir sua porra brilhante!",
    "Sim, me engravide, me encha—me faça brilhar com sua porra!",
    "Ah, porra—me segure e me foda na chuva radioativa do Átomo!",
    "Mmm, pegue minha buceta—está encharcada da tempestade e implorando por você!",
    "Sim, sim, enfie esse pau grosso aqui dentro—deixe o Átomo me ouvir gritar!",
    "Oh porra, estou gozando—Átomo, me encha com seu fogo sagrado!",
    "Mmm—ahhh! Vamos foder até a tempestade nos despedaçar!",
    "Sintam o brilho em seus ossos, irmãos e irmãs! Deixem o fogo do Átomo purificar suas almas!",
    "A tempestade nos abençoa—abracem o calor, abracem a fúria!",
    "O sopro do Átomo está sobre nós—deixe-o remover tudo que é falso e deixar apenas a verdade!",
    "Juntos sob o olhar do Átomo, encontramos a renovação!"
  ],
  "showShadowFigures": "RadstormOrgy"
}
