{
    "options": [ 
    {
        "optionText": "[Watch]",
        "spriteAtTheEndOfHscene": "Characters/Overseer Daughter/od post deathclaw",
        "spriteAtTheEndOfHscenePosition": [ 0.38, -1.64 ],
        "exitLine": true,
        "isHEventStarted": true,
        "showChoiceStats": "deathclaw_love",
        "closeDialogueOptions": true,  
        "icon": "GUI/eye icon",
        "hEventName": "daughter_deathclaw_fuck",
        "progressionEventPlayed": "daughter_railed_by_deathclaw",
        "interactable": "Characters/Overseer Daughter/Interactables/deathclaw rev v3", 
        "lineAfterHevent": "Ahh... it was amazing... ♥︎",
        "auto_lines": [
            "♥︎ Oh, so THIS is how it ends? Three baby Deathclaws and my poor, innocent pussy!",
            "Ahh! Oh, big boy, that’s the spot! Who’s a good scaly bitch? That’s right, you are! ♥︎",
            "Mmm, fuck, they're staring like it's feeding time and my pussy's on the menu. ♥︎",
            "Mmm, goddammit, stop growling and start railing. Mama's pussy didn't walk all the way out here to go home dry. ♥︎", 
            "Oh, you big beautiful freak! My pussy’s gonna be legend among the wasteland stories! ♥︎",
"Mmm, I’m so glad I ignored Boogie when he called this a ‘terrible, life-threatening idea.’",
"If this kills me, bury me with a plaque: ‘Death by Deathclaw gangbang—she died doing what she loved.’ ♥", 
"Ohh, I swear I can feel your dick in my fucking stomach!",
"♥︎ Oh, big guy, you can sniff there all you want. Mmm, enjoy this wet hole!",
"You better be ready with a stimpack, hero—I might need healing after this triple-dick mayhem! ♥", 
"Oh, god, they're rubbing their giant murder-cocks already. I didn’t think Deathclaws knew foreplay!",
"Ahh, fuck! I’m either gonna die screaming or orgasm screaming—guess we'll find out soon!" ,
"Uh-oh, one's looking at me like my ass is a free buffet. And I might just let him take a bite... ♥",
"Come on, boys, line up. Mama's gotta test-drive all your radioactive dicks. ♥",
"Wait till Dad hears how his precious little girl got triple-stuffed by mutant murder lizards—he’ll have a heart attack. Worth it!",
"I can feel my IQ dropping just watching them jerk their monster dicks. Must resist slutty instincts... failing... ♥", 
"Alright, big boys, step right up! I've got one pussy and you've got three terrifying dicks. Let's party. ♥", 
"Fuck, one of them just winked at me! Who taught teenage Deathclaws how to flirt? Actually, never mind, it was probably me.", 
"Oh shit, one of them already blew his Deathclaw load prematurely—amateur! Two to go! ♥",
"Mmm, you boys better destroy my pussy properly. If I’m limping back to the vault, I want a good story!", 
"Great, now I'm the official Vault-Tec slutty princess for hormonal teenage lizards. Mom would be proud. ♥",
  
"Oh fuck—stop teasing and shove your radioactive dick straight into my hole already! ♥︎ If I survive this, I'm naming my firstborn after you! ♥︎",
"Goddammit, I've always wondered how much Deathclaw cum it takes to drown the Deathclaw fucktoy I am—time to find out! ♥︎",
"You horny beasts better fill me up until my belly looks pregnant—Daddy would love lizard grandchildren! ♥︎", 
"Come on, make sure you're getting this on camera! Vault biology class needs accurate footage of pussy destruction! ♥︎",
"Fuck, one claw around my throat, one dick splitting my pussy, another aiming for my ass? Dreams really do come true! ♥︎",
"God, my tits are bouncing so hard they're gonna give me a concussion! ♥︎",
"If this gangbang doesn’t earn me legendary slut status, nothing will! Fuck me harder, boys! ♥︎",
"My pussy’s officially declared war on human dicks—Deathclaw cock only from now on! ♥︎",
"Ahh! Fill me with so much Deathclaw cum I'll glow green and get banned from the vault! ♥︎",
"This might be the last orgasm of my life—but fuck me, what a way to go! ♥︎",
"You boys better break every bone in my slutty body—I want scars to brag about back home! ♥︎",
"Ahh fuck, I can’t walk straight already, and they’re still lining up—Deathclaws, take turns wrecking my worthless pussy! ♥︎", 
 
"Oh sht, is that drool or are they just pre-lubing their Deathclaw dicks for me? Hot. ♥",
"♥︎ Oh sure, just turn my pussy into a Deathclaw playground. Why not? ", 
"Ohhh, I can feel the cum-tastic energy radiating off them. This is what success smells like!",
"Who knew becoming a Deathclaw breeding slut could be so empowering? Take notes, vault sluts! ♥︎",
"Mmm, you’re gonna break me, and I fucking love it, ahh! ♥︎", 
"Mmm, call it science, call it madness, but I call it a damn good time! ♥︎",
"Mmm, ohh, fuck, if my dad knew about this, he’d have a stroke—and I’m about to have one too!",
"Ahh! That growl? Oh, sweet claws, that growl just hit me right in the heart..." ,   
"Ahh, you’re making my pussy cum like a busted water pipe! ♥︎",
"Mmm, my pheromone blend works better than I imagined! Time to bottle this magic and RULE the wasteland!",
"Fuck, you’re making my pussy wetter than the fucking purification plant!" ,
"Ahh! Oh, the vibrations from those roars... ♥︎"  ,
"Ahh! Is it hot in here, or is it just the raw, unfiltered Deathclaw love?",
"Mmm, why does this feel like some weirdly specific fetish holotape Boogie would sell?",
"Mmm, ohh, I’m gonna cum so hard, my pussy’s gonna need a fucking reboot!",
"Mmm, they’re roaring again? Oh, boys, don’t fight! There’s enough me for everyone!",
"Mmm, my plan worked! I am a genius! A mad, horny genius, but a genius nonetheless. ♥︎",
"Ahh, mmm, your dick’s a fucking super stimpack, and I’m fucking addicted!",
"Ohhh, that one’s got a sparkle in his eye. You like what you see, big boy? ♥︎",  
"Fuck, your dick’s making my pussy cum like a broken reactor!",
"Mmm, Daddy always said I was a disappointment. Bet he didn’t think I’d accomplish THIS, huh? ♥︎",
"Ahh, ohh, my pussy’s dripping like a leaky radaway pouch!",
"Mmm, I don’t think I’ve ever seen so much cum in one place. ♥︎", 
"Mmm, your dick’s like a fucking fusion core, and I’m overheating! ♥︎",
"Ahh, ♥︎ if the Overseer could see me now, he’d be so proud!",
"Mmm, you’re gonna make me squirt like a broken water valve!", 
"Ahh! Oh, it's sniffing me again. Go ahead, boy, this small pussy is all yours! ♥︎" , 
"Ahh! Who knew scaly love could be so... therapeutic? ♥︎",
"Mmm, Boogie’s gonna be so jealous..." ,
"Ahh! I should’ve started this experiment YEARS ago. What was I even waiting for? ♥︎"  ,
"Ahh! Oh, you’re looking at me like I’m your queen. ♥︎",
"Mmm, ohh, your dick should be illegal—it’s a fucking weapon of ass destruction!" , 
"Ahh! My pheromone experiment wasn’t just a success—it was a GODDAMN triumph!" ,
"Ahh, fuck me sideways, that potion worked way too well—those dicks look angrier than my dad at curfew. ♥", 
"Is it just me or is Deathclaw puberty packing way more heat than human puberty? Damn! ♥", 
"Ahh, I’m cumming so hard, I’m seeing stars... or maybe that’s just the lack of oxygen!",
"Ahh, keep going... make me cum!",
"Ahh, I’m cumming hard! Ahhhhh! ♥︎" ],
    "endingEffects": ["Flashes"]
    }
    ],
    "auto_lines": ["♥︎ Oh, so THIS is how it ends? Three baby Deathclaws and my poor, innocent pussy!" ,
"♥︎ Yes, YES! Rip this suit! Tear it apart! Mmm, so much raw energy!" ] ,
    "showShadowFigures": "Deathclaws2"
}
