{
  "options": [
    {
      "optionText": "[Assistir]",
      "spriteAtTheEndOfHscene": "Characters/Overseer Daughter/od post deathclaw",
      "spriteAtTheEndOfHscenePosition": [0.38, -1.64],
      "exitLine": true,
      "isHEventStarted": true,
      "showChoiceStats": "deathclaw_love",
      "closeDialogueOptions": true,
      "icon": "GUI/eye icon",
      "hEventName": "daughter_deathclaw_fuck",
      "progressionEventPlayed": "daughter_railed_by_deathclaw",
      "interactable": "Characters/Overseer Daughter/Interactables/deathclaw rev v3",
      "lineAfterHevent": "Ahh... foi incrível... ♥︎",
      "auto_lines": [
        "♥︎ Ah, então é ASSIM que termina? Três bebês Deathclaws e minha pobre e inocente buceta!",
        "Ahh! Oh, garotão, é aí mesmo! Quem é uma boa vadia escamosa? Isso mesmo, você é! ♥︎",
        "Mmm, porra, eles estão encarando como se fosse hora de comer e minha buceta estivesse no cardápio. ♥︎",
        "Mmm, caramba, pare de rosnar e comece a me foder. A buceta da mamãe não andou todo esse caminho até aqui para voltar para casa seca. ♥︎",
        "Oh, seu monstro lindo! Minha buceta vai virar lenda nas histórias da wasteland! ♥︎",
        "Mmm, ainda bem que ignorei o Boogie quando ele disse que isso era uma 'ideia terrível e fatal'.",
        "Se isso me matar, me enterre com uma placa: ‘Morte por gangbang de Deathclaw—ela morreu fazendo o que amava.’ ♥",
        "Ohh, juro que consigo sentir seu pau na porra do meu estômago!",
        "♥︎ Oh, grandão, pode cheirar aí o quanto quiser. Mmm, aproveite este buraco molhado!",
        "É melhor você estar pronto com um stimpack, herói—posso precisar de cura depois dessa putaria de pau triplo! ♥",
        "Oh, deus, eles já estão esfregando seus paus gigantes de assassinato. Eu não sabia que Deathclaws conheciam preliminares!",
        "Ahh, porra! Ou vou morrer gritando ou vou ter um orgasmo gritando—acho que vamos descobrir em breve!",
        "Uh-oh, um está me olhando como se minha bunda fosse um buffet livre. E talvez eu deixe ele dar uma mordida... ♥",
        "Vamos lá, rapazes, façam fila. A mamãe tem que testar todos os seus paus radioativos. ♥",
        "Espere até o papai ouvir como sua filhinha preciosa foi preenchida triplamente por lagartos mutantes assassinos—ele vai ter um ataque cardíaco. Vale a pena!",
        "Sinto meu QI caindo só de vê-los bater suas punhetas monstruosas. Preciso resistir aos instintos de vadia... falhando... ♥",
        "Certo, garotões, aproximem-se! Eu tenho uma buceta e vocês têm três paus aterrorizantes. Vamos festejar. ♥",
        "Porra, um deles acabou de piscar para mim! Quem ensinou Deathclaws adolescentes a flertar? Na verdade, esquece, provavelmente fui eu.",
        "Oh merda, um deles já gozou sua carga de Deathclaw prematuramente—amador! Faltam dois! ♥",
        "Mmm, é melhor vocês destruírem minha buceta direito. Se eu voltar mancando para o refúgio, quero uma boa história!",
        "Ótimo, agora sou a princesa vadia oficial da Vault-Tec para lagartos adolescentes hormonais. Mamãe ficaria orgulhosa. ♥",
        "Oh, porra—pare de provocar e enfie seu pau radioativo direto no meu buraco! ♥︎ Se eu sobreviver a isso, vou dar seu nome ao meu primogênito! ♥︎",
        "Caramba, eu sempre me perguntei quanta porra de Deathclaw é necessária para afogar o brinquedo sexual de Deathclaw que eu sou—hora de descobrir! ♥︎",
        "É melhor vocês, garotos com tesão, me encherem até minha barriga parecer de grávida—papai adoraria netos lagartos! ♥︎",
        "Vamos lá, certifique-se de que está gravando isso! A aula de biologia do Refúgio precisa de filmagens precisas da destruição da buceta! ♥︎",
        "Porra, uma garra na minha garganta, um pau dividindo minha buceta, outro mirando na minha bunda? Sonhos realmente se tornam realidade! ♥︎",
        "Deus, meus peitos estão balançando tanto que vão me dar uma concussão! ♥︎",
        "Se essa orgia não me render o status de vadia lendária, nada mais vai! Fodam-me mais forte, rapazes! ♥︎",
        "Minha buceta declarou guerra oficialmente aos paus humanos—só pau de Deathclaw de agora em diante! ♥︎",
        "Ahh! Me encham com tanta porra de Deathclaw que eu vou brilhar em verde e ser banida do refúgio! ♥︎",
        "Este pode ser o último orgasmo da minha vida—mas puta que pariu, que maneira de ir! ♥︎",
        "É melhor vocês quebrarem cada osso do meu corpo de vadia—quero cicatrizes para me gabar em casa! ♥︎",
        "Ahh, porra, já não consigo andar direito, e eles ainda estão na fila—Deathclaws, se revezem para arrebentar minha buceta inútil! ♥︎",
        "Oh merda, isso é baba ou eles estão apenas pré-lubrificando seus paus de Deathclaw para mim? Quente. ♥",
        "♥︎ Ah, claro, transforme minha buceta em um parquinho de Deathclaw. Por que não?",
        "Ohhh, consigo sentir a energia gozástica irradiando deles. É assim que o sucesso cheira!",
        "Quem diria que se tornar uma vadia reprodutora de Deathclaw poderia ser tão empoderador? Tomem nota, vadias do refúgio! ♥︎",
        "Mmm, você vai me quebrar, e eu amo isso pra caralho, ahh! ♥︎",
        "Mmm, chame de ciência, chame de loucura, mas eu chamo de um momento muito bom! ♥︎",
        "Mmm, ohh, porra, se meu pai soubesse disso, ele teria um derrame—e eu estou prestes a ter um também!",
        "Ahh! Esse rosnado? Oh, doces garras, esse rosnado me atingiu bem no coração...",
        "Ahh, você está fazendo minha buceta gozar como um cano de água estourado! ♥︎",
        "Mmm, minha mistura de feromônios funciona melhor do que eu imaginava! Hora de engarrafar essa mágica e DOMINAR a wasteland!",
        "Porra, você está deixando minha buceta mais molhada que a porra da estação de purificação!",
        "Ahh! Oh, as vibrações desses rugidos... ♥︎",
        "Ahh! Está quente aqui, ou é só o amor bruto e não filtrado de Deathclaw?",
        "Mmm, por que isso parece uma holofita de fetiche estranhamente específica que o Boogie venderia?",
        "Mmm, ohh, vou gozar tanto, que minha buceta vai precisar de uma reinicialização!",
        "Mmm, eles estão rugindo de novo? Oh, rapazes, não briguem! Tem eu o suficiente para todos!",
        "Mmm, meu plano funcionou! Eu sou um gênio! Um gênio louco e com tesão, mas um gênio mesmo assim. ♥︎",
        "Ahh, mmm, seu pau é um super stimpack, e eu estou viciada pra caralho!",
        "Ohhh, aquele ali tem um brilho no olhar. Gosta do que vê, garotão? ♥︎",
        "Porra, seu pau está fazendo minha buceta gozar como um reator quebrado!",
        "Mmm, papai sempre disse que eu era uma decepção. Aposto que ele não pensou que eu conseguiria ISSO, hein? ♥︎",
        "Ahh, ohh, minha buceta está pingando como uma bolsa de radaway furada!",
        "Mmm, acho que nunca vi tanta porra em um só lugar. ♥︎",
        "Mmm, seu pau é como um núcleo de fusão, e eu estou superaquecendo! ♥︎",
        "Ahh, ♥︎ se o Supervisor pudesse me ver agora, ele ficaria tão orgulhoso!",
        "Mmm, você vai me fazer esguichar como uma válvula de água quebrada!",
        "Ahh! Oh, está me cheirando de novo. Vá em frente, garoto, esta pequena buceta é toda sua! ♥︎",
        "Ahh! Quem diria que o amor escamoso poderia ser tão... terapêutico? ♥︎",
        "Mmm, o Boogie vai ficar com tanto ciúme...",
        "Ahh! Eu deveria ter começado este experimento ANOS atrás. O que eu estava esperando? ♥︎",
        "Ahh! Oh, você está me olhando como se eu fosse sua rainha. ♥︎",
        "Mmm, ohh, seu pau deveria ser ilegal—é uma arma de destruição de bundas!",
        "Ahh! Meu experimento de feromônios não foi apenas um sucesso—foi um triunfo DO CARALHO!",
        "Ahh, puta que pariu, essa poção funcionou bem demais—esses paus parecem mais bravos que meu pai na hora do toque de recolher. ♥",
        "Sou só eu ou a puberdade dos Deathclaws tem muito mais pegada que a puberdade humana? Caramba! ♥",
        "Ahh, estou gozando tanto, estou vendo estrelas... ou talvez seja só a falta de oxigênio!",
        "Ahh, continue... me faça gozar!",
        "Ahh, estou gozando forte! Ahhhhh! ♥︎"
      ],
      "endingEffects": ["Flashes"]
    }
  ],
  "auto_lines": [
    "♥︎ Ah, então é ASSIM que termina? Três bebês Deathclaws e minha pobre e inocente buceta!",
    "♥︎ Sim, SIM! Rasgue este traje! Despedace-o! Mmm, quanta energia bruta!"
  ],
  "showShadowFigures": "Deathclaws2"
}
