{
  "options": [
    {
      "optionText": "Diana… seu lugar está bem aberto...",
      "responseText": "Está? Huh. Deve ser o elástico se desgastando. O equipamento do refúgio é *tão* pouco confiável depois de tanto esticar…",
      "followUpOptions": [
        {
          "optionText": "Você sabe muito bem que não é isso.",
          "responseText": "Se você está tão preocupado, talvez devesse se ajoelhar e fechar meu zíper. Ou isso também não é permitido, Oficial Mão Boba?"
        },
        {
          "optionText": "Jesus. Hugh parece que envelheceu uma década.",
          "responseText": "Coitadinho. Ele tem estado tão quieto. Deve ser a vergonha o consumindo. Ou a vista. Quem sabe? A psicologia do refúgio é tão fascinante. Ele tem sido um ótimo ouvinte também. Eu só falo e me espreguiço, e ele… bem, ele processa. Ruidosamente. Repetidamente."
        },
        {
          "optionText": "Você está praticamente se arejando, hein?",
          "responseText": "Tenho que manter as coisas ventiladas. Não gostaria de superaquecer… a menos que alguém *goste* de um pouco de suor, claro.",
          "followUpOptions": [
            {
              "optionText": "Você está falando sério, fazendo isso com ele aqui?",
              "responseText": "Fazendo *o quê*, exatamente? Estou apenas relaxando. Está calor. Minha mão só acontece de repousar… aqui. E puxar… ali. Completamente inocente."
            },
            {
              "optionText": "Você vai quebrá-lo.",
              "responseText": "Ele chegou quebrado, querido. Estou apenas polindo as rachaduras. Além disso, eu meramente... expando seus limites espirituais. Ele ascendeu. Voltou. Depois ascendeu de novo. Repetidamente."
            },
            {
              "optionText": "Por que sua mão está *sempre* puxando seu macacão um pouco mais para baixo toda vez que eu desvio o olhar?",
              "responseText": "Está? Talvez seja memória muscular. Ou talvez minha mão seja apenas… rebelde. Dedos safados. Tsk tsk."
            }
          ]
        },
        {
          "optionText": "Você sabe que é exatamente por isso que você acabou aqui, certo?",
          "responseText": "Sério? Pensei que fosse porque sorri demais para a câmera da sala de recreação. Tenho que ter cuidado com essas covinhas, hein?"
        }
      ]
    },
    {
      "optionText": "Diana. Contato visual. Agora.",
      "responseText": "Ops, desculpe. Estava perdida em pensamentos. Ou talvez eu apenas tenha me acostumado com o Hugh não aguentando mais de três segundos de contato visual.",
      "followUpOptions": [
        {
          "optionText": "Este lugar se chama Câmara da Vergonha, não Clube de Strip.",
          "responseText": "Bem, alguém precisa avisar o Hugh. Ele continua fazendo chover culpa e dignidade quebrada por lá."
        }
      ]
    },
    {
      "optionText": "Eu deveria te denunciar de novo.",
      "responseText": "Ah, não. Outra denúncia não. Por favor. Denuncie e talvez eles te joguem aqui também. Aí podemos todos relaxar juntos."
    }
  ]
}
