{
  "options": [
    {
      "optionText": "[Denunciá-la para a Polícia da Pureza]",
      "responseTexts": [
        "Oh, querido, vá em frente! Eu poderia usar a plateia deles. ♥"
      ],
      "exitLine": true,
      "reported": 5,
      "specialEffects": ["removeBlur", "removeVignette"]
    },
    {
      "optionText": "[Assistir]",
      "closeDialogueOptions": true,
      "isHEventStarted": true,
      "icon": "GUI/eye icon",
      "HideAllShadowFiguresAfterHevent": true,
      "specialEffects": ["removeBlur", "removeVignette", "Shake"],
      "reduceDesireAfterAutoLines": 10,
      "addGripGaugePoints": 700,
      "hEventName": "diana_diner_gangbang",
      "spriteAtTheEndOfHscene": "Characters/Diana/in cum/IPAdapter_00866_(1)",
      "spriteAtTheEndOfHscenePosition": [1.55, -1.2],
      "endingSpriteColor": "#FFFFFF",
      "lineAfterHevent": "Ahh... foi incrível... ♥︎",
      "emotionsDuringHevent": [
        "none",
        "Characters/Diana/Emotions/Gangbang Diner/1",
        "Characters/Diana/Emotions/Gangbang Diner/2",
        "Characters/Diana/Emotions/Gangbang Diner/3",
        "Characters/Diana/Emotions/Gangbang Diner/4"
      ],
      "endingEffects": ["Flashes"],
      "auto_lines": [
        "Ahh, porra sim, não pare agora... entrem mais fundo, seus bastardos ♥",
        "Mmm, consigo sentir cada pau, cada centímetro... porra, isso é melhor do que eu imaginei.",
        "Vocês, garotos, com certeza sabem como tratar uma dama... Continuem me enchendo, ainda não terminei!",
        "Hah, finalmente conseguindo o que eu tanto desejava... um após o outro, não se atrevam a diminuir o ritmo!",
        "Minha buceta está tão molhada por todos vocês... mais forte, porra, sim, exatamente assim!",
        "Ahhh, não tire, apenas continue bombeando sua porra para dentro... eu preciso dela, toda ela!",
        "Mmm, amo o jeito que você bate na minha bunda... mais forte, faça arder ♥",
        "Oh porra, vou gozar de novo, não pare, ahhh!",
        "Sim, exatamente assim, me encha com todos os seus sucos... não termino até vocês terminarem.",
        "Mmm, cada buraco, cada centímetro, sou de vocês... me façam gritar, garotos!",
        "Minha buceta está pingando, se revezem, me fodam até eu não conseguir andar direito!",
        "Mais, mais, quero cada um de vocês, não me deixem querendo!",
        "Tantos paus, tão pouco tempo... vamos fazer isso durar ♥",
        "Porra, estou tão perto... me façam gozar de novo, seus bastardos sujos!",
        "Mmm, amando cada segundo disso... continuem estocando, me encham com cada gota!",
        "Ahhh, sim, continuem batendo, não parem até eu estar encharcada de porra!",
        "Mmm, sim, bem fundo, quero sentir cada um de vocês ♥",
        "Sucos se misturando, porra por todo lado... porra, era disso que eu precisava!",
        "Ahh, sim, faça minha buceta ficar mais apertada a cada estocada, estou amando isso!",
        "Porra sim, todos juntos, vamos fazer este refúgio ecoar com nossos gemidos!",
        "Ahhh, eu sabia que vocês não resistiriam a um pouco de diversão... agora, quem é o próximo? ♥",
        "Hmmm, estou tão molhada que você poderia se afogar nos meus sucos... quer dar um mergulho?",
        "Não sejam tímidos, paus para fora, vamos ver o que vocês têm... um de cada vez ou todos de uma vez, não me importo.",
        "Ohhh, sim, é isso... mais fundo... me faça esquecer todas essas regras idiotas do refúgio.",
        "Mmm, porra... consigo sentir cada centímetro... não pare, quero tudo.",
        "*chupa* cada gota, garotos... tenho bastante para todo mundo.",
        "Deus, eu senti falta disso... seu pau é tão bom dentro de mim, que talvez eu até esqueça de escapar.",
        "Mmm, essas mãos na minha bunda... continuem apertando, não sou feita de vidro.",
        "Vamos, me encham, quero sentir vocês gozando em cada buraco.",
        "Hnnng, porra, não consigo ter o suficiente... vocês são bons demais.",
        "Oh, sim... fodam minha buceta até eu não conseguir ficar de pé... me façam gritar mais alto.",
        "Mmm, seus paus vão me fazer gozar tanto... vou arruinar esta mesa.",
        "Isso mesmo, me engasgue com ele... quero provar até a última gota.",
        "Porra, você está atingindo todos os pontos certos... continue, ainda não estou nem perto de terminar.",
        "Quero sentir sua porra escorrendo pelas minhas coxas... continue até eu estar encharcada nela.",
        "Ahhh, porra, você está me fazendo gozar de novo... não pare até eu implorar por misericórdia.",
        "Mmm, sim, foda minha garganta... me faça engasgar, eu amo a sensação.",
        "Oh deus, estou tão perto... não se atreva a tirar agora.",
        "Me encham, garotos... quero transbordar com a porra de vocês.",
        "Hmmm, isso foi só o aquecimento... quem está pronto para o segundo round?",
        "Ahhh, não pensei que você duraria tanto… mas continue, ainda não terminei. ♥",
        "Hmmm, toda essa energia reprimida... nunca pensei que realmente gostaria de compartilhá-la. Não pare agora.",
        "Tantos paus, tão pouco tempo... acho que terei que ser multitarefa. ♥",
        "Gozem por mim, garotos... vocês seguraram por tempo demais.",
        "A buceta estava desejando essa atenção... vamos ver quem consegue satisfazê-la primeiro. ♥",
        "Finalmente, um pouco de ação de verdade... A Vault-Tec nunca planejou isso, não é? ♥",
        "É melhor todos vocês durarem, porque não vou diminuir o ritmo tão cedo.",
        "Mmmm, é isso que acontece quando tentam controlar os desejos das pessoas... elas simplesmente explodem.",
        "Ahhh, é isso... não sejam tímidos, tem eu o suficiente para todo mundo. ♥",
        "Quem diria que saco azul poderia levar a tanta diversão? Estou amando cada segundo. ♥",
        "Hmmm, aposto que nunca pensou que este refúgio poderia ficar tão selvagem, hein? ♥",
        "Mais, mais... quero ver quem consegue me fazer gritar mais alto.",
        "Vamos lá, garotos... mostrem-me o que vocês guardaram por todo esse tempo. ♥",
        "Ahhh, vou precisar de um banho depois disso... talvez dois, ou três.",
        "Tantas mãos, tantos paus... sinto-me como a rainha que nasci para ser. ♥",
        "Vamos garantir que todos tenham sua vez... ninguém sairá insatisfeito esta noite.",
        "Mmmm, quem diria que quebrar as regras poderia ser tão bom? Continuem. ♥",
        "Ahhh, se é assim que a rebelião se parece, me inscrevam para o segundo round.",
        "É melhor vocês não se segurarem, porque não vou parar até que todos vocês estejam esgotados. ♥",
        "Gozem o quanto quiserem, garotos... ainda não terminei com vocês. ♥",
        "Ahh, olhem todos esses paus desesperados na fila! Quem diria que trabalho de caridade poderia ser tão... hmmm... gratificante. ♥",
        "Oh, estou tão molhada agora! Poderia afogar um estábulo inteiro de garanhões nos meus sucos. *chupa*",
        "Hmmm, você chama isso de estocada? Vamos lá, preciso que você me foda como se o refúgio estivesse prestes a desabar! Aghh, é isso!",
        "Sim, sim, SIM! Me encham, garotos! Quero ver se consigo aguentar mais porra do que este refúgio pode conter!",
        "Oh, você está tão fundo! Você pode até encontrar o Botão de Liberação de Emergência aí dentro! ♥",
        "*chupa* Oh, tantos paus... Continuem vindo, garotos! Sou como o sistema de entretenimento do refúgio no volume máximo!",
        "Aghh! Estou perdendo a conta de quantos paus chupei hoje... não que isso importe. Hmmm, vou continuar até não conseguir pensar direito. Oh espere, tarde demais!",
        "Olhem para todos vocês, idiotas babando, apenas esperando a vez... Ohh, aposto que suas bolas estão tão pesadas! Deixe-me ajudar com isso. *chupa*",
        "Ahh, consigo sentir você pulsando dentro de mim! Vou te ordenhar até secar como a última garrafa de Nuka-Cola! Aghh!",
        "Vamos lá, não sejam tímidos! Tenho duas mãos e uma boca. Vamos colocá-las para trabalhar, Aghh!",
        "Você acha que a Polícia da Pureza pode parar isso? Quero ver eles tentarem! Quando chegarem aqui, terei porra saindo pelas minhas orelhas! ♥",
        "Mais, mais! Quero que todos vocês me fodam até meu cérebro virar mingau, e tudo que eu conseguir pensar seja nos seus paus. Ahh, oh sim!",
        "Aghh! Seu pau é tão bom... quero mais fundo! Tipo, até o fundo da minha garganta, oh deus! *chupa*",
        "Ahh, consigo sentir minha buceta apertando ao seu redor! Você vai me fazer gozar, e aposto que metade do refúgio vai ouvir!",
        "Tanta porra... hmmm, eu poderia fazer uma vitamina com isso! Vocês guardaram para mim, não foi? *chupa*",
        "Ahh, parece que estou nadando em um mar de paus! E sabe de uma coisa? Não estou reclamando nem um pouco! ♥",
        "Oh, deus! Continue me fodendo, quero desmaiar de prazer! Faça meus olhos revirarem e meus dedos dos pés se curvarem, oh sim!",
        "Sou sua deusa do refúgio! Me adorem com seus paus! Me encham até eu estar pingando com o amor de vocês. Ahh!",
        "Hmmm, cada estocada me leva mais perto do céu... e eu nem acredito nessa merda! Aghh!",
        "Oh, garotos... continuem me fazendo gozar assim, e vou garantir que cada um de vocês tenha sua vez! *chupa* Sou assim tão generosa!"
      ]
    }
  ],
  "auto_lines": [
    "Oh porra, vou gozar de novo, não pare, ahhh!",
    "Sim, exatamente assim, me encha com toda a sua porra... não termino até vocês terminarem.",
    "Mmm, cada buraco, cada centímetro, sou de vocês... me façam gritar, garotos!"
  ],
  "hEventStarted": "diner_gangbang",
  "showShadowFigures": "Diana's gangbang"
}
