{
    "options": [
        {
            "optionText": "[Report her to the Purity Police]",
            "responseTexts": ["Go ahead, snitch. Just make sure to tell them how long you stood there watching before you decided to tattle. I’ll be sure to mention how you couldn’t keep your eyes off me.", "What the f--?! You little snitch! Go ahead, report me, but don’t act like you weren’t thinking of joining in. Just remember: snitches get... nothing. And I do mean nothing."],
            "exitLine": true,
            "specialEffects": ["removeBlur", "removeVignette"],
            "reported": 5
        },
        {
            "optionText": "[Watch]", 
            "specialEffects": ["removeBlur", "removeVignette"],
            "spriteAtTheEndOfHscene": "Characters/Diana/Resized/sitting naked",
            "spriteAtTheEndOfHscenePosition": [ -6, -0.6 ],
            "closeDialogueOptions": true,
            "addGripGaugePoints": 500,
            "icon": "GUI/eye icon",
            "isHEventStarted": true,
            "HideAllShadowFiguresAfterHevent": true,
            "endingEffects": ["Flashes"],
            "hEventName": "diana_diner_fapping",
            "emotionsDuringHevent": ["none", "Characters/Diana/Emotions/fapping2/1", "Characters/Diana/Emotions/fapping2/2", "Characters/Diana/Emotions/fapping2/3", "Characters/Diana/Emotions/fapping2/4"],
            "lineAfterHevent": "Ahh... it was amazing... ♥︎",
            "auto_lines": [
    "Ahhh, you boys enjoying the show? Don’t act like you haven’t been waiting for this.", 
    "Mmm, you boys keep staring, and I’m gonna need a mop for this table... ahh ♥." , 
    "Oh god, right there, yes... yes...! ♥", 
    "Ahhh, don’t be shy... this is what you wanted, isn’t it? ♥",
    "Oooh, I bet all of you are thinking the same thing… how fast you’d fill me up. Mmm, so naughty ♥.",
    "I’ve been so pent up... so wet... I need this...!",
    "I can see you staring at my pussy… don't worry, boys, it's even wetter than your mouth right now ♥.",
    "Look at you, all staring... ♥",
    "Ohhh, yesss... that’s the spot... oh, I’m so close... ♥",
    "Ahh, I’m practically dripping just thinking about all of you… but which one gets to clean it up? ♥",
    "I bet you’d love to help, wouldn’t you? Too bad... ahhh...",
    "Mmm, you can only watch... just stand there and drool, boys.",
    "Oooh, I just love the way you guys are drooling… mmm, makes me want to ride this table ‘til it breaks ♥.",
    "God, this feels so good... so wet...!",
    "Ahhh, don’t pretend you’re not enjoying this... your dicks can't lie ♥",
    "I could cum just from the way you’re all looking at me, mmm… maybe I will. Ahh ♥." ,
    "Mmm, this table is so cold... but I’m so... so hot right now... ♥",
    "I know you want more, but... too bad you can't.",
    "I can feel your eyes on me, ahh, and it's turning me on so much I might just let you taste how wet I am mmm ♥.",
    "Ahh, just keep watching, maybe I’ll give you a little... reward.",
    "So wet... so ready... mmm...!",
    "Mmm, I’m so wet I could slide right off this table… ahh, but I bet you’d catch me with something hard, wouldn’t you? ♥",
    "You love this, don’t you? All of you... I can see the way you’re looking at me.",
    "Ahhh... it feels so good... almost there... almost...!",
    "You can’t touch, boys... but you can watch all you want... ♥",
    "Ohh, I just love when you boys watch me play with my pussy… mmm, but I’d rather be play with something else. Ahh, who’s first? ♥",
    "Ohhh, right there... yes... ohhh... ahhh!",
    "Mmm, I’m so close... just... a little more...!", 
    "Mmm, you all look so hungry… too bad this isn’t the kind of meal I can serve you, but I’m open to suggestions ♥.",
    "Ahhh, this is so much better than I imagined... ♥", 
    "This pussy's juices are sweet, but I bet your cum would be sweeter mmm, wanna prove me wrong? ♥",
    "So wet... so close... ohhh... yes!",
    "I could just sit here and let you stare at my pussy all day, mmm… Ahh ♥.",
    "You’re all such pervs... but I love the way you’re watching me.",
    "Ahhh, right there... almost... ahh, yesss!",
    "Oooh, I can see you all have stiff little surprises for me… mmm ♥",
    "I’m the only thing you’ll be thinking about tonight, aren’t I? ♥", 
    "I’m so wet right now, ahh… you’d need a towel after just one touch, mmm ♥.",
    "Mmm, god, I’m so fucking wet right now... ♥ You boys just gonna stand there? ♥",
    "Ahh... ohhh yeah, right there... you like this, huh? ♥",
    "Don’t pretend you’re not loving this. Look at you! Your dicks are so hard ♥", 
    "Mmm, you boys are making me so hot… ahh, I might just let you cum all over me ♥.",
    "Mmm, you’ll never get this close to me again! So, enjoy the view, perverts! ♥",
    "You all so hard for me mmm ♥.",
    "Ahhh, god, I’m so close... ohhh yeah... ♥",  
    "I’m so wet, I could water the entire vault garden with this... ohhh, fuck! ♥",       
    "Ahh, I’m so close… maybe I should just let you finish me off right here, mmm, what do you think? ♥",
    "I’m gonna finish so hard, and you’re gonna stand there wishing it was you... ohhh fuck yes! ♥",     
    "Ahhh, I’m gonna finish all over this table, and you’re just gonna have to clean it up! ♥",
    "Oooh, I’m dripping down my thighs, mmm, you boys gonna help me clean up or just keep staring? ♥",
    "Mmm, oh, this feels so good... ♥ You boys like what you see? I bet you do! ♥",
    "Ahhh, don’t be shy... I know you’ve been dying to see me like this!",
    "I bet you’d love to taste how wet I am right now, mmm, I’d love to feel your tongue there too ahhh ♥.",
    "Ohhh, it’s so wet... ♥ Come on, don’t act all innocent now!",
    "I bet you’ve been dreaming of this, haven’t you? Mmm, just look at your faces!",
    "Mmm, I can feel the tension in the air… or is that just all your balls straining to hold in your cum? Ahh ♥.",
    "Ahhh, I’m putting on a real show tonight, boys! ♥",
    "Mmm, I see those blushes. Too cute! I didn’t know vault boys could get so red!",
    "If one of you touched me right now, ahh, I’d probably explode all over this diner… mmm, cum on, who’s brave enough? ♥",
    "Ohhh, yes! This table’s a little cold, but I’m definitely not! ♥", 
    "Ahhh, fuck, this feels so good... none of you have ever seen something like this before, huh? ♥",
    "Mmm, I can hear you all gulping... so adorable!",
    "Ohhh, I’m so close... ♥ I bet you’d all love to be closer, too!",
    "Don’t pretend you’re not into this! I see those hungry eyes!",
    "Mmm, so wet, so ready... ♥ Too bad you boys just get to watch!",
    "I bet you wish you could join me up here, huh? Maybe next time, if you’re lucky!",
    "Ahhh, I’m almost there... you boys are making this way too easy for me!",
    "Mmm, you’re all just sitting there... like I’m the only thing in this diner worth paying attention to!",
    "Ohhh, yesss... come on, don’t look away now! ♥",
    "You know you’re all gonna be thinking about this for days... admit it!",
    "Mmm, I’m so wet that even this table’s starting to feel it… ahhh, you boys wanna feel it too? ♥",
    "Ahhh, god, I’m so close... ♥ I think I’m driving you crazy!",
    "Mmm, I’ve never had such a captivated audience! You boys are so sweet!",
    "Ohhh, this is better than anything on the menu! ♥",
    "Ahhh, I’m almost there... ♥ Are you loving this as much as I am?",
    "Mmm, if you weren’t so shy, maybe you could help me finish!",
    "Mmm, I’m so close… ahhh, one of you better help me finish or I’m gonna make a mess right here ♥.",
    "Ohhh, god, right there... yesss! ♥",
    "Imagine if you could put that dick right in here... it’s so warm, so wet… ♥",
    "I can see you all thinking the same thing, mmm… you wanna fill me up so bad, ahhh, don’t you? ♥",
    "You boys are so quiet! Don’t worry, you can cheer for me if you want! ♥",  
    "Ahhh, you’re all looking at me like I’m dessert! Maybe I am!",
    "Ohhh, god, yes... you’ve all been such good little watchers! ♥",
    "Yes, yes, yes... oh, fuck, it’s coming... gonna cum so hard...",
    "Fuck, fuck, FUCK... cumming, oh God, cumming... ahhhh ♥♥♥..."
    ]
            
        }
    ],
        "auto_lines": [ 
    "I can feel your eyes on me, ahh, and it's turning me on so much I might just let you taste how wet I am mmm ♥.", 
    "So wet... so ready... mmm...!"
    ],
    "showShadowFigures": "Diana's audience",
    "hEventStarted": "fapping_diner"
}
