{
  "options": [
    {
      "optionText": "[Denunciá-la para a Polícia da Pureza]",
      "responseTexts": [
        "Vá em frente, dedo-duro. Só não se esqueça de dizer a eles quanto tempo você ficou aí assistindo antes de decidir dedurar. Com certeza mencionarei como você não conseguia tirar os olhos de mim.",
        "Que p--?! Seu dedo-duro! Vá em frente, me denuncie, mas não finja que não estava pensando em participar. Só lembre-se: dedos-duros não ganham... nada. E quero dizer nada mesmo."
      ],
      "exitLine": true,
      "changeSprite": "Characters/Diana/Resized/angry",
      "newSpriteXPos": 0.4,
      "newSpriteYPos": -0.28,
      "specialEffects": ["removeBlur", "removeVignette"],
      "progressionEventPlayed": "reporting_diana_for_masturbating_in_her_room",
      "showChoiceStats": "reporting_diana_for_masturbating_in_her_room",
      "reported": 5
    },
    {
      "optionText": "[Assistir secretamente]",
      "specialEffects": ["removeBlur", "removeVignette"],
      "exitLine": true,
      "icon": "GUI/eye icon",
      "isHEventStarted": true,
      "closeDialogueOptions": true,
      "spriteAtTheEndOfHscene": "Characters/Diana/new NSFW/sitting no panties",
      "interactable": "Characters/Diana/Interactables/diana masturbation",
      "interactableBGcolor": "#989898",
      "hEventName": "diana_solo_her_room",
      "progressionEventPlayed": "watching_diana_masturbating_in_her_room",
      "showChoiceStats": "watching_diana_masturbating_in_her_room2",
      "spriteAtTheEndOfHscenePosition": [0.59, -0.59],
      "lineAfterHevent": "Ahh... foi incrível... ♥︎",
      "auto_lines": [
        "Hmmm... só mais um pouco... bem aí... mmm, sim...",
        "Ahh... tenho que ser rápida... não quero a Polícia da Pureza batendo... ahh...",
        "Oh, sim... bem aí... é disso que eu preciso... ahh... quem se importa com as regras idiotas deles...",
        "Hmmm... só mais um pouco... caramba, este refúgio não pode me segurar... ahh...",
        "Mm, sim, foda-se a pureza... É disso que se trata. Só eu e minha buceta... ♥",
        "Ahh... toma essa, Supervisor... se você soubesse o que está acontecendo aqui... hmmm...",
        "Hmmm... o que o Supervisor diria se me pegasse? ‘Diana, você está quebrando as regras’... sim, claro... ahh...",
        "Hmmm... só mais um pouco... então talvez eu tenha energia para lidar com esses idiotas... ahh...",
        "Oh, sim... mmm... só de pensar no que vou fazer quando sair daqui... ♥",
        "Oh, sim... é isso... tão perto... ahh... só mais um pouco...",
        "Ahh... aí está... finalmente... esse é o ponto... mmm... ♥",
        "Quase lá... Deus, vou encharcar a cama...",
        "Mmm, minha buceta está com tanta fome disso... queria encontrar alguém para me encher...",
        "Ohh, sim... bem aí, bem aí... tão molhada, não consigo parar agora...",
        "Ahh, sim... dedos fundos na minha buceta, tão bom...",
        "Porra, sim... faz muito tempo... sucos escorrendo pelas minhas coxas, do jeito que eu gosto...",
        "Ahh... tão perto... mmm... só preciso... hmmm... sim...",
        "Sim, sim... continue... dedos trabalhando nesse clitóris... Deus, estou tão molhada...",
        "Mmm, queria encontrar alguém com um pau de verdade, mas isso terá que servir...",
        "Ugh, tão perto... porra, vou gritar quando gozar, não me importo com quem ouvir...",
        "Vou gozar, vou gozar... bem aqui neste refúgio estúpido, e não há nada que eles possam fazer para me impedir...",
        "Ahh, porra, tão perto... vou gozar, vou gozar, não consigo parar agora...",
        "Sim, sim, sim... oh, porra, está vindo... vou gozar tanto...",
        "Quase lá... oh Deus, sim... aí vem, vou encharcar esses lençóis... gozando... ahhhh ♥♥♥..."
      ],
      "endingEffects": ["Flashes"]
    }
  ],
  "auto_lines": [
    "Ohh, sim... bem aí, bem aí... tão molhada, não consigo parar agora...",
    "Ahh, sim... dedos fundos na minha buceta, tão bom..."
  ],
  "hEventStarted": "fapping1"
}
