{
  "options": [
    {
      "optionText": "Uh, sabe que um dos seus mamilos está aparecendo, certo?",
      "responseText": "Ah, essa coisa velha? Acho que só queria um pouco de ar fresco. Relaxa, não é como se estivéssemos quebrando nenhuma das grandes regras aqui—a menos que você queira dedurar para a Polícia da Pureza. Eles poderiam usar um pouco de emoção, mesmo que seja por um mamilo fujão.",
      "followUpOptions": [
        {
          "optionText": "Você está louca? Se alguém vir, você está ferrada.",
          "responseText": "Relaxe, puritano. Os únicos que notariam estão ocupados demais olhando para os próprios umbigos, tentando reprimir seus pensamentos profanos. Mas claro, se quiser correr para a Mamãe Supervisora, fique à vontade."
        }
      ]
    },
    {
      "optionText": "Uh, sabe que um dos seus mamilos está aparecendo, certo?",
      "responseText": "Oh, é mesmo? Acho que meu corpo está apenas clamando por liberdade. Mas não se anime muito—é mais ação do que este refúgio viu em anos. Se a Polícia da Pureza te pegar olhando, você terá um lugar na primeira fila da Câmara da Vergonha.",
      "followUpOptions": [
        {
          "optionText": "Sabe que isso pode te colocar em sérios apuros, certo?",
          "responseText": "Apuros? Se um mamilo à mostra é o que finalmente fará a Polícia da Pureza surtar, talvez seja melhor para todos nós assistirmos às consequências.",
          "followUpOptions": [
            {
              "optionText": "Não me importo. Vou te denunciar ao Supervisor.",
              "responseText": "Vá em frente, seja o monitor de corredor residente do Refúgio 6969. Só lembre-se, a Polícia da Pureza provavelmente está mais excitada com sua dedicação às regras do que com um pouco de pele. Talvez você acabe na Câmara da Vergonha bem ao meu lado.",
              "report": true
            },
            {
              "optionText": "De jeito nenhum vou te denunciar. A Polícia da Pureza não pode manter todos na coleira para sempre.",
              "responseText": "Agora sim, esse é o espírito! Vamos ver se conseguimos forçar um pouco mais os limites. Quem sabe, talvez você até comece uma revolução. Ou pelo menos torne a próxima assembleia um pouco menos entediante."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Então, o que você acha desta assembleia de pureza?",
      "responseText": "Ah, você quer dizer este lembrete semanal de que vivemos em um convento pós-apocalíptico? Sim, eu espero por isso como uma barata radioativa espera pelo controle de pragas."
    },
    {
      "optionText": "[Presente]",
      "isGifting": true
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Já vai? Acho que terei que encontrar outra plateia para minha rebelião acidental.",
        "Até mais, santo. Não deixe a propaganda da pureza bagunçar muito sua cabeça.",
        "Já vai? Acho que terei que manter o outro mamilo coberto por enquanto."
      ],
      "exitLine": true
    }
  ]
}
