{
  "options": [
    {
      "optionText": "[Entregar Lingerie]",
      "icon": "GUI/quest mark",
      "responseText": "Oh, meu... eu sabia que você tinha bom gosto, mas isso? Querido, você se superou! São fabulosas! Obrigada!",
      "onlyDisplayIfHasObjective": "Get lingerie for Diana",
      "giveItemToCharacter": "Red Lingerie",
      "itemRequired": "Red Lingerie",
      "relationshipPoints": 15,
      "markObjectiveComplete": "Get lingerie for Diana",
      "exitLine": true
    },
    {
      "optionText": "[Entregar Dildo]",
      "icon": "GUI/quest mark",
      "responseText": "Oh, meu... você realmente sabe como satisfazer os desejos de uma garota. Esperei o dia todo para alguém me entregar um... dildo grande e firme. Obrigada.",
      "onlyDisplayIfHasObjective": "Get dildo for Diana",
      "giveItemToCharacter": "Monster Dildo",
      "itemRequired": "Monster Dildo",
      "relationshipPoints": 20,
      "markObjectiveComplete": "Get dildo for Diana",
      "exitLine": true
    },
    {
      "optionText": "Eu peguei o peixe, amor.",
      "onlyDisplayIfHasObjective": "Bring Diana fish.",
      "icon": "GUI/quest mark",
      "responseText": "Você conseguiu mesmo? Oh meu deus... isso é incrível. Cheira horrível e eu amo isso. Obrigada. Sério.",
      "markObjectiveComplete": "Bring Diana fish.",
      "relationshipPoints": 15,
      "giveItemToCharacter": "Radbass",
      "itemRequired": "Radbass",
      "exitLine": true
    },
    {
      "optionText": "Como está minha garotinha hoje?",
      "responseText": "Ugh, não diga isso a menos que esteja pronto para eu derreter em seus braços. Os hormônios estão dando piruetas agora. Estou cansada, dolorida... mas meio em paz. Você estar aqui ajuda. Obrigada.",
      "followUpOptions": [
        {
          "optionText": "Você está carregando todo o nosso futuro nessa barriga.",
          "responseText": "Deus, por que você diz coisas assim? Agora estou chorando. Venha me abraçar antes que eu estrague este macacão já apertado demais."
        },
        {
          "optionText": "Você não está sozinha nisso, Diana. Estou aqui. Sempre.",
          "responseText": "Bom. Porque não quero fazer isso sem você. E não só as coisas do bebê. Tudo."
        },
        {
          "optionText": "Eu te amo.",
          "icon": "GUI/heart4",
          "responseText": "Diga de novo. Não, sério. Preciso ouvir. Porque eu também te amo—e estou com medo e animada ao mesmo tempo.",
          "followUpOptions": [
            {
              "optionText": "Venha aqui. Deixe-me ajudar a esquecer todo o resto por um tempo.",
              "icon": "GUI/heart4",
              "responseText": "Mmm... sim. Parece perfeito. Só... me abrace por um minuto primeiro. Depois não solte.",
              "followUpOptions": [
                {
                  "optionText": "[Fazer sexo]",
                  "changeSprite": "Characters/Diana/pregnant/pregnant_Diana_room",
                  "newSpriteXPos": 0.72,
                  "newSpriteYPos": -0.45,
                  "icon": "GUI/heart4",
                  "closeDialogueOptions": true,
                  "isHEventStarted": true,
                  "setBGcolor": "#919191",
                  "changeSpriteColor": "#E7E7E7",
                  "specialEffects": ["Blackout"],
                  "endingEffects": ["Flashes"],
                  "progressionEventPlayed": "diana_herRoom_pregnant_PlayerSex",
                  "spriteAtTheEndOfHscene": "Characters/Diana/pregnant/post sex pregnant",
                  "emotionsDuringHevent": [""],
                  "spriteAtTheEndOfHscenePosition": [1.3, -2.52],
                  "endingSpriteColor": "#D1D1D1",
                  "lineAfterHevent": "Ahh... é melhor você não ter afogado o bebê com o tanto que bombeou aí dentro...",
                  "reduceDesireAfterAutoLines": 10,
                  "hEventName": "diana_herRoom_pregnant_PlayerSex",
                  "auto_lines": [
                    "Ahhh! Porra... seu pau parece ainda maior agora que estou inchada assim... ♥",
                    "Mmm, caramba, nunca estive tão sensível... você me arruinou, amor. Completamente arruinada.",
                    "Sim, bem aí—porra! Me encha mais fundo. Certifique-se de que eu sinta bem contra seu bebê. ♥",
                    "Oh, amor, meus peitos doem tanto... por favor, aperte-os mais forte.",
                    "Porra, porra, juro que você me transformou numa bagunça completa. Grávida, com tesão, carente—apenas sua putinha de cria perfeita, hein? ♥",
                    "Ahhh… essa barriga—mmm—porra, só de sentir você me batendo enquanto nosso bebê chuta lá dentro… é tão errado, mas Deus, eu amo!",
                    "Ohhh, mais forte! Me mostre o quanto você ama me engravidar, faça essa buceta doer por dias! ♥",
                    "Sim—porra!—me faça gemer tão alto que todos lá fora saibam exatamente quem está me fodendo esta noite.",
                    "Mmm, seu pau é incrível… cada estocada me lembrando por que quebrei todas as malditas regras só para sentir você gozar dentro de mim. ♥",
                    "Ah, ah, não se atreva a parar! Eu preciso desse pau, amor. Grávida ou não, sou sua a qualquer hora, em qualquer lugar!",
                    "Ohhh, deus, sim, foda a mãe do seu filho exatamente assim... Me faça saber exatamente quem é o dono desta buceta. ♥",
                    "Mmm, quanto mais fundo você vai, mais forte o bebê chuta. Você está nos enlouquecendo—não se atreva a tirar!",
                    "Ahhh! Já estou vazando por todo lado… peitos grávidos, buceta inchada, tudo pingando por sua causa. ♥",
                    "Sim! Me alargue, amor—me foda até esta barriga de grávida tremer, deixe todo mundo saber o quão profundamente amada eu sou.",
                    "Porra… consigo sentir cada pulso do seu pau dentro de mim… você está me marcando tão profundamente… nosso filho sentindo exatamente o quão desesperada você me deixou.",
                    "Mmmm, espero que você nunca se canse de me foder grávida. Porque eu poderia fazer isso—oh porra—todos os dias!",
                    "Sim, sim—caramba, estou gozando! Gozando pra caralho ao redor do seu pau com seu bebê dentro de mim... ahhh, porra! ♥",
                    "Mmm, me beije com mais força enquanto me fode sem piedade… quero provar o quanto você ama me fazer sua.",
                    "Oh, deus, seu pau me atinge tão bem… cada estocada me lembra exatamente por que deixei você me engravidar. ♥",
                    "Me foda até eu não conseguir andar, até todos neste refúgio saberem exatamente por que quebrei as regras por você! ♥",
                    "Oh, amor, goze dentro de mim… me encha de novo, me lembre como sua semente pertence perfeitamente aqui.",
                    "Ahhh, sim! Sou sua vadia, sua amante, seu brinquedo sexual grávido… nunca pare de me foder! ♥",
                    "Continue, por favor… me engravide de novo e de novo, amor… carregarei seus bebês para sempre se for isso que ganho. ♥",
                    "Oh, deus… mmm… minha buceta pulsa toda vez que você toca minha barriga, me lembrando exatamente por que sou sua…",
                    "Porra… sim… mais fundo, mais forte… quero sentir sua porra escorrendo pelas minhas coxas quando sairmos daqui… ♥",
                    "Ahhh… eu te amo tanto… me foda, me engravide, me ame para sempre, porque sou sua… completamente sua. ♥",
                    "Porra, você é incrível… me enchendo com tudo que você tem… por favor, me afogue, me faça transbordar… ♥"
                  ]
                }
              ]
            }
          ]
        },
        {
          "optionText": "Caramba, você está realmente aparecendo agora...",
          "responseText": "Eu sei, né? Parece que tenho um pod inteiro do refúgio aí dentro. E de alguma forma, ainda é meio bonito. Estranho, hein?",
          "followUpOptions": [
            {
              "optionText": "Você ainda é a coisa mais gostosa deste refúgio.",
              "responseText": "Você é um doce. Ou isso, ou está tentando me distrair do fato de que não consigo me curvar sem xingar."
            },
            {
              "optionText": "Esse macacão está perdendo a luta...",
              "responseText": "Me fale sobre isso. Cada esticada parece que está se segurando pela vida. E meus peitos estão encenando uma rebelião completa."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Você precisa de algo? Água? Massagem nas costas? Incentivo moral?",
      "dontDisplayIfHasObjective": "Bring Diana fish.",
      "dontDisplayIfObjectiveComplete": "Bring Diana fish.",
      "icon": "GUI/quest mark",
      "responseText": "Sinceramente? Quero algo salgado. Como peixe. Peixe de verdade. Não barras de nutrientes ou o que quer que o refúgio considere proteína. Quero sentir o gosto. Quero gorduroso, quente e se desfazendo nas minhas mãos. Mas claro... o refúgio não tem.",
      "followUpOptions": [
        {
          "optionText": "Eu pego para você. Mesmo que eu tenha que pescá-lo no maldito rio da wasteland.",
          "icon": "GUI/quest mark",
          "responseText": "Você faria isso por mim, querido? Sairia lá fora só para me trazer um peixe? ...Deus, eu te amo. Eu te amo. Apenas volte para mim inteiro. Por favor.",
          "addObjective": "Bring Diana fish.",
          "exitLine": true
        },
        {
          "optionText": "Desculpe, não há peixe no menu do refúgio. Você está presa com feijão e cubos de carne vagos.",
          "responseText": "Ugh. Não brinque agora. Meus hormônios vão me fazer chorar ou te matar. Possivelmente ambos.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "[Dar um Presente]",
      "emotion": "none",
      "icon": "GUI/gift icon",
      "neverGreyOut": true,
      "isGifting": true
    },
    {
      "optionText": "Tchau",
      "responseText": "Ok. Só... não demore muito. Me sinto mais segura quando você está por perto.",
      "exitLine": true
    }
  ]
}
