{
  "options": [
    {
        "optionText": "[Hand over Lingerie]",
        "icon": "GUI/quest mark",
        "responseText": "Oh my... I knew you had good taste, but this? Darling, you've outdone yourself! Those are fabulous! Thank you!", 
        "onlyDisplayIfHasObjective": "Get lingerie for Diana",
        "giveItemToCharacter": "Red Lingerie",
        "itemRequired": "Red Lingerie",
        "relationshipPoints": 15,
        "markObjectiveComplete": "Get lingerie for Diana",
        "exitLine": true
    },
    {
        "optionText": "[Hand over Dildo]",
        "icon": "GUI/quest mark",
        "responseText": "Oh my... you really know how to satisfy a girl’s cravings. I’ve been waiting all day for someone to hand me a big, firm... dildo. Thank you.", 
        "onlyDisplayIfHasObjective": "Get dildo for Diana",
        "giveItemToCharacter": "Monster Dildo",
        "itemRequired": "Monster Dildo",
        "relationshipPoints": 20,
        "markObjectiveComplete": "Get dildo for Diana",
        "exitLine": true
    },
    {
      "optionText": "I've got the fish, baby.",
      "onlyDisplayIfHasObjective": "Bring Diana fish.",
      "icon": "GUI/quest mark",
      "responseText": "You actually did it? Oh my god... this is amazing. It smells awful and I love it. Thank you. Seriously.",
      "markObjectiveComplete": "Bring Diana fish.",
      "relationshipPoints": 15,
      "giveItemToCharacter": "Radbass",
      "itemRequired": "Radbass",
      "exitLine": true
    },
    {
      "optionText": "How’s my babygirl doing today?",
      "responseText": "Ugh, don’t say that unless you’re ready for me to melt into your arms. Hormones are doing backflips right now. I'm tired, sore... but kind of peaceful. You being here helps. Thank you.",
      "followUpOptions":[
        {
          "optionText": "You’re carrying our whole future in that belly.",
          "responseText": "God, why do you say things like that? Now I’m tearing up. Come hold me before I ruin this already too-tight suit."
        },
        {
          "optionText": "You’re not alone in this, Diana. I’m here. Always.",
          "responseText": "Good. Because I don’t want to do this without you. And not just the baby stuff. Everything."
        },
        {
          "optionText": "I love you.",
          "icon": "GUI/heart4",
          "responseText": "Say that again. No, seriously. I need to hear it. Because I love you too—and I’m scared and excited at the same time.",
          "followUpOptions": [
            {
              "optionText": "Come here. Let me help you forget everything else for a while.",
              "icon": "GUI/heart4",
              "responseText": "Mmm... yeah. That sounds perfect. Just... hold me for a minute first. Then don't let go.",
              "followUpOptions": [
                {
              "optionText": "[Have sex]",
              "changeSprite": "Characters/Diana/pregnant/pregnant_Diana_room",
                        "newSpriteXPos": 0.72,
                        "newSpriteYPos": -0.45,
                        "icon": "GUI/heart4",
                        "closeDialogueOptions": true,
                        "isHEventStarted": true,
                        "setBGcolor": "#919191",
                        "changeSpriteColor": "#E7E7E7",
                        "specialEffects": ["Blackout"],
                        "endingEffects": ["Flashes"],
                        "progressionEventPlayed": "diana_herRoom_pregnant_PlayerSex",
                        "spriteAtTheEndOfHscene": "Characters/Diana/pregnant/post sex pregnant",
                        "emotionsDuringHevent": [ ""],
                        "spriteAtTheEndOfHscenePosition": [ 1.3, -2.52 ],
                        "endingSpriteColor": "#D1D1D1",
                        "lineAfterHevent": "Ahh... you better not have drowned the baby with how much you pumped in there...", 
                        "reduceDesireAfterAutoLines": 10,
                        "hEventName": "diana_herRoom_pregnant_PlayerSex",
                        "auto_lines": ["Ahhh! Fuck... your cock feels even bigger now that I'm swollen like this... ♥",

"Mmm, goddamn it, I’ve never been this sensitive... you’ve ruined me, baby. Completely ruined.",

"Yes, right there—fuck! Fill me deeper. Make sure I feel it right against your baby. ♥",

"Oh, baby, my tits ache so bad... please, squeeze them harder.",

"Fuck, fuck, I swear you’ve turned me into a complete mess. Pregnant, horny, needy—just your perfect little breeding slut, huh? ♥",

"Ahhh… this belly—mmm—fuck, just feeling you pounding me while our baby’s kicking inside… it's so wrong, but God, I love it!",

"Ohhh, harder! Show me how much you love knocking me up, make this pussy ache for days! ♥",

"Yes—fuck!—make me moan so loud everyone outside knows exactly who’s fucking me tonight.",

"Mmm, your dick feels amazing… every thrust reminding me why I broke every damn rule just to feel you cum inside. ♥",

"Ah, ah, don’t you dare stop! I need this cock, baby. Pregnant or not, I'm yours anytime, anywhere!",

"Ohhh, god, yes, fuck your baby mama just like that... Make sure I know exactly who owns this pussy. ♥",

"Mmm, the deeper you go, the harder the baby kicks. You’re driving us both wild—don’t you dare pull out!",

"Ahhh! I'm leaking everywhere already… pregnant tits, swollen pussy, all dripping because of you. ♥",

"Yes! Stretch me out, baby—fuck me until this pregnant belly shakes, let everyone know how deeply loved I am.",

"Fuck… I can feel every pulse of your cock inside me… you're marking me so deep… our child feeling exactly how desperate you’ve made their mommy. ♥",

"Mmmm, I hope you never get tired of fucking me pregnant. Because I could do this—oh fuck—every day!",

"Yes, yes—goddammit, I’m cumming! Fucking cumming around your cock with your baby inside me... ahhh fuck! ♥",  

"Mmm, kiss me harder while you fuck me senseless… I wanna taste how much you love making me yours.",

"Oh, god, your cock hits me so good… every thrust reminds me exactly why I let you breed me. ♥",

"Fuck me until I can't walk, until everyone in this vault knows exactly why I broke the rules for you! ♥",

"Oh, baby, cum inside me… fill me up again, remind me how perfectly your seed belongs right here.",

"Ahhh, yes! I'm your slut, your lover, your pregnant fuck-toy… never stop fucking me! ♥", 

"Keep going, please… breed me again and again, baby… I'll carry your babies forever if this is what I get. ♥",

"Oh, god… mmm… my pussy throbs every time you touch my belly, reminding me exactly why I'm yours…",

"Fuck… yes… deeper, harder… I want to feel your cum dripping down my thighs when we walk out of here… ♥",

"Ahhh… I love you so damn much… fuck me, breed me, love me forever, because I’m yours… completely yours. ♥",

"Fuck, you're amazing… filling me with everything you've got… please, drown me, make me overflow… ♥"]
            }
              ]
            }
          ]
        },
        {
          "optionText": "Damn, you’re really showing now...",
          "responseText": "I know, right? It feels like I’ve got a whole vault pod in there. And somehow, it’s still kind of beautiful. Weird, huh?",
          "followUpOptions":[ 
            {
              "optionText": "You're still the hottest thing in this vault.",
              "responseText": "You’re sweet. Either that, or you're trying to distract me from the fact that I can’t bend over without swearing."
            },
            {
              "optionText": "That suit is losing the fight...",
              "responseText": "Tell me about it. Every stretch feels like it's holding on for dear life. And my tits are staging a full-blown rebellion."
            }
          ]
        }
      ]
    },
    {
      "optionText": "You need anything? Water? Back rub? Morale boost?",
      "dontDisplayIfHasObjective": "Bring Diana fish.",
      "dontDisplayIfObjectiveComplete": "Bring Diana fish.",
      "icon": "GUI/quest mark",
      "responseText": "Honestly? I want something salty. Like fish. Real fish. Not nutrient bars or whatever the vault thinks counts as protein. I want to taste it. I want it greasy, hot, and falling apart in my hands. But of course... the vault doesn't have it.",
      "followUpOptions": [
        {
          "optionText": "I’ll get it for you. Even if I have to fish it out of the damn wasteland river myself.",
          "icon": "GUI/quest mark",
          "responseText": "You’d really do that for me, honey? Go out there just to bring me a fish? ...God, I love you. I love you. Just come back to me in one piece. Please.",
          "addObjective": "Bring Diana fish.",
          "exitLine": true
        },
        {
          "optionText": "Sorry, no fish in the vault menu. You're stuck with beans and vague meat cubes.",
          "responseText": "Ugh. Don’t joke right now. My hormones will either make me cry or murder you. Possibly both.",
          "exitLine": true
        }
      ]
    }, 
    {
        "optionText": "[Give a Gift]",
        "emotion": "none",
        "icon": "GUI/gift icon",
        "neverGreyOut": true,
        "isGifting": true
    },    
    {
      "optionText": "Bye",
      "responseText": "Okay. Just... don’t be gone too long. I feel safer when you’re around.",
      "exitLine": true
    }
  ]
}  