{
  "options": [
    {
      "optionText": "[Denunciá-la para a Polícia da Pureza]",
      "responseTexts": [
        "Vá em frente, dedo-duro. Só não se esqueça de dizer a eles quanto tempo você ficou aí assistindo antes de decidir dedurar. Com certeza mencionarei como você não conseguia tirar os olhos de mim.",
        "Que p--?! Seu dedo-duro! Vá em frente, me denuncie, mas não finja que não estava pensando em participar. Só lembre-se: dedos-duros não ganham... nada. E quero dizer nada mesmo."
      ],
      "exitLine": true,
      "fadeOutCharacter": true,
      "specialEffects": ["removeBlur", "removeVignette"],
      "reported": 5
    },
    {
      "optionText": "[Assistir]",
      "icon": "GUI/eye icon",
      "specialEffects": ["removeBlur", "removeVignette"],
      "spriteAtTheEndOfHscene": "Characters/Diana/in cum/sitting on the table in cum",
      "spriteAtTheEndOfHscenePosition": [2.69, -3.43],
      "closeDialogueOptions": true,
      "isHEventStarted": true,
      "interactableBGcolor": "#222222",
      "addGripGaugePoints": 350,
      "interactable": "Characters/Diana/Interactables/sex double dick",
      "hEventName": "diana_group_sex_in_diner",
      "endingEffects": ["Flashes"],
      "lineAfterHevent": "Ahh... foi incrível... ♥︎",
      "auto_lines": [
        "Mmm, ohhh, olhem todos esses paus só para mim—♥︎",
        "Vocês já estão tão duros, mmm, eu adoro—♥︎",
        "Ahh... p-pau duro... tanto pau... Sou apenas uma vadia inútil, me engravidem... me quebrem... fodam meu cérebro para fora...♥",
        "Ahhh, porra, tantos paus, eu nem sei para onde olhar—♥︎",
        "Por favor... meus buracos doem... caramba, e-estou viciada... não consigo ficar cinco minutos sem—me encham, me usem, por favor não me deixem vazia...",
        "Nnn, ohhh, sinto que sou a putinha pessoal do refúgio—♥︎",
        "Porra... s-só me engasgue com ele... Sou sua cadela de reprodução pessoal... me arruíne, m-me faça gozar de novo... eu imploro—eu imploro o dia todo pelo seu pau...",
        "Mmm, aposto que vocês, seus putos, sonharam com isso, não foi?—♥︎",
        "N-nenhum pensamento sobrando... apenas p-pau... preciso de mais... agora...",
        "Ahhh, porra, quero cada pau nesta sala doendo por mim—♥︎",
        "N-não consigo parar de tremer... só... preciso de porra dentro de mim... uhh, p-porra...",
        "Mmm, ohhh, eu sei que sou uma vadia do caralho, eu amo isso pra caralho—♥︎",
        "Não me deixe vazia... por favor, enfia... agora...",
        "Ahhh, ohhh, todos esses paus, toda essa atenção—mmm, porra—♥︎",
        "E-eu não consigo... respirar... sem paus... dentro...",
        "Ahhh, porra, se o Supervisor visse isso, ele surtaria—♥︎",
        "G-goteje sua porra em mim... preciso dela vazando... sempre...",
        "Ahh, não pare! Eu desejei isso por semanas... oh deus!",
        "Sinto como se estivesse pingando a cada estocada... hnnng, você vai me fazer explodir!",
        "Mmm, seu pau está atingindo todos os pontos certos... ♥ Continue!",
        "Ohhh, consigo sentir os sucos escorrendo pelas minhas coxas... mais, mais!",
        "Porra, eu não estive tão cheia em anos... não se atreva a parar!",
        "Mmm, você vai me fazer gozar em todo o seu pau... hnnng!",
        "Ahh, mais fundo, quero sentir cada centímetro desses paus... ♥",
        "Você me deixou encharcada... não consigo ter o suficiente disso!",
        "Oh porra, estou tão perto... só mais um pouco...!",
        "Mmm, cada vez que você estoca, eu sinto fundo na minha buceta... não pare agora!",
        "Hnnng, seus paus estão me enlouquecendo... vou perder o controle!",
        "Ahhh, você está atingindo todos os pontos certos... porra, estou gozando!",
        "Mmm, consigo sentir seus paus pulsando... você vai me encher de porra?",
        "Ohhh, porra, você está me fazendo gozar tanto... ♥",
        "Ahh, eu amo o jeito que você me alarga... me dê mais!",
        "Mmm, vou espremer cada gota de porra de você... ♥",
        "Oh porra, você está me deixando tão molhada... não consigo mais segurar!",
        "Mmm, quero sentir cada gota da sua porra dentro de mim... não pare até eu estar transbordando!",
        "Ahh, sim, bem aí! Não pare, oh deus, consigo sentir cada centímetro de você—tão fundo... ♥",
        "Mmm, seus paus estão tão duros, está me enlouquecendo... hnnng, estou tão perto, não se atreva a parar agora!",
        "Oh porra, você está me enchendo tão perfeitamente... consigo sentir seus paus me alargando, ahhh, sim!",
        "Hahhh, estou pingando, consegue sentir como estou molhada? Oh deus, está escorrendo pelas minhas coxas... ♥",
        "Mmm, seus paus pulsando tanto, mal posso esperar para sentir sua porra jorrando fundo dentro de mim... hnngh, sim!",
        "Ahhh, mais forte! Me foda mais forte! Quero sentir você me batendo até eu não conseguir pensar direito... ♥",
        "Hnnngh, estou tão perto! Ahhh, não consigo mais segurar... vou gozar!",
        "Mmm, seus paus estão tão fundos em mim... consigo sentir sua porra me enchendo, ohh, porra, estou gozando!"
      ]
    }
  ],
  "auto_lines": [
    "Mmm, ohhh, olhem todos esses paus só para mim—♥︎",
    "Vocês já estão tão duros, mmm, eu adoro—♥︎"
  ],
  "hEventStarted": "sex_with_buster",
  "showShadowFigures": "Diana's audience 3"
}
