{
  "options": [
    {
      "optionText": "Ela é linda. Vocês duas.",
      "responseText": "Seu bobão. Se continuar dizendo coisas assim, vai me amolecer. Sério, eu te amo.",
      "followUpOptions": [
        {
          "optionText": "Posso segurar nosso bebê?",
          "responseText": "Claro. Cuidado agora—eles são pequenininhos. Ver você segurando nosso filho… é o suficiente para me derreter de novo."
        },
        {
          "optionText": "Como você está se sentindo, amor?",
          "responseText": "Cansada pra caralho, mas estranhamente… feliz. Segurar nosso bebê, ver o rostinho deles—nunca imaginei sentir tanto amor."
        },
        {
          "optionText": "Ser pai é tão assustador quanto dizem?",
          "responseText": "Mais assustador, mas também é melhor. Apenas prometa que vai ficar por perto—acho que podemos lidar com qualquer coisa juntos."
        },
        {
          "optionText": "Não percebi o quão emocionante isso seria.",
          "responseText": "Né? De repente, tudo é diferente. E eu não trocaria esses sentimentos por nada."
        },
        {
          "optionText": "Você vai ser uma mãe incrível.",
          "responseText": "Você está me matando de gentileza, amor. Sinceramente, estou apavorada, mas ouvir você dizer isso torna tudo mais fácil."
        }
      ]
    },
    {
      "optionText": "Prometo que sempre protegerei vocês dois.",
      "responseText": "Eu acredito em você. E é por isso que te seguirei até o fim deste maldito refúgio e além."
    },
    {
      "optionText": "Eu te amo mais do que nunca.",
      "responseText": "Agora você só está tentando me fazer chorar. Eu também te amo, seu teimoso e incrível pé no saco."
    },
    {
      "optionText": "Vou te deixar descansar. Me chame se precisar de algo.",
      "responseText": "Não vá muito longe. Já estamos com saudades.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Ei, venha conhecer seu bebê. Olhe para nós—oficialmente uma família agora."
  ]
}
