{
  "options": [
    {
      "optionText": "Ei, Diana, eu uh... preciso de um favor.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Get Diana's Panties for Jass",
      "dontShowIfProgressionEventPlayed": "diana_panties_received",
      "responseText": "Mmm, um favor, hein? Isso soa perigoso vindo de você. O que é? Desembucha antes que eu fique entediada.",
      "followUpOptions": [
        {
          "optionText": "Estou, uh, coletando algo para um... experimento do refúgio. Sabe, coisas de ciência. Posso pegar sua... um... calcinha?",
          "responseText": "Ah, calcinha? Bem, eu adoro um homem da pesquisa... mas não. Se alguém vai fazer experimentos com minha calcinha, serei eu. Boa tentativa, no entanto.",
          "followUpOptions": [
            {
              "optionText": "Sabe, estou apenas pedindo por... um pedaço de tecido. Nada muito estranho, certo?",
              "responseText": "Um pedaço de tecido? Querido, essa é a forma mais indireta que já ouvi alguém pedir minha roupa íntima. O que vem a seguir, quer pegar meu sutiã emprestado também?"
            },
            {
              "optionText": "É para um, uh... amigo. Eles me desafiaram. Posso, por favor, pegar um par?",
              "responseText": "Olha, não sei que tipo de aposta você perdeu, mas de jeito nenhum vou entregar minha calcinha só para salvar sua bunda."
            },
            {
              "optionText": "Ok, tudo bem, você me pegou. Alguém no refúgio... uh, me pediu para pegá-las. Não pergunte por quê.",
              "responseText": "Ahh, então você é o novo garoto de entregas para pervertidos do refúgio, hein? Fofo. Bem, pode voltar e dizer a eles que se quiserem minha calcinha, terão que fazer mais do que enviar um intermediário. Tipo, não sei, talvez desenvolver algum autorrespeito.",
              "followUpOptions": [
                {
                  "optionText": "Imaginei que você diria não. Tinha que tentar, né?",
                  "responseText": "Oh, fico feliz que tentou. Mas, querido, eu não distribuo minhas calcinhas como macacões do refúgio. Continue sonhando."
                },
                {
                  "optionText": "Vamos, Diana, você me conhece. Passamos por poucas e boas. Apenas me ajude?",
                  "relationshipRequired": 35,
                  "giveItem": "Diana's Panties",
                  "progressionEventPlayed": "diana_panties_received",
                  "exitLine": true,
                  "dontDisplayIfObjectiveComplete": "Get Diana's Panties for Jass",
                  "failedCheckResponse": "Uau, que jogada ousada. Talvez comece com, tipo, um manual da Vault-Tec sobre 'Interação Humana Básica' antes de ir direto para as coisas estranhas. Boa tentativa, no entanto. Pontos pelo... entusiasmo?",
                  "responseText": "*Risos* Oh, tudo bem. Acho que você mereceu depois de todo esse tempo. Quer que eu me dispa aqui mesmo? Certo. Aproveite o show, querido. ♥︎"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "[Entregar Lingerie]",
      "icon": "GUI/quest mark",
      "responseText": "Oh, meu... eu sabia que você tinha bom gosto, mas isso? Querido, você se superou! São fabulosas! Obrigada!",
      "onlyDisplayIfHasObjective": "Get lingerie for Diana",
      "giveItemToCharacter": "Red Lingerie",
      "itemRequired": "Red Lingerie",
      "relationshipPoints": 15,
      "markObjectiveComplete": "Get lingerie for Diana",
      "exitLine": true
    },
    {
      "optionText": "[Entregar Dildo]",
      "icon": "GUI/quest mark",
      "responseText": "Oh, meu... você realmente sabe como satisfazer os desejos de uma garota. Esperei o dia todo para alguém me entregar um... dildo grande e firme. Obrigada.",
      "onlyDisplayIfHasObjective": "Get dildo for Diana",
      "giveItemToCharacter": "Monster Dildo",
      "itemRequired": "Monster Dildo",
      "relationshipPoints": 20,
      "markObjectiveComplete": "Get dildo for Diana",
      "exitLine": true
    },
    {
      "optionText": "Você viu o que está acontecendo? O refúgio virou uma orgia completa!",
      "gripGaugeRequired": 5000,
      "hideOptionIfReqCheckFailed": true,
      "responseText": "Ah, você quer dizer o 'Sirirocalipse'? Sim, eu notei. Tive um lugar na primeira fila para a orgia no Restaurante. Um cara usou uma pilha de purê de batatas como lubrificante. Realmente comove.",
      "followUpOptions": [
        {
          "optionText": "Eu talvez, uh… tenha tido algo a ver com isso. Eu meio que ajudei o Líder da Resistência da Masturbação… sabe, a distribuir algum, uh, material de masturbação.",
          "responseText": "Então é por isso que encontrei uma assinatura para todo o refúgio de ‘Bumbuns Pré-Guerra Mensal’ debaixo da minha porta. Eu deveria saber que você estava envolvido. Você sozinho transformou este lugar de um convento em um estúdio de cinema adulto."
        },
        {
          "optionText": "Então… você está de boa com todo esse caos?",
          "responseText": "De boa com isso? Por favor. Eu esperei por este dia desde que me deram meu primeiro panfleto de castidade do refúgio. Ver a Polícia da Pureza se atrapalhar enquanto as pessoas estão literalmente se masturbando nos corredores? Esse é o tipo de justiça poética pela qual eu vivo."
        }
      ]
    },
    {
      "optionText": "O que você está bebendo aí?",
      "responseText": "Ah, isto? Apenas uma mistura de café e as lágrimas de pessoas que se esforçam demais. Pensei que você talvez quisesse um gole, já que se encaixa tão bem no perfil. Brincadeirinha.",
      "followUpOptions": [
        {
          "optionText": "Você bebe lágrimas? Isso é radical.",
          "responseText": "Quando você já viu tanta idiotice como eu, lágrimas são basicamente um suplemento vitamínico. Me impede de perder células cerebrais por proximidade."
        },
        {
          "optionText": "Vou ficar com água, obrigado.",
          "responseText": "Água? Uau, vivendo perigosamente, vejo."
        }
      ]
    },
    {
      "optionText": "Como vai seu dia?",
      "responseText": "Um desfile de incompetência, como sempre. Mas consegui aproveitar esta desculpa morna para café, então já é alguma coisa, eu acho.",
      "followUpOptions": [
        {
          "optionText": "Se importa se eu me juntar a você? [Terminar o Dia]",
          "isHangingOutWithDiana": true,
          "relationshipPoints": 2,
          "responseText": "Só se você planeja ficar aí sentado em silêncio.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Então, o que você acha da comida daqui?",
      "responseText": "Ah, você quer dizer a lama sem sabor que eles têm a coragem de chamar de 'nutricionalmente balanceada'? É como se alguém tentasse tornar a depressão comestível e de alguma forma conseguisse.",
      "followUpOptions": [
        {
          "optionText": "Mas é saudável, certo?",
          "responseText": "Claro, se sua definição de ‘saudável’ inclui desejar lentamente a morte a cada mordida. Sinceramente, acho que obteria mais nutrientes lambendo o chão do refeitório.",
          "followUpOptions": [
            {
              "optionText": "Oh, eu assistiria isso.",
              "responseText": "Uau, desesperado, hein? Se me ver lamber o chão é o que te excita, você não tem mais salvação."
            },
            {
              "optionText": "Vamos lá, aposto que você ficaria ótima fazendo isso.",
              "responseText": "Oh, é com isso que você fantasia à noite? Eu, curvada, lambendo o chão como uma garota pin-up pré-guerra? Se controla. Não faço trabalho de caridade, especialmente para caras que estão a um passo de lamber o chão eles mesmos."
            },
            {
              "optionText": "Você deve ter coisas melhores para lamber por aqui.",
              "responseText": "Oh, eu tenho, mas confie em mim—você nunca chegaria perto o suficiente para descobrir. Além disso, você provavelmente gozaria no segundo em que eu abrisse o zíper deste macacão, e não estou aqui para limpar sua bagunça."
            }
          ]
        },
        {
          "optionText": "Qual foi a melhor coisa que você já comeu, então?",
          "responseText": "Antes desta prisão? Comi um bife uma vez—perfeitamente cozido, temperado como se tivesse sido feito pelos deuses."
        },
        {
          "optionText": "Vamos lá, não é *tão* ruim, certo?",
          "responseText": "Não é tão ruim? É *tão* ruim que deveriam rotular como ‘Apenas para Uso Externo’."
        }
      ]
    },
    {
      "optionText": "[Dar um Presente]",
      "icon": "GUI/gift icon",
      "neverGreyOut": true,
      "isGifting": true
    },
    {
      "optionText": "Tchau",
      "responseText": "Não deixe a porta do refúgio te acertar na saída.",
      "exitLine": true
    }
  ]
}
