{
    "options": [
        {
            "optionText": "Uh, you know one of your nipples is showing, right?",
            "responseText": "Oh, that old thing? Guess it just wanted some fresh air. Chill out, it’s not like we’re breaking any of the big rules here—unless you want to go snitch to the Purity Police. They could use a little excitement, even if it's over a rogue nipple.",
            "followUpOptions": [
                {
                    "optionText": "Are you crazy? If someone sees, you’re screwed.",
                    "responseText": "Relax, prude. The only ones who would notice are too busy staring at their own navels, trying to repress their unholy thoughts. But sure, if you wanna run to Mommy Overseer, be my guest." 
                }
            ]
        },
        {
            "optionText": "Uh, you know one of your nipples is showing, right?",
            "responseText": "Oh, really? I guess my body is just crying out for freedom. But don’t get too excited—it’s more action than this vault has seen in years. If the Purity Police catch you staring, you’ll get a front-row seat in the Shame Chamber.",
            "followUpOptions": [
                {
                    "optionText": "You know this could get you in serious trouble, right?",
                    "responseText": "Trouble? If a little nip slip is what finally sends the Purity Police over the edge, maybe we’re all better off watching the fallout.",
                    "followUpOptions": [
                        {
                            "optionText": "I don’t care. I’m reporting you to the Overseer.",
                            "responseText": "Go ahead, be Vault 6969’s resident lounge monitor. Just remember, the Purity Police are probably more aroused by your dedication to the rules than by a bit of skin. Maybe you’ll end up in the Shame Chamber right next to me.",
                            "report": true
                        },
                        {
                            "optionText": "No way I’m reporting you. The Purity Police can’t keep everyone on a leash forever.",
                            "responseText": "Now that’s the spirit! Let’s see if we can push the envelope a little. Who knows, maybe you’ll even start a revolution. Or at least make the next assembly slightly less mind-numbing."
                        }
                    ]
                }
            ]
        },
        {
            "optionText": "So, what do you think about this purity assembly?",
            "responseText": "Oh, you mean this weekly reminder that we live in a post-apocalyptic nunnery? Yeah, I look forward to it like a radroach looks forward to pest control."
        },
        {
            "optionText": "[Gift]",
            "isGifting": true
        },
        {
            "optionText": "Bye.",
            "responseTexts": ["Leaving already? Guess I’ll just have to find another audience for my accidental rebellion.", "See you around, saint. Don’t let the purity propaganda mess with your head too much.", "Leaving so soon? Guess I’ll just have to keep the other nipple covered for now."],
            "exitLine": true
        }
    ]
}