{
    "options": [
    {
        "optionText": "[Report her to the Purity Police]",
        "responseTexts": ["Go ahead, snitch. Just make sure to tell them how long you stood there watching before you decided to tattle. I’ll be sure to mention how you couldn’t keep your eyes off me.", "What the f--?! You little snitch! Go ahead, report me, but don’t act like you weren’t thinking of joining in. Just remember: snitches get... nothing. And I do mean nothing."],
        "exitLine": true,
        "changeSprite": "Characters/Diana/Resized/angry",
        "newSpriteXPos": 0.4,
        "newSpriteYPos": -0.28,  
        "specialEffects": ["removeBlur", "removeVignette"],
        "progressionEventPlayed": "reporting_diana_for_masturbating_in_her_room",
        "showChoiceStats": "reporting_diana_for_masturbating_in_her_room",
        "reported": 5
    },
    {
        "optionText": "[Watch secretly]",
        "specialEffects": ["removeBlur", "removeVignette"],
        "exitLine": true,
        "icon": "GUI/eye icon",
        "isHEventStarted": true,
        "closeDialogueOptions": true,
        "spriteAtTheEndOfHscene": "Characters/Diana/new NSFW/sitting no panties",
        "interactable": "Characters/Diana/Interactables/diana masturbation", 
        "interactableBGcolor": "#989898",
        "hEventName": "diana_solo_her_room",
        "progressionEventPlayed": "watching_diana_masturbating_in_her_room",
        "showChoiceStats": "watching_diana_masturbating_in_her_room2",
        "spriteAtTheEndOfHscenePosition": [ 0.59, -0.59 ],
        "lineAfterHevent": "Ahh... it was amazing... ♥︎",
        "auto_lines": ["Hmmm... just a little more... right there... mmm, yeah...", 
    "Ahh... gotta make it quick... don’t want those Purity Police knocking... ahh...", 
    "Oh, yeah... right there... this is what I need... ahh... who cares about their stupid rules...",  
    "Hmmm... just a little more... damn, this vault can’t hold me back... ahh...", 
    "Mm, yeah, fuck purity... This is what it’s all about. Just me and my pussy... ♥", 
    "Ahh... take that, Overseer... if only you knew what was going on in here... hmmm...", 
    "Hmmm... what would the Overseer say if he caught me? ‘Diana, you’re breaking the rules’... yeah, right... ahh...", 
    "Hmmm... just a bit more... then maybe I’ll have the energy to deal with these idiots... ahh...", 
    "Oh, yes... mmm... just thinking about what I’m gonna do when I get out of here... ♥", 
    "Oh, yeah... that’s it... so close... ahh... just a bit more...", 
    "Ahh... there it is... finally... that’s the spot... mmm... ♥", 
    "Almost there... God, I’m gonna soak the bed...", 
    "Mmm, my pussy’s so hungry for this... wish I could find someone to fill me up...", 
    "Ohh, yes... right there, right there... so wet, can’t stop now...", 
    "Ahh, yeah... fingers deep in my pussy, feels so good...", 
    "Fuck, yes... been too long... juices running down my thighs, just the way I like it...", 
    "Ahh... so close... mmm... just need to... hmmm... yes...",  
    "Yes, yes... keep going... fingers working that clit... God, I’m so wet...", 
    "Mmm, wish I could find someone with a real dick, but this’ll have to do...", 
    "Ugh, so close... fuck, I’m gonna scream when I cum, I don’t care who hears...", 
    "Gonna cum, gonna cum... right here in this stupid vault, and there’s nothing they can do to stop me...",  
    "Ahh, fuck, so close... gonna cum, gonna cum, can’t stop now...", 
    "Yes, yes, yes... oh, fuck, it’s coming... gonna cum so hard...", 
    "Almost there... oh God, yes... here it comes, gonna soak these sheets... cumming... ahhhh ♥♥♥..." ],
    "endingEffects": ["Flashes"]
    }
    ],
    "auto_lines": ["Ohh, yes... right there, right there... so wet, can’t stop now...", 
    "Ahh, yeah... fingers deep in my pussy, feels so good..." ],  
    "hEventStarted": "fapping1"
}
