{
  "options": [
    {
      "optionText": "Preciso de uma bebida. Assistir aquilo foi demais.",
      "responseText": "Uma bebida? Querido, depois daquela performance, você vai precisar de um *banho frio* e uma oração.",
      "followUpOptions": [
        {
          "optionText": "Este lugar tem mais tensão que uma convenção de pin-ups pré-guerra.",
          "responseText": "Tensão? Ha! Deixe que explodam. Não estou aqui para ser babá dos hormônios deles.",
          "followUpOptions": [
            {
              "optionText": "Se você continuar, este refúgio vai virar uma zona de desastre *nuclear*.",
              "responseText": "Acho que vamos chamar de Big Bang 2.0. Primeiro, o refúgio implode, depois *eu* explodo. É uma vitória dupla, querido."
            },
            {
              "optionText": "Você vai enlouquecer as pessoas. Um cara acabou de desmaiar no purê de batatas.",
              "responseText": "Coitado, provavelmente não se toca há anos..."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Você acabou de bater uma na frente de *todo mundo*?",
      "responseText": "Oh, docinho, do jeito que aqueles garotos estavam olhando, eu estava fazendo um favor a eles. Não podemos deixá-los voltar para os beliches com *saco azul*, podemos?",
      "followUpOptions": [
        {
          "optionText": "Essa é uma maneira de conseguir uma plateia.",
          "responseText": "Plateia? Querido, aquilo foi uma *ovação de pé*. Inferno, se eles pudessem se mover, teriam aplaudido com mais do que apenas as mãos."
        }
      ]
    },
    {
      "optionText": "[Denunciá-la para a Polícia da Pureza]",
      "responseTexts": [
        "Vá em frente, dedo-duro. Só não se esqueça de dizer a eles quanto tempo você ficou aí assistindo antes de decidir dedurar. Com certeza mencionarei como você não conseguia tirar os olhos de mim.",
        "Que p--?! Seu dedo-duro! Vá em frente, me denuncie, mas não finja que não estava pensando em participar. Só lembre-se: dedos-duros não ganham... nada. E quero dizer nada mesmo."
      ],
      "exitLine": true,
      "reported": 5,
      "fadeOutCharacter": true
    },
    {
      "optionText": "Tchau",
      "responseText": "Oh, já vai? Só tome cuidado para não tropeçar na sua... 'situação' na saída.",
      "exitLine": true
    }
  ]
}
