{
  "options": [
    {
      "optionText": "[Denunciá-la para a Polícia da Pureza]",
      "responseTexts": [
        "Vá em frente, dedo-duro. Só não se esqueça de dizer a eles quanto tempo você ficou aí assistindo antes de decidir dedurar. Com certeza mencionarei como você não conseguia tirar os olhos de mim.",
        "Que p--?! Seu dedo-duro! Vá em frente, me denuncie, mas não finja que não estava pensando em participar. Só lembre-se: dedos-duros não ganham... nada. E quero dizer nada mesmo."
      ],
      "exitLine": true,
      "specialEffects": ["removeBlur", "removeVignette"],
      "reported": 5
    },
    {
      "optionText": "[Assistir]",
      "specialEffects": ["removeBlur", "removeVignette"],
      "spriteAtTheEndOfHscene": "Characters/Diana/Resized/sitting naked",
      "spriteAtTheEndOfHscenePosition": [-6, -0.6],
      "closeDialogueOptions": true,
      "addGripGaugePoints": 500,
      "icon": "GUI/eye icon",
      "isHEventStarted": true,
      "HideAllShadowFiguresAfterHevent": true,
      "endingEffects": ["Flashes"],
      "hEventName": "diana_diner_fapping",
      "emotionsDuringHevent": [
        "none",
        "Characters/Diana/Emotions/fapping2/1",
        "Characters/Diana/Emotions/fapping2/2",
        "Characters/Diana/Emotions/fapping2/3",
        "Characters/Diana/Emotions/fapping2/4"
      ],
      "lineAfterHevent": "Ahh... foi incrível... ♥︎",
      "auto_lines": [
        "Ahhh, vocês, garotos, estão gostando do show? Não finjam que não estavam esperando por isso.",
        "Mmm, continuem olhando, e vou precisar de um rodo para esta mesa... ahh ♥.",
        "Oh deus, bem aí, sim... sim...! ♥",
        "Ahhh, não sejam tímidos... era isso que vocês queriam, não era? ♥",
        "Oooh, aposto que todos vocês estão pensando a mesma coisa… quão rápido me encheriam. Mmm, tão safados ♥.",
        "Eu estive tão reprimida... tão molhada... eu preciso disso...!",
        "Consigo ver vocês olhando para minha buceta… não se preocupem, garotos, está ainda mais molhada que a boca de vocês agora ♥.",
        "Olhem para vocês, todos olhando... ♥",
        "Ohhh, siim... esse é o ponto... oh, estou tão perto... ♥",
        "Ahh, estou praticamente pingando só de pensar em todos vocês… mas qual de vocês vai limpar? ♥",
        "Aposto que adorariam ajudar, não é? Pena... ahhh...",
        "Mmm, vocês só podem assistir... fiquem aí babando, garotos.",
        "Oooh, eu adoro o jeito que vocês estão babando… mmm, me dá vontade de cavalgar esta mesa até quebrar ♥.",
        "Deus, isso é tão bom... tão molhado...!",
        "Ahhh, não finjam que não estão gostando... seus paus não podem mentir ♥",
        "Eu poderia gozar só pelo jeito que vocês estão me olhando, mmm… talvez eu goze. Ahh ♥.",
        "Mmm, esta mesa está tão fria... mas eu estou tão... tão quente agora... ♥",
        "Eu sei que vocês querem mais, mas... pena que não podem.",
        "Sinto seus olhos em mim, ahh, e isso está me excitando tanto que talvez eu deixe vocês provarem o quão molhada estou mmm ♥.",
        "Ahh, continuem assistindo, talvez eu dê uma pequena... recompensa.",
        "Tão molhada... tão pronta... mmm...!",
        "Mmm, estou tão molhada que poderia escorregar desta mesa… ahh, mas aposto que me pegariam com algo duro, não é? ♥",
        "Vocês amam isso, não amam? Todos vocês... consigo ver o jeito que estão me olhando.",
        "Ahhh... é tão bom... quase lá... quase...!",
        "Vocês não podem tocar, garotos... mas podem assistir o quanto quiserem... ♥",
        "Ohh, eu adoro quando vocês me veem brincar com minha buceta… mmm, mas eu preferiria brincar com outra coisa. Ahh, quem é o primeiro? ♥",
        "Ohhh, bem aí... sim... ohhh... ahhh!",
        "Mmm, estou tão perto... só... mais um pouco...!",
        "Mmm, vocês todos parecem tão famintos… pena que este não é o tipo de refeição que posso servir, mas estou aberta a sugestões ♥.",
        "Ahhh, isso é muito melhor do que eu imaginei... ♥",

        "Os sucos desta buceta são doces, mas aposto que sua porra seria mais doce mmm, quer provar que estou errada? ♥",
        "Tão molhada... tão perto... ohhh... sim!",
        "Eu poderia ficar sentada aqui e deixar vocês olharem para minha buceta o dia todo, mmm… Ahh ♥.",
        "Vocês são todos uns pervertidos... mas eu amo o jeito que estão me assistindo.",
        "Ahhh, bem aí... quase... ahh, siim!",
        "Oooh, consigo ver que todos vocês têm pequenas surpresas duras para mim… mmm ♥",
        "Eu sou a única coisa em que vocês vão pensar esta noite, não sou? ♥",
        "Estou tão molhada agora, ahh… você precisaria de uma toalha depois de um único toque, mmm ♥.",
        "Mmm, deus, estou tão molhada agora... ♥ Vocês vão ficar aí parados? ♥",
        "Ahh... ohhh sim, bem aí... vocês gostam disso, hein? ♥",
        "Não finjam que não estão amando isso. Olhem para vocês! Seus paus estão tão duros ♥",
        "Mmm, vocês estão me deixando tão quente… ahh, talvez eu deixe vocês gozarem em mim ♥.",
        "Mmm, vocês nunca chegarão tão perto de mim de novo! Então, aproveitem a vista, pervertidos! ♥",
        "Vocês todos tão duros por mim mmm ♥.",
        "Ahhh, deus, estou tão perto... ohhh sim... ♥",
        "Estou tão molhada que poderia regar todo o jardim do refúgio com isso... ohhh, porra! ♥",
        "Ahh, estou tão perto… talvez eu devesse deixar vocês me finalizarem aqui mesmo, mmm, o que acham? ♥",
        "Vou gozar tanto, e vocês vão ficar aí desejando que fossem vocês... ohhh, porra, sim! ♥",
        "Ahhh, vou gozar em toda esta mesa, e vocês vão ter que limpar! ♥",
        "Oooh, estou pingando pelas coxas, mmm, vocês vão me ajudar a limpar ou vão continuar olhando? ♥",
        "Mmm, oh, isso é tão bom... ♥ Vocês gostam do que veem? Aposto que sim! ♥",
        "Ahhh, não sejam tímidos... sei que estavam morrendo de vontade de me ver assim!",
        "Aposto que adorariam provar o quão molhada estou agora, mmm, eu adoraria sentir sua língua aí também ahhh ♥.",
        "Ohhh, está tão molhado... ♥ Vamos, não ajam como inocentes agora!",
        "Aposto que estavam sonhando com isso, não é? Mmm, olhem só para suas caras!",
        "Mmm, consigo sentir a tensão no ar… ou são só suas bolas se esforçando para segurar a porra? Ahh ♥.",
        "Ahhh, estou dando um verdadeiro show esta noite, garotos! ♥",
        "Mmm, vejo esses rubores. Tão fofos! Não sabia que os garotos do refúgio podiam ficar tão vermelhos!",
        "Se um de vocês me tocasse agora, ahh, eu provavelmente explodiria em todo este restaurante… mmm, vamos lá, quem é corajoso o suficiente? ♥",
        "Ohhh, sim! Esta mesa está um pouco fria, mas eu definitivamente não estou! ♥",
        "Ahhh, porra, isso é tão bom... nenhum de vocês nunca viu algo assim antes, hein? ♥",
        "Mmm, consigo ouvir todos vocês engolindo em seco... tão adorável!",
        "Ohhh, estou tão perto... ♥ Aposto que todos vocês adorariam estar mais perto, também!",
        "Não finjam que não estão gostando! Vejo esses olhos famintos!",
        "Mmm, tão molhada, tão pronta... ♥ Pena que vocês só podem assistir!",
        "Aposto que gostariam de se juntar a mim aqui em cima, hein? Talvez da próxima vez, se tiverem sorte!",
        "Ahhh, estou quase lá... vocês estão tornando isso muito fácil para mim!",
        "Mmm, vocês estão todos sentados aí... como se eu fosse a única coisa neste restaurante que vale a pena prestar atenção!",
        "Ohhh, siim... vamos, não desviem o olhar agora! ♥",
        "Vocês sabem que vão pensar nisso por dias... admitam!",
        "Mmm, estou tão molhada que até esta mesa está começando a sentir… ahhh, vocês querem sentir também? ♥",
        "Ahhh, deus, estou tão perto... ♥ Acho que estou enlouquecendo vocês!",
        "Mmm, nunca tive uma plateia tão cativada! Vocês são tão doces!",
        "Ohhh, isso é melhor que qualquer coisa no menu! ♥",
        "Ahhh, estou quase lá... ♥ Vocês estão amando isso tanto quanto eu?",
        "Mmm, se não fossem tão tímidos, talvez pudessem me ajudar a terminar!",
        "Mmm, estou tão perto… ahhh, é melhor um de vocês me ajudar a terminar ou vou fazer uma bagunça aqui mesmo ♥.",
        "Ohhh, deus, bem aí... siim! ♥",
        "Imaginem se pudessem colocar esse pau bem aqui... está tão quente, tão molhado… ♥",
        "Consigo ver todos vocês pensando a mesma coisa, mmm… querem me encher tanto, ahhh, não querem? ♥",
        "Vocês estão tão quietos! Não se preocupem, podem torcer por mim se quiserem! ♥",

        "Ahhh, vocês estão todos me olhando como se eu fosse a sobremesa! Talvez eu seja!",
        "Ohhh, deus, sim... vocês foram todos uns bons observadores! ♥",
        "Sim, sim, sim... oh, porra, está vindo... vou gozar tanto...",
        "Porra, porra, PORRA... gozando, oh Deus, gozando... ahhhh ♥♥♥..."
      ]
    }
  ],
  "auto_lines": [
    "Sinto seus olhos em mim, ahh, e isso está me excitando tanto que talvez eu deixe vocês provarem o quão molhada estou mmm ♥.",
    "Tão molhada... tão pronta... mmm...!"
  ],
  "showShadowFigures": "Diana's audience",
  "hEventStarted": "fapping_diner"
}
