{
  "options": [
    {
      "optionText": "Que porra é essa..? Haha. Sua bunda parece que brigou com o Cassetete Bonk. E perdeu.",
      "responseText": "Ugh, não me lembre. A Polícia da Pureza estava *muito* entusiasmada em me lembrar das regras... repetidamente. Talvez eu os tenha provocado um pouco demais.",
      "followUpOptions": [
        {
          "optionText": "O próximo passo é você rastejar pelas paredes, sibilando como uma espécie de gremlin com tesão.",
          "responseText": "Me dê mais dez minutos aqui, e isso pode muito bem acontecer. Talvez você queira se afastar."
        },
        {
          "optionText": "Provocou eles? O quê, você literalmente *pediu* por isso? 'Ei, Polícia da Pureza, eu te desafio a dar um tapa na minha bunda!'",
          "responseText": "Bem... não com tantas palavras, mas digamos que eu me inclinei na hora *exatamente* errada. Eles levaram isso como um convite."
        },
        {
          "optionText": "Quantas vezes o Hugh bateu uma olhando para sua... *situação*?",
          "responseText": "Oh meu Deus, eu *não* quero pensar nisso! Mas a julgar pelos barulhos estranhos e murmúrios... mais vezes do que posso contar.",
          "followUpOptions": [
            {
              "optionText": "Então você está me dizendo que o Hugh está tentando bater algum tipo de recorde mundial enquanto você está presa aqui?",
              "responseText": "Impressionante? Mais para perturbador. Toda vez que ouço aquele barulho de *esguicho*, eu morro um pouco por dentro. Ele é como uma máquina movida a vergonha!"
            },
            {
              "optionText": "Hugh, quantas vezes você bateu uma para a bunda acorrentada dela?",
              "responseText": "Hugh Jass: Um... bem, se contar hoje, foram... muitas. Parei de contar depois das primeiras dez.",
              "followUpOptions": [
                {
                  "optionText": "Dez? Diana, você é praticamente o trabalho de tempo integral dele a esta altura!",
                  "responseText": "Vou passar mal. Se essas correntes não estivessem me segurando, eu pessoalmente garantiria que ele nunca mais batesse uma."
                },
                {
                  "optionText": "Hugh, amigo, você já pensou em... sabe... tirar *proveito* da situação?",
                  "responseText": "Hugh Jass: Uh... bem, quero dizer... quem não pensaria? Ela está bem ali, e, uh... é meio difícil não pensar nisso.",
                  "followUpOptions": [
                    {
                      "optionText": "Diana, parece que o Hugh tem tramado algo naquela cabecinha doente dele. Como isso te faz sentir?",
                      "responseText": "Oh, me sinto *fantástica*, obrigada. Saber que Hugh Jass quer um pedaço de mim? Absolutamente emocionada."
                    },
                    {
                      "optionText": "Hugh, você está jogando um jogo perigoso, cara. A Diana pode arrancar sua cabeça se você sequer tentar.",
                      "responseText": "Hugh: Sim, bem, eu não faria de verdade... eu acho."
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
