{
  "options": [
    {
      "optionText": "O que você quer?",
      "icon": "GUI/quest mark",
      "responseText": "Bem... isso é um pouco estranho, mas eu preciso de, uh… lingerie. E não, não daquele tipo áspero aprovado pelo refúgio. Estou falando de algo um pouco mais… refinado. Sabe, renda, cetim… talvez um pouco transparente. Olha, eu sei que é um pedido estranho, mas é por... razões pessoais.",
      "followUpOptions": [
        {
          "optionText": "Por que você veio a mim com isso?",
          "responseText": "Por quê? Bem, vejamos—a quem mais eu vou pedir? Ao cara que acha que chapéus de papel alumínio são o auge da moda? Você é o único neste refúgio que não me faz querer arrancar os olhos com uma colher enferrujada. Ou talvez eu apenas sinta que posso confiar em você, ok? Ugh, não torne isso estranho. Você vai ajudar ou não?"
        },
        {
          "optionText": "Onde posso conseguir isso?",
          "responseText": "Ah, um cara esquisito na estufa vende. Só seja discreto, ou você vai acabar levando uma porrada daqueles maníacos de spandex."
        },
        {
          "optionText": "Certo, eu pego.",
          "closeDialogueOptions": true,
          "addObjective": "Get lingerie for Diana",
          "fadeOutCharacter": true,
          "icon": "GUI/quest mark",
          "markEventAsPlayed": true,
          "requestedItemFromDiana": "Lingerie",
          "responseText": "Sabia que você diria sim. Você tem aquela energia de 'eu faria qualquer coisa por um vislumbre de um ombro'. Só lembre-se, isso fica entre nós. Se alguém perguntar por que você está comprando calcinhas de um traficante do mercado negro, diga que está trabalhando em um 'projeto de colcha de retalhos'."
        },
        {
          "optionText": "Não sou um dos seus gados.",
          "responseText": "A escolha é sua. Sempre posso encontrar outra pessoa, mas achei que você talvez quisesse participar da diversão.",
          "markEventAsPlayed": true,
          "fadeOutCharacter": true,
          "exitLine": true
        }
      ]
    }
  ],
  "auto_lines": [
    "Bom dia, raio de sol. Dormiu bem? Ótimo, porque tenho um pequeno favor a pedir."
  ]
}
