{
  "options": [
    {
      "optionText": "Uh... sim, acho que sim...",
      "responseText": "Não precisa ser tímido agora, você foi *ótimo*. Eu podia sentir vindo de longe. Sinceramente, eu meio que amo estar coberta com sua porra..."
    },
    {
      "optionText": "Uh... uau, não esperava que isso acontecesse...",
      "responseText": "Sim, ouço muito isso. Qual é o problema? Parece que você foi atingido por um brahmin em fuga. Nunca viu um par em ação antes?",
      "followUpOptions": [
        {
          "optionText": "Q-quer dizer, isso é tipo... uma coisa normal para você?",
          "responseText": "Normal? Querido, nada neste refúgio é normal. Mas quando se tem estes, é melhor colocá-los para trabalhar, certo?"
        },
        {
          "optionText": "Tem certeza que está bem com... tudo isso?",
          "responseText": "<i>*Diana morde o lábio, olhando para a bagunça em seu peito*</i> Bem com isso? Querido, estou mais do que bem. Ver você explodir assim me deixou *tão* excitada... você não faz ideia. Você tem uma mira do caralho.",
          "followUpOptions": [
            {
              "optionText": "Quer dizer, você *parece* muito gostosa coberta com isso...",
              "responseText": "Oh, eu sei que sim. E sei que você também gosta. Do jeito que você estava olhando, eu podia dizer que estava amando cada segundo. Não minta."
            },
            {
              "optionText": "Não sabia que você curtia... tanta bagunça.",
              "responseText": "O que posso dizer? É meio gostoso saber que te deixei *tão* louco. Me faz pensar quanto mais você tem nesse tanque."
            }
          ]
        },
        {
          "optionText": "Então... essa é a parte em que eu digo obrigado ou...?",
          "responseText": "Quer dizer, se você curte essa coisa de 'agradecer', claro."
        }
      ]
    },
    {
      "optionText": "Você, uh, precisa de uma toalha?",
      "responseText": "Uma toalha? Querido, preciso de uma *mangueira de incêndio*. Você não apenas gozou, você acionou um alerta de inundação do caralho."
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Até mais. Tente não desmaiar no corredor pensando nisso, ok? Não gostaria de ter que explicar isso para a Polícia da Pureza."
      ],
      "exitLine": true
    }
  ]
}
