{
    "options": [
    {
        "optionText": "[Report her to the Purity Police]",
        "responseTexts": ["Oh, honey, go ahead! I could use their audience. ♥"],
        "exitLine": true,
        "reported": 5,
        "specialEffects": ["removeBlur", "removeVignette"]
    },
    {
        "optionText": "[Watch]",
        "closeDialogueOptions": true,
        "isHEventStarted": true, 
        "icon": "GUI/eye icon",
        "HideAllShadowFiguresAfterHevent": true,
        "specialEffects": ["removeBlur", "removeVignette", "Shake"],
        "reduceDesireAfterAutoLines": 10,
        "addGripGaugePoints": 700,
        "hEventName": "diana_diner_gangbang",
        "spriteAtTheEndOfHscene": "Characters/Diana/in cum/IPAdapter_00866_(1)",
        "spriteAtTheEndOfHscenePosition": [ 1.55, -1.2 ],
        "endingSpriteColor": "#FFFFFF",
        "lineAfterHevent": "Ahh... it was amazing... ♥︎",
        "emotionsDuringHevent": ["none", "Characters/Diana/Emotions/Gangbang Diner/1", "Characters/Diana/Emotions/Gangbang Diner/2","Characters/Diana/Emotions/Gangbang Diner/3","Characters/Diana/Emotions/Gangbang Diner/4"],
        "endingEffects": ["Flashes"],
        "auto_lines": ["Ahh, fuck yes, don’t stop now... get in there deeper, you bastards ♥",
"Mmm, I can feel every dick, every inch... fuck, this is better than I imagined.",
"You boys sure know how to treat a lady... Keep filling me up, I’m not done yet!",
"Hah, finally getting what I’ve been craving... one after the other, don't you dare slow down!",
"My pussy’s so wet for you all... harder, fuck, yes, just like that!",
"Ahhh, don’t pull out, just keep pumping your cum inside... I need it, all of it!",
"Mmm, love the way you slap my ass... harder, make it sting ♥",
"Oh fuck, I’m gonna cum again, don’t stop, ahhh!",
"Yes, just like that, fill me up with all your juices... I’m not done until you are.",
"Mmm, every hole, every inch, I’m yours... make me scream, boys!",
"My pussy’s dripping, take turns, fuck me ‘til I can’t walk straight!",
"More, more, I want every one of you, don’t leave me wanting!",
"So many dicks, so little time... let’s make this last ♥",
"Fuck, I’m so close... make me cum again, you dirty bastards!",
"Mmm, loving every second of this... keep thrusting, fill me with every drop!",
"Ahhh, yes, keep pounding, don’t stop until I’m soaked in cum!",
"Mmm, yes, deep inside, I want to feel every one of you ♥",
"Juices mixing, cum everywhere... fuck, this is what I needed!",
"Ahh, yes, make my pussy tighter with every thrust, I’m loving this!",
"Fuck yes, all together, let’s make this vault echo with our moans!",
"Ahhh, I knew you boys couldn't resist a little fun... now, who's next? ♥",
"Hmmm, I’m so wet, you could drown in my juices... care to take a swim?",
"Don't be shy, dicks out, let's see what you’ve got... one at a time or all at once, I don’t mind.",
"Ohhh, yes, that’s it... deeper... make me forget about all those stupid vault rules.",
"Mmm, fuck... I can feel every inch... don't stop, I want it all.",
"*slurp* up every drop, boys... I've got plenty to go around.",
"God, I’ve missed this... your cock feels so good inside me, I might just forget about escaping.",
"Mmm, those hands on my butt... keep squeezing, I’m not made of glass.",
"Come on, fill me up, I want to feel you cum in every hole.",
"Hnnng, fuck, I can’t get enough... you're all just too damn good.",
"Oh, yes... fuck my pussy until I can’t stand... make me scream louder.",
"Mmm, your dicks are going to make me cum so hard... I’m going to ruin this table.",
"That’s right, choke me with it... I want to taste every last drop.",
"Fuck, you’re hitting all the right spots... keep going, I’m not even close to done.",
"I want to feel your cum dripping down my thighs... keep going until I’m soaked in it.",
"Ahhh, fuck, you’re making me cum again... don’t stop until I’m begging for mercy.",
"Mmm, yes, fuck my throat... make me gag on it, I love the way it feels.",
"Oh god, I’m so fucking close... don’t you dare pull out now.",
"Fill me up, boys... I want to be overflowing with your cum.",
"Hmmm, that was just the warm-up... who’s ready for round two?",
"Ahhh, didn’t think you’d last this long… but keep going, I’m not done yet. ♥",
"Hmmm, all this pent-up energy... never thought I'd actually enjoy sharing it. Don’t stop now.",
"So many dicks, so little time... guess I'll have to multitask. ♥",
"Cum for me, boys... you’ve all been holding out for way too long.",
"Pussy’s been craving this attention... let’s see who can satisfy it first. ♥",
"Finally, some real action... Vault-Tec never planned for this, did they? ♥",
"You all better last, because I’m not slowing down anytime soon.",
"Mmmm, this is what happens when you try to control people’s urges... they just explode.",
"Ahhh, that’s it... don’t be shy, there’s plenty of me to go around. ♥",
"Who knew blue balls could lead to this much fun? I’m loving every second. ♥",
"Hmmm, bet you never thought this vault could get this wild, huh? ♥",
"More, more... I want to see who can make me scream the loudest.",
"Cum on, boys... show me what you’ve been saving up for all this time. ♥",
"Ahhh, I’m gonna need a shower after this... maybe two, or three.",
"So many hands, so many cocks... I feel like the queen I was born to be. ♥",
"Let’s make sure everyone gets a turn... no one’s leaving unsatisfied tonight.",
"Mmmm, who knew breaking the rules could feel this good? Keep it coming. ♥",
"Ahhh, if this is what rebellion looks like, sign me up for round two.",
"You guys better not be holding back, because I’m not stopping until you’re all drained. ♥",
"Cum all you want, boys... I’m not even close to done with you yet. ♥",
"Ahh, look at all these desperate dicks lined up! Who knew charity work could be so... hmmm... fulfilling. ♥",
"Oh, I’m so wet right now! I could drown a whole stable of stallions in my juices. *slurp*",
"Hmmm, you call that a thrust? Come on, I need you to fuck me like the vault's about to collapse! Aghh, that’s it!",
"Yes, yes, YES! Fill me up, boys! I want to see if I can take more cum than this vault can hold!",
"Oh, you're so deep inside! You might just find the Emergency Release Button in there! ♥",
"*slurp* Oh, so many cocks... Keep 'em coming, boys! I’m like the vault’s entertainment system on full volume!",
"Aghh! I’m losing count of how many dicks I’ve sucked today... not that it matters. Hmmm, I’ll just keep going until I can’t think straight. Oh wait, too late!",
"Look at all you drooling morons, just waiting your turn... Ohh, I bet your balls are so heavy! Let me help with that. *slurp*",
"Ahh, I can feel you throbbing inside me! I’m going to milk you dry like the last bottle of Nuka-Cola! Aghh!",
"Come on, don’t be shy! I’ve got two hands and a mouth. Let's put them to work, Aghh!",
"You think the Purity Police can stop this? I’d like to see them try! By the time they get here, I'll have cum from my ears! ♥",
"More, more! I want you all to fuck me until my brain is mush, and all I can think about is your cocks. Ahh, oh yes!",
"Aghh! Your dick feels so good... I want it deeper! Like, all the way into my throat, oh god! *slurp*",
"Ahh, I can feel my pussy squeezing around you! You’re gonna make me cum, and I’ll bet half the vault will hear it!",
"So much cum... hmmm, I could make a smoothie out of it! You boys have been saving up for me, haven’t you? *slurp*",
"Ahh, it feels like I’m swimming in a sea of dicks! And you know what? I’m not complaining one bit! ♥",
"Oh, god! Keep fucking me, I want to pass out from pleasure! Make my eyes roll back and my toes curl, oh yes!",
"I’m your vault goddess! Worship me with your cocks! Fill me up until I’m dripping with your love. Ahh!",
"Hmmm, every thrust sends me closer to heaven... and I don’t even believe in that shit! Aghh!",
"Oh, boys... keep me cumming like this, and I’ll make sure every one of you gets a turn! *slurp* I’m just that generous!"]
        
    }
    ],
    "auto_lines": [ 
"Oh fuck, I’m gonna cum again, don’t stop, ahhh!",
"Yes, just like that, fill me up with all your cum... I’m not done until you are.",
"Mmm, every hole, every inch, I’m yours... make me scream, boys!"],
"hEventStarted": "diner_gangbang",
"showShadowFigures": "Diana's gangbang"
}
