{
    "options": [
    {
        "optionText": "[Report her to the Purity Police]",
        "responseTexts": ["Go ahead, snitch. Just make sure to tell them how long you stood there watching before you decided to tattle. I’ll be sure to mention how you couldn’t keep your eyes off me.", "What the f--?! You little snitch! Go ahead, report me, but don’t act like you weren’t thinking of joining in. Just remember: snitches get... nothing. And I do mean nothing."],
        "exitLine": true,
        "fadeOutCharacter": true,
        "specialEffects": ["removeBlur", "removeVignette"],
        "reported": 5
    },
    {
        "optionText": "[Watch]", 
        "icon": "GUI/eye icon",
        "specialEffects": ["removeBlur", "removeVignette"],
        "spriteAtTheEndOfHscene": "Characters/Diana/in cum/sitting on the table in cum",
        "spriteAtTheEndOfHscenePosition": [ 2.69, -3.43 ],
        "closeDialogueOptions": true,
        "isHEventStarted": true, 
        "interactableBGcolor": "#222222",
        "addGripGaugePoints": 350,
        "interactable": "Characters/Diana/Interactables/sex double dick",
        "hEventName": "diana_group_sex_in_diner",
        "endingEffects": ["Flashes"],
        "lineAfterHevent": "Ahh... it was amazing... ♥︎",
        "auto_lines": ["Mmm, ohhh, look at all these dicks just for me—♥︎",
        "You’re all so fking hard already, mmm, I love it—♥︎",
            "Ahh... h-hard cock... so much cock... I'm just a worthless fucking slut, breed me... break me... fuck my brains out...♥",
            "Ahhh, fk, so many cocks, I don’t even know where to fking look—♥︎",
        "Please... my holes ache... goddamn, I-I’m addicted... can't go five minutes without—fucking fill me, use me, please don't leave me empty...",
        "Nnn, ohhh, I feel like the vault’s personal little whore—♥︎",
        "Fuck... j-just choke me with it... I’m your personal breeding bitch... ruin me, m-make me cum again... I'll beg—I'll beg all day for your cock...",
        "Mmm, I bet you fkers have dreamed about this, haven’t you?—♥︎",
        "N-no thoughts left... just c-cock... need more... now...",
        "Ahhh, fk, I want every dick in this room fking aching for me—♥︎",
        "C-can't stop shaking... just... need cum inside me... uhh, f-fuck...",
        "Mmm, ohhh, I know I’m a fking slut, I fking love it—♥︎",
        "Don't l-leave me empty... please, shove it in... now...",
        "Ahhh, ohhh, all these cocks, all this attention—mmm, fk—♥︎",
        "I-I can't... breathe... without dicks... inside...", 
        "Ahhh, fk, if the Overseer saw this, he’d lose his fking mind—♥︎",
        "D-drip your cum into me... need it leaking out... always...",
        "Ahh, don’t stop! I’ve been craving this for weeks... oh god!",
"Feels like I’m dripping wet with every thrust... hnnng, you’re gonna make me explode!",
"Mmm, your dick is hitting all the right spots... ♥ Keep going!",
"Ohhh, I can feel the juices running down my thighs... more, more!",
"Fuck, I haven’t been this full in ages... don’t you dare stop!", 
"Mmm, you’re gonna make me cum all over your cock... hnnng!",
"Ahh, deeper, I want to feel every inch of those dicks... ♥",
"You’ve got me soaking wet... I can’t get enough of this!",
"Oh fuck, I’m so close... just a little more...!",
"Mmm, every time you thrust, I feel it deep in my pussy... don’t stop now!",
"Hnnng, your cocks driving me crazy... I’m gonna lose it!",
"Ahhh, you’re hitting all the right spots... fuck, I’m cumming!",
"Mmm, I can feel your cocks throbbing... are you gonna fill me up with cum?",
"Ohhh, fuck, you’re making me cum so hard... ♥",
"Ahh, I love the way you stretch me out... give me more!",
"Mmm, I’m gonna squeeze every drop of cum out of you... ♥",
"Oh fuck, you’re making me so wet... I can’t hold back anymore!",
"Mmm, I want to feel every drop of your cum inside me... don’t stop until I’m overflowing!",
"Ahh, yes, right there! Don’t stop, oh god, I can feel every inch of you—so deep inside... ♥",
"Mmm, your dicks are so hard, it's driving me wild... hnnng, I’m so close, don’t you dare stop now!",
"Oh fuck, you’re filling me up so perfectly... I can feel your cocks stretching me, ahhh, yes!",
"Hahhh, I’m dripping, can you feel how wet I am? Oh god, it's running down my thighs... ♥",
"Mmm, your cocks throbbing so much, I can’t wait to feel your cum shooting deep inside me... hnngh, yes!",
"Ahhh, harder! Fuck me harder! I want to feel you pound me until I can’t think straight... ♥", 
"Hnnngh, I’m so fucking close! Ahhh, I can’t hold it anymore... I’m gonna cum!",  
"Mmm, your cocks are so deep inside me... I can feel your cum filling me up, ohh, fuck, I’m cumming!"]
        
    }
    ],
    "auto_lines": [
"Mmm, ohhh, look at all these dicks just for me—♥︎",
        "You’re all so fking hard already, mmm, I love it—♥︎"],
"hEventStarted": "sex_with_buster",
"showShadowFigures": "Diana's audience 3"
}
