{
  "options": [
    {
      "optionText": "Ei, Diana, eu uh... preciso de um favor.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Get Diana's Panties for Jass",
      "dontShowIfProgressionEventPlayed": "diana_panties_received",
      "responseText": "Mmm, um favor, hein? Isso soa perigoso vindo de você. O que é? Desembucha antes que eu fique entediada.",
      "followUpOptions": [
        {
          "optionText": "Estou, uh, coletando algo para um... experimento do refúgio. Sabe, coisas de ciência. Posso pegar sua... um... calcinha?",
          "responseText": "Ah, calcinha? Bem, eu adoro um homem da pesquisa... mas não. Se alguém vai fazer experimentos com minha calcinha, serei eu. Boa tentativa, no entanto.",
          "followUpOptions": [
            {
              "optionText": "Sabe, estou apenas pedindo por... um pedaço de tecido. Nada muito estranho, certo?",
              "responseText": "Um pedaço de tecido? Querido, essa é a forma mais indireta que já ouvi alguém pedir minha roupa íntima. O que vem a seguir, quer pegar meu sutiã emprestado também?"
            },
            {
              "optionText": "É para um, uh... amigo. Eles me desafiaram. Posso, por favor, pegar um par?",
              "responseText": "Olha, não sei que tipo de aposta você perdeu, mas de jeito nenhum vou entregar minha calcinha só para salvar sua bunda."
            },
            {
              "optionText": "Ok, tudo bem, você me pegou. Alguém no refúgio... uh, me pediu para pegá-las. Não pergunte por quê.",
              "responseText": "Ahh, então você é o novo garoto de entregas para pervertidos do refúgio, hein? Fofo. Bem, pode voltar e dizer a eles que se quiserem minha calcinha, terão que fazer mais do que enviar um intermediário. Tipo, não sei, talvez desenvolver algum autorrespeito.",
              "followUpOptions": [
                {
                  "optionText": "Imaginei que você diria não. Tinha que tentar, né?",
                  "responseText": "Oh, fico feliz que tentou. But, sweetie, I don’t hand out my panties like vault-issued jumpsuits. Keep dreaming."
                },
                {
                  "optionText": "Vamos, Diana, você me conhece. Passamos por poucas e boas. Apenas me ajude?",
                  "relationshipRequired": 35,
                  "giveItem": "Diana's Panties",
                  "progressionEventPlayed": "diana_panties_received",
                  "exitLine": true,
                  "dontDisplayIfObjectiveComplete": "Get Diana's Panties for Jass",
                  "failedCheckResponse": "Uau, que jogada ousada. Talvez comece com, tipo, um manual da Vault-Tec sobre 'Interação Humana Básica' antes de ir direto para as coisas estranhas. Boa tentativa, no entanto. Pontos pelo... entusiasmo?",
                  "responseText": "*Risos* Oh, tudo bem. Acho que você mereceu depois de todo esse tempo. Quer que eu me dispa aqui mesmo? Certo. Aproveite o show, querido. ♥︎"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "[Entregar Lingerie]",
      "icon": "GUI/quest mark",
      "responseText": "Oh, meu... eu sabia que você tinha bom gosto, mas isso? Querido, você se superou! São fabulosas! Obrigada!",
      "onlyDisplayIfHasObjective": "Get lingerie for Diana",
      "giveItemToCharacter": "Red Lingerie",
      "itemRequired": "Red Lingerie",
      "relationshipPoints": 15,
      "markObjectiveComplete": "Get lingerie for Diana",
      "exitLine": true
    },
    {
      "optionText": "[Entregar Dildo]",
      "icon": "GUI/quest mark",
      "responseText": "Oh, meu... você realmente sabe como satisfazer os desejos de uma garota. Esperei o dia todo para alguém me entregar um... dildo grande e firme. Obrigada.",
      "onlyDisplayIfHasObjective": "Get dildo for Diana",
      "giveItemToCharacter": "Monster Dildo",
      "itemRequired": "Monster Dildo",
      "relationshipPoints": 20,
      "markObjectiveComplete": "Get dildo for Diana",
      "exitLine": true
    },
    {
      "optionText": "Você viu o que está acontecendo? O refúgio virou uma orgia completa!",
      "gripGaugeRequired": 5000,
      "hideOptionIfReqCheckFailed": true,
      "responseText": "Ah, você quer dizer o 'Sirirocalipse'? Sim, eu notei. Tive um lugar na primeira fila para a orgia no Restaurante. Um cara usou uma pilha de purê de batatas como lubrificante. Realmente comove.",
      "followUpOptions": [
        {
          "optionText": "Eu talvez, uh… tenha tido algo a ver com isso. Eu meio que ajudei o Líder da Resistência da Masturbação… sabe, a distribuir algum, uh, material de masturbação.",
          "responseText": "Então é por isso que encontrei uma assinatura para todo o refúgio de ‘Bumbuns Pré-Guerra Mensal’ debaixo da minha porta. Eu deveria saber que você estava envolvido. Você sozinho transformou este lugar de um convento em um estúdio de cinema adulto."
        },
        {
          "optionText": "Então… você está de boa com todo esse caos?",
          "responseText": "De boa com isso? Por favor. Eu esperei por este dia desde que me deram meu primeiro panfleto de castidade do refúgio. Ver a Polícia da Pureza se atrapalhar enquanto as pessoas estão literalmente se masturbando nos corredores? Esse é o tipo de justiça poética pela qual eu vivo."
        }
      ]
    },
    {
      "optionText": "Então, o que você acha deste lugar? Parece uma piada de mau gosto, né?",
      "responseText": "Piada de mau gosto? Este lugar é uma mina de ouro para alguém como eu. Sou a única emoção que esses pobres coitados têm, e eles sabem disso. Consigo fazer metade do refúgio babar só de usar batom.",
      "followUpOptions": [
        {
          "optionText": "Então, você adora este lugar?",
          "responseText": "Oh, querido, ‘adorar’ é uma palavra forte. Eu diria que o exploro. Esses tolos andam por aí como cães famintos, e tudo que tenho a fazer é balançar um osso. É como ter meu próprio exército pessoal de escravos."
        },
        {
          "optionText": "Vamos lá, você deve estar morrendo de vontade de um pouco de ação.",
          "responseText": "Morrendo de vontade de ação? Por favor. Ver esses idiotas se contorcerem é mais divertido que qualquer coisa. O desespero nos olhos deles é praticamente preliminar. Por que me contentar com um cara quando posso ter o refúgio inteiro comendo na minha mão?"
        },
        {
          "optionText": "O que você acha do Supervisor?",
          "responseText": "Ah, o Saco Azul? Olhe para ele — construído como um tanque pré-guerra, mas provavelmente não dispara um tiro há décadas. Aposto que ele passa mais tempo polindo seu cassetete do que realmente usando-o.",
          "followUpOptions": [
            {
              "optionText": "As bolas do cara são enormes... certo?",
              "responseText": "Enormes? Querido, aquelas coisas são como duas bombas nucleares esperando para cair. Juro, um movimento errado e o refúgio inteiro vai pelos ares numa nuvem de cogumelo."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Quero te perguntar uma coisa... [<color=purple>Opções Safadas</color>]",
      "icon": "GUI/heart4",
      "responseTexts": [
        "Oh, se for um pedido de casamento, certifique-se de se ajoelhar com os dois joelhos. Um só não é suficiente para mim.",
        "Deixe-me adivinhar, você quer me perguntar se eu leio mentes? Porque a resposta é não, e também sim.",
        "Se for outra pergunta de ‘Como você se mantém tão gostosa?’, eu juro, vou cobrar entrada da próxima vez.",
        "Deixe-me adivinhar, você quer saber como eu continuo driblando a Polícia da Pureza? Duas palavras: Túneis. Secretos."
      ],
      "followUpOptions": [
        {
          "optionText": "Ousaria mostrar esses atributos aqui?",
          "relationshipRequired": 30,
          "desireRequired": 38,
          "failedCheckResponse": "Pffft, querido, você não aguentaria essas belezuras de primeira linha. Volte quando não for mais apenas um camponês implorando por um vislumbre.",
          "responseText": "Oh, você realmente quer me testar? Certo. Mas é melhor esperar que ninguém tenha uma câmera, porque isso vai entrar para a história do refúgio.",
          "followUpOptions": [
            {
              "optionText": "Faça.",
              "changeSprite": "Characters/Diana/IPAdapter_00182_",
              "newSpriteXPos": 3,
              "newSpriteYPos": -2,
              "swapAnotherCharacterDialogue": [
                "Diana",
                "Characters/Diana/Dialogues/after_flashing_tits"
              ],
              "exitLine": true,
              "responseText": "Pronto. Feliz agora? Ou devo te cobrar aluguel por esse imóvel mental?"
            }
          ]
        },
        {
          "optionText": "Te desafio a fazer algo selvagem. Mostre-me o que você tem.",
          "relationshipRequired": 50,
          "desireRequired": 60,
          "targetCharacterShouldHaveItems": "Vibrator",
          "failedCheckResponse": "Uau, você realmente acha que é tão especial? Já vi desafios melhores de crianças do jardim de infância pré-guerra. Melhore seu jogo ou vá brincar com o descascador de batatas.",
          "responseText": "Oh, querido, você quer algo selvagem? Neste refúgio, respirar muito forte é considerado selvagem. <i>*Ela tira um vibrador.*</i> Lembra disso que você me deu? Eu poderia ligar essa coisa, e a Polícia da Pureza pensaria que é apenas um duto de ar solto...",
          "followUpOptions": [
            {
              "optionText": "De jeito nenhum você vai usar isso aqui. A Polícia da Pureza está bem atrás de você!",
              "changeSprite": "Characters/Diana/new NSFW/vibrator_lounge",
              "swapAnotherCharacterDialogue": [
                "Diana",
                "Characters/Diana/Dialogues/after_daring_her"
              ],
              "exitLine": true,
              "responseText": "Acho que vamos descobrir se eles gostam de boas vibrações ou não, hein?"
            }
          ]
        }
      ]
    },
    {
      "optionText": "[Presente]",
      "icon": "GUI/gift icon",
      "neverGreyOut": true,
      "isGifting": true
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Já vai fugir? Não se preocupe, não vou te denunciar por ter pensamentos impuros. Ainda.",
        "Até mais, ou talvez não. De qualquer forma, tenho certeza de que você estará pensando em mim.",
        "Tchau agora. Tente não babar em si mesmo na saída.",
        "Já vai? Acho que não posso te culpar—é difícil manter a calma quando estou por perto.",
        "Tchau. Tente não ser pego com as calças arriadas. Literalmente.",
        "Até mais, docinho. Tente manter suas fantasias sob controle."
      ],
      "exitLine": true
    }
  ]
}
