{
  "options": [
    {
      "optionText": "Diana? O que foi?",
      "responseText": "Está acontecendo—porra, o bebê está vindo agora. Deus, dói, mas… eu quero que você veja tudo enquanto acontece. Eu quero você comigo.",
      "followUpOptions": [
        {
          "optionText": "Abra as pernas, amor. Estou com você.",
          "responseText": "Deus, sim… ver seus olhos na minha buceta assim, toda aberta, está me deixando molhada mesmo agora.",
          "changeSprite": "Characters/Diana/pregnant/IPAdapter_04311_(1)(1)",
          "changeSpriteColor": "#FFFFFF",
          "newSpriteXPos": 0,
          "newSpriteYPos": -0.45,
          "hEventName": "diana_giving_birth",
          "followUpOptions": [
            {
              "optionText": "Você está linda. Continue fazendo força, amor.",
              "responseText": "Porra, sua voz, suas mãos… Está fazendo isso quase parecer bom. Ahh… merda, continue me tocando.",
              "followUpOptions": [
                {
                  "optionText": "Vou esfregar seu clitóris enquanto você faz força.",
                  "responseText": "Ahh, porra, sim! Seus dedos bem aí, continue. Deus, está se misturando com a dor tão perfeitamente. É fodidamente avassalador—pressão, prazer, tudo de uma vez. Merda, estou chegando tão perto…",
                  "followUpOptions": [
                    {
                      "optionText": "Faça mais força, amor. Você está quase lá.",
                      "responseText": "Porra, sua voz me comandando… deus, estou começando a gozar, mesmo com este bebê me abrindo.",
                      "changeSprite": "Characters/Diana/pregnant/birth1",
                      "followUpOptions": [
                        {
                          "optionText": "É isso. Consigo ver a cabeça—continue gozando. Goze para mim enquanto dá à luz nosso filho.",
                          "responseText": "Ahh, porra, sim! Está me abrindo, me fazendo gozar ainda mais forte! Porra, continue, por favor! Sim! Oh deus, estou gozando! Porra, porra, seus dedos, sua voz, é tudo demais!",
                          "followUpOptions": [
                            {
                              "optionText": "Quase lá, gata. Mais uma força.",
                              "responseText": "Porra, estou fazendo força, estou gozando… oh meu deus, é tão intenso pra caralho!",
                              "changeSprite": "Characters/Diana/pregnant/birth2",
                              "followUpOptions": [
                                {
                                  "optionText": "É isso, Diana! Deixe tudo sair agora!",
                                  "responseText": "Ahhh, porra, aí vem! Sim, sim! Oh deus, está deslizando para fora, e eu estou explodindo pra caralho…!",
                                  "specialEffects": ["Flashes"],
                                  "changeSprite": "Characters/Diana/pregnant/birth3",
                                  "playSound": "Sounds/baby cry",
                                  "followUpOptions": [
                                    {
                                      "optionText": "Você foi incrível, Diana. Nosso bebê está aqui.",
                                      "responseText": "Porra… porra… Isso foi insano. Deus, sentir você lá, me guiando, tornou tudo incrível."
                                    },
                                    {
                                      "optionText": "Você estava incrivelmente gostosa, gozando enquanto dava à luz.",
                                      "responseText": "Deus, cale a boca… você adorou me ver gozar, não foi? Senti seu pau tremer o tempo todo."
                                    },
                                    {
                                      "optionText": "Descanse agora, linda. Você mereceu.",
                                      "responseText": "Mmm, ok. Mas mantenha suas mãos em mim… só mais um pouco.",
                                      "advanceDayWithStatusMessage": "Você passou o dia abraçando Diana, sentindo o calor dela enquanto seu recém-nascido dormia por perto. Pela manhã, a equipe do refúgio levou o bebê para a enfermaria para exames."
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "auto_lines": [
    "A-Amor… está… está na hora. Porra, estou com tanto medo… Não acho que consigo fazer isso sozinha… por favor… Eu preciso de você comigo…"
  ]
}
