{
  "options": [
    {
      "optionText": "Como você está se sentindo, amor?",
      "responseText": "Pesada, dolorida e estranhamente... feliz. É bizarro, mas eu meio que gosto. Este pequeno parasita crescendo dentro de mim é metade você—torna mais fácil de lidar.",
      "followUpOptions": [
        {
          "optionText": "Eu amo te ver assim.",
          "responseText": "Continue falando assim e talvez eu até esqueça o quão desconfortável este maldito macacão é. Sério, porém… obrigada. Por estar aqui."
        },
        {
          "optionText": "Não acredito que estamos fazendo isso. Você, eu, um bebê...",
          "responseText": "Acredite. De alguma forma, te amar pode ser a coisa mais perigosa que já fiz. E a que mais valeu a pena.",
          "followUpOptions": [
            {
              "optionText": "Nós vamos proteger esta criança. Juntos.",
              "responseText": "Pode apostar que vamos. Qualquer um que tentar machucar nossa família, se arrependerá de ter pisado perto do Refúgio 6969."
            },
            {
              "optionText": "Tem certeza que está bem com isso? Realmente bem?",
              "responseText": "Sinceramente? Nunca tive tanta certeza de algo. Talvez o poder não seja mais sobre controle... talvez seja sobre escolher a quem você entrega seu coração."
            },
            {
              "optionText": "Como vamos chamar a criança?",
              "responseText": "Hah, estive pensando nisso. Algo forte, inesquecível... ou talvez apenas não um daqueles nomes vergonhosos do refúgio. Tem alguma ideia?",
              "followUpOptions": [
                {
                  "optionText": "Que tal algo clássico? Como Nora. Ou James.",
                  "responseText": "*sorri suavemente* Nomes do mundo antigo. Eu meio que gosto disso. Dá um peso."
                },
                {
                  "optionText": "E algo badass? Como Blade, ou... Doomslayer.",
                  "responseText": "*ri, depois geme* Não me faça rir, dói. Doomslayer? Você quer que nosso filho apanhe e volte para casa chorando. Fale sério, ou juro que esses hormônios vão te dar um tapa por mim."
                },
                {
                  "optionText": "Não me importo com o nome que daremos... contanto que seja com você.",
                  "responseText": "*pisca lentamente* ...Você é perigoso quando é tão doce. Droga. Diga coisas assim de novo e eu posso derreter."
                }
              ]
            }
          ]
        },
        {
          "optionText": "Todo mundo está te encarando...",
          "responseText": "Deixe que encarem. Estou carregando algo mais importante que o julgamento deles."
        },
        {
          "optionText": "Você está incrivelmente gostosa agora. Eu te quero. Bem aqui.",
          "icon": "GUI/heart4",
          "responseText": "Deus, você é um sem-vergonha. E eu amo isso. Mas se você sequer *tentar* começar algo na frente desses curiosos, juro que você vai se arrepender de não ter esperado até estarmos sozinhos. Ou talvez… não vai.",
          "followUpOptions": [
            {
              "optionText": "Eu não me importo.",
              "icon": "GUI/heart4",
              "responseText": "Tch... Você é impossível. E se continuar com esse olhar, nós *vamos* ter um problema... um problema do tipo bem molhado e gemido.",
              "followUpOptions": [
                {
                  "optionText": "[Fazer sexo na frente de todo mundo]",
                  "changeSprite": "Characters/Diana/pregnant/pregnant sex",
                  "newSpriteXPos": 0.25,
                  "newSpriteYPos": -1.17,
                  "icon": "GUI/heart4",
                  "closeDialogueOptions": true,
                  "isHEventStarted": true,
                  "setBGcolor": "#919191",
                  "changeSpriteColor": "#E7E7E7",
                  "specialEffects": ["Blackout"],
                  "endingEffects": ["Flashes"],
                  "showShadowFigures": "Pregnant lounge sex 2",
                  "HideAllShadowFiguresAfterHevent": true,
                  "progressionEventPlayed": "lounge_pregnant_PlayerSex",
                  "spriteAtTheEndOfHscene": "Characters/Diana/pregnant/sitting pregnant cumshot",
                  "spriteAtTheEndOfHscenePosition": [-6.43, -2.08],
                  "lineAfterHevent": "Ahh... é melhor você não ter afogado o bebê com o tanto que bombeou aí dentro...",
                  "swapAnotherCharacterDialogue": [
                    "Diana",
                    "Characters/Diana/Dialogues/after_pregnant_sex"
                  ],
                  "reduceDesireAfterAutoLines": 10,
                  "hEventName": "diana_lounge_pregnant_PlayerSex",
                  "auto_lines": [
                    "Ahh! Bem aqui? Você é louco pra caralho!",
                    "Ohh deus... seu pau é tão bom, está me enlouquecendo! ♥",
                    "Mmm, mais forte! Mais fundo! Me faça esquecer que estão todos assistindo! ♥",
                    "Ah, merda... sim, amor, foda essa buceta cheia de novo, me lembre a quem ela pertence!",
                    "Porra—porra! Oh deus, me alargue, exatamente assim, mais fundo, mais fundo!",
                    "Mmmph, seu animal... você vai nos exilar—mas caramba, vale a pena! ♥",
                    "Ahh... sinto cada centímetro, batendo fundo, me marcando de novo! ♥",
                    "Oh porra, sim, me engravide mais forte, mostre a todos a quem eu pertenço!",
                    "Deus, seu pau é perfeito pra caralho! Não se atreva a diminuir o ritmo!",
                    "Nngh, você está atingindo aquele ponto—oh porra, sim, amor, bem aí!",
                    "Ahhh! Me faça gritar mais alto, deixe-os saber como você me fode bem! ♥",
                    "Ohh, foda minha buceta crua, não pare até eu estar vazando sua porra por todo lado!",
                    "Ahh, porra, eu preciso disso—mais forte, mais bruto! Me quebre na frente de todo mundo!",
                    "Mmm, não acredito que estamos fazendo isso—mas porra, não quero que você pare! ♥",
                    "Merda, sim, me faça gozar bem aqui—oh deus, me encha de novo, mais fundo, porra!",
                    "Oh porra, meus peitos doem, aperte-os mais forte, me morda, faça doer tão bom! ♥",
                    "Ahhh, me foda até eu ficar burra—me faça sua, para sempre sua, me reivindique completamente!",
                    "Caramba, seu pau... porra, como você está sempre tão duro, tão perfeito? ♥",
                    "Mmm, você vai me engravidar de novo nesse ritmo... foda-se, faça!",
                    "Ahh, não me importo se nos exilarem, contanto que eu tenha seu pau enterrado fundo em mim! ♥",
                    "Oh deus, sim, porra, continue batendo, continue alargando minha buceta pingando!",
                    "Ahhh! ♥ Não se atreva a tirar—me foda mais forte, me encha até doer! ♥",
                    "Mmm, porra—minha buceta vai doer por dias, mas é tão bom!",
                    "Porra, amor, goze fundo, me afogue nisso—ah, sim, faça uma bagunça do caralho! ♥",
                    "Ohh! Me marque com sua porra, deixe-os ver escorrendo!",
                    "Mmm, me reivindique com mais força, quero que todo filho da puta aqui saiba exatamente quem me engravidou! ♥",
                    "Ahh, merda! Estou tão perto—me foda mais rápido, me arruíne bem aqui!",
                    "Sim! Sim! Porra! Me encha de novo, alargue mais minha barriga, me engravide completamente! ♥",
                    "Oh deus, sim, goze comigo—porra, quero sentir você explodir fundo!",
                    "Ahhh, porra, sim! ♥ Sou sua—totalmente, completamente sua... agora e para sempre! ♥",
                    "Porra... seu pau é incrível me abrindo.",
                    "Oh deus, sim, mais forte! Foda-se todos eles assistindo, deixe-os ver quem é o dono desta buceta. ♥",
                    "Sim, porra... eu te amo dentro de mim, amor.",
                    "Mmm, seu pau é perfeito, me preenchendo exatamente como preciso.",
                    "Ahh... me foda mais fundo, por favor, preciso sentir você atingir aquele ponto de novo.",
                    "Oh deus, estou tão perto... não pare, continue batendo na minha buceta grávida.",
                    "Me encha até eu não aguentar mais uma gota.",
                    "Mmm, eu te amo tanto... ahh, porra, sim! ♥"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "[Dar um Presente]",
      "emotion": "none",
      "icon": "GUI/gift icon",
      "neverGreyOut": true,
      "isGifting": true
    },
    {
      "optionText": "Tchau",
      "responseText": "Não demore, ok? Só de ter você por perto... tudo parece um pouco mais fácil.",
      "exitLine": true
    }
  ]
}
