{
  "options": [
    {
      "optionText": "Uau, Diana. Dia cheio? Ou apenas mais uma terça-feira?",
      "responseText": "Querido, se fosse apenas mais uma terça-feira, eu não estaria coberta de toda essa... 'apreciação'. Acho que realmente deixei uma impressão, hein?",
      "followUpOptions": [
        {
          "optionText": "Sim, você está realmente pingando de sucesso...",
          "responseText": "Oh, não me importo com um pouco de bagunça. Pense nisso como prova da minha... *produtividade*. Algumas garotas colecionam selos. Eu coleciono controle.",
          "followUpOptions": [
            {
              "optionText": "Você é praticamente uma trabalhadora de caridade a esta altura.",
              "responseText": "Caridade? Por favor. Isso é *estratégico*. Mantenha a tensão alta, dê a eles um gostinho e observe-os se contorcer. Basicamente, estou comandando este refúgio agora."
            },
            {
              "optionText": "Já considerou cobrar uma taxa? Você poderia dominar o mercado.",
              "responseText": "Você acha que alguém aqui poderia me pagar? Eu comando este lugar com base na oferta e *demanda*. E confie em mim, a demanda está bem alta."
            }
          ]
        },
        {
          "optionText": "Então, devo te trazer um rodo ou uma medalha?",
          "responseText": "Nenhum dos dois. Estou mais para... reconhecimento prático, se é que me entende. A tensão do refúgio está alta, e eles também.",
          "followUpOptions": [
            {
              "optionText": "Prático? Acho que aqueles caras sabem disso em *primeira mão* agora.",
              "responseText": "Exatamente. E acredite em mim, eles voltarão para mais. Ninguém lida com a pressão como eu."
            },
            {
              "optionText": "Vai precisar de mais de duas mãos nesse ritmo.",
              "responseText": "Duas? Querido, você me subestima. Tenho um refúgio cheio de homens carentes, e estou lidando com todos eles muito bem."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Não tenho certeza do que acabei de ver, mas... bom trabalho, eu acho?",
      "responseText": "Você acabou de ver o futuro deste refúgio, querido. E você é bem-vindo para se juntar à equipe vencedora. Se conseguir acompanhar, é claro."
    },
    {
      "optionText": "Tchau",
      "responseText": "Já vai? Não se preocupe, eles voltarão em breve. E quando voltarem, estarei pronta para outra rodada.",
      "exitLine": true
    }
  ]
}
