{
  "options": [
    {
      "optionText": "O que está acontecendo? Você parece séria.",
      "responseText": "Estou grávida. E é seu. Você me encheu com tanta força que o med-bot do refúgio me marcou como comprometida. Seu pau aparentemente funciona um pouco bem demais. Você colocou um bebê em mim e... pela primeira vez, não sinto vontade de fugir disso. Ou de você.",
      "followUpOptions": [
        {
          "optionText": "Tem certeza que é meu? Não sou o único cara neste refúgio, sabe...",
          "responseText": "É seu. Eu não andei me oferecendo por aí, ok? Você foi o único que deixei me arrebentar sem proteção."
        },
        {
          "optionText": "Não acredito em você.",
          "responseText": "Eu entendo. Eu também não acreditaria em mim. Mas é real. Sinto isso a cada maldito segundo—meu corpo está mudando, minha cabeça está uma bagunça... e continuo pensando em você. Em nós. Você acha que eu mentiria sobre estar gerando um humano inteiro só para te sacanear? Quer ver o exame médico, ou talvez apenas os peitos que não cabem mais no meu maldito macacão?"
        },
        {
          "optionText": "E agora? Você se muda? Criamos o filho?",
          "icon": "GUI/quest mark",
          "emotion": "Characters/Diana/Emotions/standing cleavage/closed eyes",
          "responseText": "Sinceramente... parte de mim quer isso, sim. Mas há um problema. A polícia da pureza sabe—fui marcada. Eles estão falando em me exilar, a menos que você os convença do contrário.",
          "followUpOptions": [
            {
              "optionText": "Tem certeza que quer isso? Pode significar problemas para nós dois.",
              "emotion": "none",
              "responseText": "Eu não planejei me tornar o escândalo grávido do refúgio, e estou com medo, sim—mas quero lutar por isso. Por nós. Mas só se você também quiser."
            },
            {
              "optionText": "Não se preocupe. Eu lido com eles.",
              "icon": "GUI/quest mark",
              "emotion": "none",
              "responseText": "Você vai? Deus… obrigada. Não sei o que faria sem você. Só… não recue, ok? Mostre a eles que estamos falando sério. Caso contrário, eu vou embora, e este filho—nosso filho—pode nunca te conhecer.",
              "addObjective": "Help Diana Avoid Exile"
            },
            {
              "optionText": "Se isso está acontecendo... estou com você. Até o fim.",
              "progressionEventPlayed": "acceptedToBeFatherForDiana",
              "icon": "GUI/heart4",
              "emotion": "none",
              "responseText": "Sério? Você quer dizer isso? Merda... não me faça chorar. Esses hormônios já estão me destruindo. Mas sim—eu quero isso. Com você. ♥",
              "followUpOptions": [
                {
                  "optionText": "Vamos resolver isso. Juntos. Eu prometo.",
                  "emotion": "Characters/Diana/Emotions/standing cleavage/closed eyes",
                  "responseText": "Sim. Juntos. Droga... nunca pensei que diria isso, mas fico feliz que tenha sido você."
                },
                {
                  "optionText": "Sinto o mesmo, Diana... também não esperava por isso, mas eu quero. Eu quero *você*.",
                  "emotion": "Characters/Diana/Emotions/standing cleavage/closed eyes",
                  "responseText": "...Deus. Diga isso de novo. Juro, pensei que nunca ouviria algo assim para mim. Você realmente quer dizer isso?"
                },
                {
                  "optionText": "Eu te amo, Diana. Acho que já faz um tempo.",
                  "icon": "GUI/heart4",
                  "emotion": "Characters/Diana/Emotions/standing cleavage/shocked",
                  "responseText": "Espera—o quê? Você não pode simplesmente... porra. Eu... merda. Não estava pronta para ouvir isso. Minha cabeça está uma bagunça, meu coração está acelerado, e nem sei o que devo dizer.",
                  "followUpOptions": [
                    {
                      "optionText": "Você precisa de um minuto?",
                      "emotion": "Characters/Diana/Emotions/standing cleavage/closed eyes",
                      "responseText": "Sim... talvez? Porra. Não esperava me sentir assim. Você me pegou de surpresa, e agora estou me afogando em sentimentos que nem sabia que tinha."
                    },
                    {
                      "optionText": "Apenas me diga a verdade—como você se sente de verdade?",
                      "icon": "GUI/heart4",
                      "emotion": "Characters/Diana/Emotions/standing cleavage/happy crying",
                      "responseText": "A verdade? Isso me aterroriza. Porque acho... não, eu *sei* que também estou apaixonada por você. Parece imprudente e estúpido, mas caramba, não consigo evitar.",
                      "followUpOptions": [
                        {
                          "optionText": "É realmente você falando, ou apenas os hormônios?",
                          "emotion": "Characters/Diana/Emotions/standing cleavage/closed eyes",
                          "responseText": "Eu gostaria que fosse tão simples. Esses sentimentos já estavam aqui muito antes de você me engravidar. Os hormônios apenas tornaram impossível escondê-los."
                        },
                        {
                          "optionText": "Diana, vamos fazer isso dar certo. Eu prometo.",
                          "emotion": "Characters/Diana/Emotions/standing cleavage/happy crying",
                          "responseText": "Eu acredito em você. E, sinceramente, agora isso me assusta mais do que qualquer coisa. Mas é bom. Talvez assustador signifique que é real."
                        },
                        {
                          "optionText": "*beijá-la*",
                          "icon": "GUI/heart4",
                          "changeSprite": "Characters/Diana/kiss",
                          "newSpriteXPos": 0.4,
                          "newSpriteYPos": 0.49,
                          "emotion": "none",
                          "specialEffects": ["Blackout"],
                          "responseText": "*suspiro suave* ...Deus, eu queria isso. Há tanto tempo. *chupa*",
                          "followUpOptions": [
                            {
                              "optionText": "*abraçá-la forte, não dizer nada*",
                              "responseText": "*se inclina em você* ...Você não precisa dizer nada. Eu já sei. Apenas não me solte."
                            },
                            {
                              "optionText": "*sussurrar* Não vou a lugar nenhum. Nunca.",
                              "responseText": "*olhos se enchem de lágrimas* ...Então fique. Exatamente assim. Pelo maior tempo que puder.",
                              "changeSprite": "Characters/Diana/standing cleavage 2",
                              "emotion": "none",
                              "newSpriteXPos": 1.4,
                              "newSpriteYPos": -0.72,
                              "followUpOptions": [
                                {
                                  "optionText": "Vamos convencer a polícia da pureza. Você vai ficar bem aqui.",
                                  "responseText": "É melhor. Porque se eu te perder, perco tudo. E isso não é uma opção.",
                                  "fadeOutCharacter": true,
                                  "addObjective": "Help Diana Avoid Exile",
                                  "dontShowThisCharacterTodayAnymore": true,
                                  "exitLine": true
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "optionText": "Então... o que você quer de mim?",
              "emotion": "Characters/Diana/Emotions/standing cleavage/closed eyes",
              "responseText": "Não sei. Apoio? Presença? Um sinal de que não estou completamente louca por pensar que poderíamos ser algo juntos? Não estou pedindo que você seja perfeito—nem como pai, nem como nada. Apenas seja real comigo."
            },
            {
              "optionText": "Isso não é problema meu. Nunca me inscrevi para isso.",
              "emotion": "Characters/Diana/Emotions/standing cleavage/crying",
              "responseText": "*chora, voz embargada* ...Certo. Claro que não. Tola eu, pensando que você poderia realmente se importar. Esqueça o que eu disse. Esqueça *de mim*.",
              "fadeOutCharacter": true,
              "progressionEventPlayed": "refusedToBeFatherForDiana",
              "exitLine": true
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Vá se precisar. Mas por favor... volte. Não é algo que quero enfrentar sozinha. Não mais.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Aí está você. Precisamos conversar. E antes que diga qualquer coisa—apenas escute, ok?"
  ]
}
