{
  "options": [
    {
      "optionText": "Te peguei no flagra, Diana. Ou devo dizer, com os dedos vermelhos?",
      "emotion": "Characters/Diana/Emotions/laying_naked_opened_eyes",
      "specialEffects": ["removeBlur", "removeVignette"],
      "responseText": "Oh, por favor. Se você vai me assistir *'polindo minha buceta'*, o mínimo que poderia fazer é não ser tão ruim de piada.",
      "followUpOptions": [
        {
          "optionText": "[Denunciá-la para a Polícia da Pureza]",
          "responseTexts": [
            "Vá em frente, dedo-duro. Só não se esqueça de dizer a eles quanto tempo você ficou aí assistindo antes de decidir dedurar. Com certeza mencionarei como você não conseguia tirar os olhos de mim.",
            "Que p--?! Seu dedo-duro! Vá em frente, me denuncie, mas não finja que não estava pensando em participar. Só lembre-se: dedos-duros não ganham... nada. E quero dizer nada mesmo."
          ],
          "exitLine": true,
          "reported": 5,
          "fadeOutCharacter": true,
          "emotion": "Characters/Diana/Emotions/laying angry"
        },
        {
          "optionText": "Você é bem convencida para alguém que arriscou levar uma porrada de Cassetete Bonk na cara.",
          "emotion": "Characters/Diana/Emotions/laying_naked_opened_eyes",
          "responseText": "Oh, querido, já levei golpes maiores dormindo. Você realmente acha que esses rejeitados de spandex podem me parar? Eu poderia tê-los *implorando* para me deixarem em paz em cinco minutos."
        },
        {
          "optionText": "Se for para quebrar as regras, pelo menos me convide da próxima vez.",
          "responseText": "*Você*? Oh, docinho, você não duraria cinco segundos na mesma sala que eu. Você teria uma cãibra antes mesmo de começarmos.",
          "followUpOptions": [
            {
              "optionText": "Você fala grosso para alguém que acabou de fazer uma bagunça.",
              "emotion": "Characters/Diana/Emotions/laying_naked_opened_eyes",
              "responseText": "Uma bagunça? Isso foi *arte*."
            }
          ]
        }
      ]
    }
  ],
  "auto_lines": ["Ah, foi incrível... ♥"]
}
