{
  "options": [
    {
      "optionText": "Como está nosso pequeno?",
      "onlyShowIfProgressionEventPlayed": "diana_gave_birth",
      "responseText": "Está ótimo! Eles estão crescendo a cada dia. A paternidade te cai bem, sabia? Quer passar um tempo em família juntos?",
      "followUpOptions": [
        {
          "optionText": "Eu adoraria. Vamos vê-los juntos.",
          "responseText": "Perfeito! Tenho certeza de que eles ficarão animados em te ver. Vamos fazer um dia em família.",
          "relationshipPoints": 2,
          "isHangingOutWithDiana": true,
          "exitLine": true
        },
        {
          "optionText": "Talvez mais tarde. Só queria dar uma olhada.",
          "responseText": "Certo, eles estarão aqui quando você estiver pronto. Obrigada por verificar.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Ei, Diana, eu uh... preciso de um favor.",
      "icon": "GUI/quest mark",
      "dontShowIfProgressionEventPlayed": "diana_panties_received",
      "onlyDisplayIfHasObjective": "Get Diana's Panties for Jass",
      "responseText": "Mmm, um favor, hein? Isso soa perigoso vindo de você. O que é? Desembucha antes que eu fique entediada.",
      "followUpOptions": [
        {
          "optionText": "Estou, uh, coletando algo para um... experimento do refúgio. Sabe, coisas de ciência. Posso pegar sua... um... calcinha?",
          "responseText": "Ah, calcinha? Bem, eu adoro um homem da pesquisa... mas não. Se alguém vai fazer experimentos com minha calcinha, serei eu. Boa tentativa, no entanto.",
          "followUpOptions": [
            {
              "optionText": "Sabe, estou apenas pedindo por... um pedaço de tecido. Nada muito estranho, certo?",
              "responseText": "Um pedaço de tecido? Querido, essa é a forma mais indireta que já ouvi alguém pedir minha roupa íntima. O que vem a seguir, quer pegar meu sutiã emprestado também?"
            },
            {
              "optionText": "É para um, uh... amigo. Eles me desafiaram. Posso, por favor, pegar um par?",
              "responseText": "Ah, coitadinho, perdeu uma aposta? Eu quase sentiria pena de você se não fosse tão adoravelmente desesperado. Ainda assim, não vou entregar minha calcinha só para salvar sua bunda. Mais sorte na próxima aposta."
            },
            {
              "optionText": "Ok, tudo bem, você me pegou. Alguém no refúgio... uh, me pediu para pegá-las. Não pergunte por quê.",
              "responseText": "Ahh, então você é o novo garoto de entregas para pervertidos do refúgio, hein? Fofo. Diga ao seu admirador misterioso que eles terão que vir implorar pessoalmente se realmente quiserem colocar as mãos na minha lingerie.",
              "followUpOptions": [
                {
                  "optionText": "Imaginei que você diria não. Tinha que tentar, né?",
                  "responseText": "Oh, fico feliz que tentou. Mas, querido, eu não distribuo minhas calcinhas como macacões do refúgio. Continue sonhando."
                },
                {
                  "optionText": "Vamos, Diana, você me conhece. Passamos por poucas e boas. Apenas me ajude?",
                  "relationshipRequired": 35,
                  "changeSprite": "Characters/Diana/new NSFW/sitting no panties",
                  "newSpriteXPos": 0.59,
                  "newSpriteYPos": -0.57,
                  "progressionEventPlayed": "diana_panties_received",
                  "giveItem": "Diana's Panties",
                  "exitLine": true,
                  "dontDisplayIfObjectiveComplete": "Get Diana's Panties for Jass",
                  "failedCheckResponse": "Uau, que jogada ousada. Talvez comece com, tipo, um manual da Vault-Tec sobre 'Interação Humana Básica' antes de ir direto para as coisas estranhas. Boa tentativa, no entanto. Pontos pelo... entusiasmo?",
                  "responseText": "*Risos* Oh, tudo bem. Acho que você mereceu depois de todo esse tempo. Quer que eu me dispa aqui mesmo? Certo. Aproveite o show, querido. ♥︎"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "[Entregar Lingerie]",
      "icon": "GUI/quest mark",
      "responseText": "Oh, meu... eu sabia que você tinha bom gosto, mas isso? Querido, você se superou! São fabulosas! Obrigada!",
      "onlyDisplayIfHasObjective": "Get lingerie for Diana",
      "giveItemToCharacter": "Red Lingerie",
      "itemRequired": "Red Lingerie",
      "relationshipPoints": 15,
      "markObjectiveComplete": "Get lingerie for Diana",
      "exitLine": true
    },
    {
      "optionText": "[Entregar Dildo]",
      "icon": "GUI/quest mark",
      "responseText": "Oh, meu... você realmente sabe como satisfazer os desejos de uma garota. Esperei o dia todo para alguém me entregar um... dildo grande e firme. Obrigada.",
      "onlyDisplayIfHasObjective": "Get dildo for Diana",
      "giveItemToCharacter": "Monster Dildo",
      "itemRequired": "Monster Dildo",
      "relationshipPoints": 20,
      "markObjectiveComplete": "Get dildo for Diana",
      "exitLine": true
    },
    {
      "optionText": "Você viu o que está acontecendo? O refúgio virou uma orgia completa!",
      "gripGaugeRequired": 5000,
      "hideOptionIfReqCheckFailed": true,
      "responseText": "Ah, você quer dizer o 'Sirirocalipse'? Sim, eu notei. Tive um lugar na primeira fila para a orgia no Restaurante. Um cara usou uma pilha de purê de batatas como lubrificante. Realmente comove.",
      "followUpOptions": [
        {
          "optionText": "Eu talvez, uh… tenha tido algo a ver com isso. Eu meio que ajudei o Líder da Resistência da Masturbação… sabe, a distribuir algum, uh, material de masturbação.",
          "responseText": "Então é por isso que encontrei uma assinatura para todo o refúgio de ‘Bumbuns Pré-Guerra Mensal’ debaixo da minha porta. Eu deveria saber que você estava envolvido. Você sozinho transformou este lugar de um convento em um estúdio de cinema adulto."
        },
        {
          "optionText": "Então… você está de boa com todo esse caos?",
          "responseText": "De boa com isso? Por favor. Eu esperei por este dia desde que me deram meu primeiro panfleto de castidade do refúgio. Ver a Polícia da Pureza se atrapalhar enquanto as pessoas estão literalmente se masturbando nos corredores? Esse é o tipo de justiça poética pela qual eu vivo."
        }
      ]
    },
    {
      "optionText": "Quem é você?",
      "closeEyes": true,
      "responseText": "Oh, querido, sou apenas o lembrete vivo e ambulante do refúgio do que você não pode ter. Diana Rivers, embora a maioria por aqui me chame apenas de ‘Seca’.",
      "followUpOptions": [
        {
          "optionText": "Por que te chamam de 'Seca'?",
          "emotion": "none",
          "responseText": "É um apelido. Como um sinal de aviso. Sabe, 'Cuidado: Zona Proibida para Masturbação Além Deste Ponto.' Além disso, é irônico. Se você gosta desse tipo de coisa. Sabe, como chamar um careca de ‘Cacheado’."
        },
        {
          "optionText": "Qual foi a coisa mais divertida que você já fez aqui?",
          "emotion": "none",
          "responseText": "<i>Diversão?</i> Neste refúgio? Você deve ser novo. Mas deixe-me ver… Uma vez, substituí todas as garrafas de água da Polícia da Pureza por vodca. Spandex, más decisões e sobriedade não combinam, pode acreditar. Nunca vi um homem tentar prender o próprio reflexo antes daquele dia."
        },
        {
          "optionText": "Já esteve na Câmara da Vergonha?",
          "closeEyes": true,
          "responseText": "Estive lá? Querido, eu tenho um tempo compartilhado. Eles continuam achando que podem me envergonhar para ser uma 'boa menina'. A piada é com eles; estou colecionando chapéus de burro como troféus."
        },
        {
          "optionText": "Por que você fica neste refúgio?",
          "closeEyes": true,
          "responseText": "Eu me pergunto isso todas as manhãs enquanto tomo meu café. Mas onde mais vou encontrar um lugar onde as pessoas entram em pânico ao ver tornozelos? Este refúgio é meu experimento social, e estou aqui para o longo prazo. Além disso, sair significaria colocar um sutiã de verdade, e não estou pronta para esse tipo de compromisso."
        }
      ]
    },
    {
      "optionText": "Este é o seu gato?",
      "emotion": "none",
      "responseText": "Sim, este é o Sir Bigodes Terceiro. Ele é meu suserano de apoio emocional.",
      "followUpOptions": [
        {
          "optionText": "Posso fazer carinho nele?",
          "emotion": "none",
          "responseText": "Faça por sua conta e risco; o último cara que tentou perdeu seu autorrespeito e metade do rosto. Mas ei, pelo menos o Sir Bigodes se divertiu um pouco por cinco minutos."
        },
        {
          "optionText": "Esse gato parece que engoliu outro gato.",
          "closeEyes": true,
          "responseText": "Mmm, sim, o Sir Bigodes não é gordo—ele está apenas... maximizando sua área de superfície para preguiça máxima."
        },
        {
          "optionText": "Acho que ele está me julgando.",
          "closeEyes": true,
          "responseText": "Claro que está. Ele julga todo mundo. Sir Bigodes não tolera camponeses o tocando, a menos que você tenha oferecido a ele um sacrifício primeiro."
        }
      ]
    },
    {
      "optionText": "Quero te perguntar uma coisa... [<color=purple>Opções Safadas</color>]",
      "closeEyes": true,
      "icon": "GUI/heart4",
      "responseTexts": [
        "Oh, se for um pedido de casamento, certifique-se de se ajoelhar com os dois joelhos. Um só não é suficiente para mim.",
        "Deixe-me adivinhar, você quer me perguntar se eu leio mentes? Porque a resposta é não, e também sim.",
        "Se for outra pergunta de ‘Como você se mantém tão gostosa?’, eu juro, vou cobrar entrada da próxima vez.",
        "Deixe-me adivinhar, você quer saber como eu continuo driblando a Polícia da Pureza? Duas palavras: Túneis. Secretos."
      ],
      "followUpOptions": [
        {
          "optionText": "Então, uh, o que você está usando por baixo desse macacão?",
          "relationshipRequired": 20,
          "desireRequired": 30,
          "emotion": "none",
          "changeSprite": "Characters/Diana/new NSFW/resized/sitting naked",
          "newSpriteXPos": 0.59,
          "newSpriteYPos": -0.57,
          "failedCheckResponse": "Você gostaria de saber, né, Sr. FBI. Aqui vai uma dica: é definitivamente algo que você nunca verá na vida real. Que tal você se concentrar no seu dever de batata em vez do que está sob minhas roupas, hmm?",
          "responseText": "Você realmente quer saber? Ok, mas só porque pediu com tanto jeitinho. Surpresa! Não é nada que você já tenha visto neste pequeno e triste refúgio. Tocar vai te custar, no entanto. Tem algo a oferecer além desses olhos de cachorrinho?",
          "followUpOptions": [
            {
              "optionText": "Posso cheirar essa calcinha? Aposto que cheira a... liberdade.",
              "relationshipRequired": 30,
              "desireRequired": 35,
              "changeSprite": "Characters/Diana/new NSFW/sitting no panties",
              "newSpriteXPos": 0.59,
              "progressionEventPlayed": "diana_panties_received",
              "newSpriteYPos": -0.57,
              "giveItem": "Diana's Panties",
              "dontDisplayIfObjectiveComplete": "Get Diana's Panties for Jass",
              "failedCheckResponse": "Uau, que jogada ousada. Talvez comece com, tipo, um manual da Vault-Tec sobre 'Interação Humana Básica' antes de ir direto para as coisas estranhas. Boa tentativa, no entanto. Pontos pelo... entusiasmo?",
              "auto_lines": [
                "Liberdade, huh? Mais para decepção e arrependimento. Mas claro, se esse é o seu fetiche. Vá em frente, dê uma cheirada. Só tente não desmaiar com a pura grandiosidade. Ou, sabe, com o cheiro de desespero que paira neste refúgio."
              ]
            }
          ]
        },
        {
          "optionText": "Ouvi dizer que há um Botão de Liberação de Emergência em algum lugar. Quer procurar junto?",
          "relationshipRequired": 35,
          "desireRequired": 45,
          "emotion": "none",
          "icon": "GUI/heart4",
          "targetCharacterShouldHaveItems": "Vibrator",
          "failedCheckResponse": "Ah, você quer dizer o botão mítico que supostamente transforma este refúgio em um palácio de orgias? Sim, tenho certeza que está ao lado do botão de ‘Aumento Instantâneo de QI’ que você deveria ter apertado ao entrar. Além disso, se eu quisesse uma liberação, eu apenas deixaria meu gato rasgar meus móveis de novo. Muito mais satisfatório.",
          "responseText": "Por que procurar algum botão quando a verdadeira liberação de emergência está bem aqui? <i>*Ela de repente pega um vibrador de uma gaveta.*</i> Quem precisa de revistas velhas e mofadas quando se tem energia de bateria e imaginação? Fique por aqui e assista ao show.",
          "followUpOptions": [
            {
              "optionText": "[Assistir]",
              "changeSprite": "Characters/Diana/new NSFW/resized/vibrator",
              "newSpriteXPos": 0.55,
              "newSpriteYPos": -0.72,
              "icon": "GUI/heart4",
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "specialEffects": ["Blackout"],
              "endingEffects": ["Flashes"],
              "progressionEventPlayed": "diana_vibrator_lewd_request_diana_room",
              "spriteAtTheEndOfHscene": "Characters/Diana/new NSFW/sitting no panties",
              "emotionsDuringHevent": [
                "Characters/Diana/Emotions/vibrator lewd req/v1",
                "Characters/Diana/Emotions/vibrator lewd req/v2",
                "Characters/Diana/Emotions/vibrator lewd req/v3",
                "Characters/Diana/Emotions/vibrator lewd req/v4"
              ],
              "spriteAtTheEndOfHscenePosition": [0.59, -0.59],
              "lineAfterHevent": "Ahh... foi incrível... ♥︎",
              "swapAnotherCharacterDialogue": [
                "Diana",
                "Characters/Diana/Dialogues/after_vibrator_lewd_req"
              ],
              "reduceDesireAfterAutoLines": 10,
              "hEventName": "diana_vibrator",
              "auto_lines": [
                "Ooh, é como se... ahhh... fosse feito só para a minha buceta... mmmmm ♥.",
                "Mmm, mmmm... é como se minha buceta estivesse esperando por isso para sempre ♥.",
                "Porra, estou tão molhada que poderia regar o jardim do refúgio com esta buceta. Espero que tenha trazido um colete salva-vidas, porque está prestes a inundar. Ahh... ♥",
                "Oh, você gosta disso? Me vendo brincar com minha buceta como se fosse um maldito videogame? Aposto que você se daria mal neste nível, docinho. ♥︎",
                "Juro, se eu tivesse essa coisa anos atrás, eu já teria governado este refúgio... ohhh ♥.",
                "Juro, toda vez que você pisca, minha buceta fica mais molhada. Continue olhando, talvez você me faça afogar na minha própria porra. Ahh... sim! ♥",
                "Você já viu uma buceta tão perfeita? Não? É porque este é o tipo de conteúdo premium que você não encontra em nenhum outro lugar ♥︎",
                "Mmm, você está tão perto que provavelmente consegue sentir o quão molhada estou. Sejamos realistas, este é o melhor cheiro que este refúgio já teve. ♥︎ Ahh!",
                "Estou prestes a gozar tanto que eles vão me ouvir lá do escritório do Supervisor. Quem sabe, talvez ele mande um bilhete de agradecimento. Ahh...! ♥︎",
                "Toda vez que você olha, eu fico mais quente. Continue assim, e esta buceta vai precisar de seu próprio extintor de incêndio. ♥︎ Porra, sim!",
                "Aposto que você nunca viu uma garota se fazer gozar sem precisar da ajuda de um triste morador de refúgio. Acho que você está aprendendo algo hoje, hein? Ahh!",
                "Pense na minha buceta como um enigma. A resposta é sempre ‘Sim, por favor’, mas boa sorte para ter a chance de resolvê-lo. ♥︎",
                "Ohhh, é como se tivesse um mapa para minha buceta... mmm, porra, como está fazendo isso?",
                "Ohhh, porra, bem aí... sim, minha buceta precisava tanto disso ♥︎",
                "Deus, estou tão molhada, poderia afogar um Deathclaw neste suco de buceta. Ahh...!",
                "Mmmm, é como se... porra, fosse feito para mim... ahh, perfeito ♥.",
                "Vê isso? É assim que uma mulher de verdade parece quando está molhada. Não aquelas pequenas fantasias tristes com as quais você se masturba nos chuveiros. ♥︎",
                "Quem fez isso deveria ter sido o cientista-chefe da Vault-Tec... eles sabiam exatamente do que precisávamos. ♥︎",
                "Porra, minha buceta está mais molhada que uma Nuka-Cola em um dia quente. Se eu continuar, vamos precisar de um salva-vidas aqui. Ahh...! ♥︎",
                "Ohhh, porra, está tão fundo… oh deus, estou pingando por todo lado… mmm, ohhhh ♥",
                "Vá em frente, bata uma enquanto assiste. Só tente não sujar o chão com sua porra, ok? ♥︎ Ahh!",
                "Mmm, porra, este vibrador é a melhor coisa que me aconteceu desde… bem, desde sempre… ahhh, sim. ♥︎",
                "Oh, sim! Estou tão perto, vou gozar tanto que as luzes do refúgio vão piscar. Queda de energia cortesia da minha buceta. Ahh...! ♥︎",
                "Mmm, ohhh deus, vou gozar… ahhh... siim, porra, é tão bom… ♥",
                "Mmm, aposto que você está desejando poder enfiar esse pau aqui agora, não está? Pena que minha buceta tem uma lista VIP ♥︎",
                "Ahhh, vou gozar. Espero que esteja pronto para a zona de respingos, porque esta buceta está prestes a fazer uma bagunça. Ahh, ♥︎ sim, sim!"
              ]
            }
          ]
        },
        {
          "optionText": "Já ficou sozinha? Sabe, precisando de... companhia?",
          "relationshipRequired": 45,
          "desireRequired": 40,
          "emotion": "none",
          "icon": "GUI/animated icon",
          "targetCharacterShouldHaveItems": "Monster Dildo",
          "failedCheckResponse": "Sozinha? Ah, eu nunca fico sozinha. Entre os olhares mortais do meu gato e o som constante da Polícia da Pureza tendo um colapso mental, estou ocupada demais me divertindo. Mas obrigada pela oferta, Casanova. Se eu precisar de alguém para segurar minhas sacolas, eu te aviso.",
          "responseText": "Sozinha? Oh, querido, eu tenho muita companhia bem aqui. <i>*Ela tira um pequeno dildo rosa de debaixo do travesseiro e o acena em sua direção.*</i> Mas se você está oferecendo uma demonstração ao vivo, sou toda ouvidos... e outras partes.",
          "followUpOptions": [
            {
              "optionText": "Se importa se eu apenas assistir? Vou manter minhas mãos para mim, prometo.",
              "icon": "GUI/animated icon",
              "responseText": "Oh, então você é do tipo 'senta no canto e anota'? Posso trabalhar com isso. <i>*Ela pega seu dildo, segurando-o como um troféu.*</i> Certo, garoto voyeur, quer um lugar na primeira fila para o evento principal? É melhor você tirar fotos mentais, porque este show não tem reprises.",
              "followUpOptions": [
                {
                  "optionText": "[Assistir]",
                  "icon": "GUI/animated icon",
                  "changeSprite": "Characters/Diana/Resized/dildo",
                  "interactable": "Characters/Diana/Interactables/dildo",
                  "newSpriteXPos": 0.25,
                  "newSpriteYPos": 0,
                  "specialEffects": ["Blackout"],
                  "endingEffects": ["Flashes"],
                  "interactableBGcolor": "#747474",
                  "spriteAtTheEndOfHscene": "Characters/Diana/new NSFW/sitting no panties",
                  "emotionsDuringHevent": [
                    "Characters/Diana/Emotions/riding dildo/1",
                    "Characters/Diana/Emotions/riding dildo/2",
                    "Characters/Diana/Emotions/riding dildo/3",
                    "Characters/Diana/Emotions/riding dildo/4"
                  ],
                  "swapAnotherCharacterDialogue": [
                    "Diana",
                    "Characters/Diana/Dialogues/after_dildo_lewd_req"
                  ],
                  "spriteAtTheEndOfHscenePosition": [0.59, -0.59],
                  "lineAfterHevent": "Ahh... foi incrível... ♥︎",
                  "closeDialogueOptions": true,
                  "isHEventStarted": true,
                  "reduceDesireAfterAutoLines": 10,
                  "hEventName": "diana_riding_dildo",
                  "auto_lines": [
                    "Mmm, toda vez que eu cavalgo neste dildo, imagino que é seu pau. Melhor entrar na fila, porque esta buceta tem uma lista de espera. ♥︎ Ahh...",
                    "Porra, estou pingando como uma torneira vazando. Tem um rodo, querido? Porque estou prestes a inundar este refúgio. Ahh, ♥︎!",
                    "Ouviu isso? É o som da minha bunda implorando por mais. Estou tão molhada, poderia começar um tsunami. Ahh, oh sim!",
                    "Mmm, cada estocada me deixa mais molhada. Você quase consegue ouvir minha buceta ronronar. Como um motor acelerando, e estou prestes a gozar tanto, que vou parar de funcionar. Ahh, ♥︎!",
                    "Oh deus, vou gozar tanto, que vai parecer que um terremoto atingiu este refúgio. Segure-se em algo, querido, porque a porra vai ficar séria! ♥︎ Ahh!",
                    "Vê isso? Meu dildo está todo encharcado, e nem estou perto de terminar. Esta buceta é como um escorregador aquático—aposto que você quer mergulhar, hein? Mmm, ♥︎",
                    "Mmm, oh... você gosta de assistir a isso, não é? Me vendo gozar em todo este dildo como uma vadiazinha suja ♥.",
                    "Mmm, isso mesmo, mantenha seus olhos nisso. Estou ficando tão molhada, que poderia afogar um ghoul na minha buceta. Ahh, oh sim!",
                    "Porra, porra, porra, estou tão perto. Espero que esteja com sede, porque vai ter suco suficiente para todo mundo. ♥︎",
                    "Oh, porra, sim, você gosta do que vê? Esta buceta está mais molhada que um colapso nuclear. Me veja fazer chover, baby. ♥︎",
                    "Ahhh... Você deveria ter me dado isso antes... Agora eu tenho algo que realmente sabe como fazer o trabalho... ♥",
                    "Awww, olhe para você... todo quente e incomodado enquanto eu me fodo com seu presente... Ohhh, tão atencioso da sua parte... Mmmm ♥",
                    "Mmm, apenas pense nisso. Minha buceta molhada no seu rosto, pingando como uma torneira, e você lambendo tudo como um cachorro com sede. Oh sim, ahh!",
                    "Quero que você me veja gozar tanto, que vai precisar de uma capa de chuva. Esta buceta é um hidrante, e você está bem na frente dela. Mmm, ♥︎!",
                    "Mmm, porra, isso é muito melhor do que com a mão... ohhh, continue assistindo, pervertido... ♥",
                    "Oh, você gosta quando eu brinco com meu brinquedo? Bom, porque minha buceta vai ficar tão vermelha, que vai parecer uma luz de emergência. Ahh, ♥︎",
                    "Mmm, porra, sim. Vou esguichar tanto. Prepare-se para se abaixar e se proteger, docinho. Ahh, ♥︎!",
                    "Ohhh, porra, sim... oh,... eu poderia me acostumar com isso... Quem precisa de um homem quando tenho este dildo me arrebentando ♥?",
                    "Toda vez que eu o deslizo para dentro, é como mergulhar em uma piscina de mel. Pegajoso, doce, e implorando para ser lambido até ficar limpo. Mmm, oh, sim ♥︎!",
                    "Oh deus, consigo sentir minha buceta se contraindo. É como um torno. Esta buceta tem vida própria, e está com fome. ♥︎ Ahh!",
                    "Finalmente, algo neste refúgio que sabe tratar meu cu do jeito certo ♥.",
                    "Ahh, porra, minha buceta está pulsando. É como um batimento cardíaco entre minhas pernas, bombeando, pulsando, implorando por porra ♥︎",
                    "Mmm, estou pingando pelas coxas agora. Esta buceta está mais molhada que um chuveiro, e você está prestes a se molhar. Ahh, ♥︎",
                    "Porra, estou tão perto. Minha buceta é como um vulcão prestes a explodir, e quando isso acontecer, você vai desejar ter trazido um guarda-chuva. Ahh, oh sim, ♥︎!",
                    "Mmm, eu amo provocar esta buceta. É como brincar com dinamite—um movimento errado, e eu vou explodir sua mente. Ahh, ♥︎",
                    "Oh porra, vou gozar tanto, que o refúgio inteiro vai me ouvir. Espero que goste de garotas barulhentas. Ahh, ♥︎ sim!",
                    "Se alguém me ouvisse agora, eu teria um cassetete no cu pela manhã. Mas por isso, vale a pena ♥︎",
                    "Sim, sim, ohh ♥... finalmente algo que me cala e fala com minha buceta ♥.",
                    "Ohhhh, estou tão perto... Mmm,... este dildo vai me fazer gozar tanto... ♥",
                    "Mmm, porra, estou gozando... ohhh... ahhhh, porra..."
                  ]
                }
              ]
            },
            {
              "optionText": "Seu dildo é legal, mas aposto que eu faria melhor. Quer uma performance ao vivo?",
              "relationshipRequired": 60,
              "desireRequired": 60,
              "responseText": "Certo, Sr. Falastrão, vamos ver o que você tem. Mas aviso justo, tenho um tempo de atenção muito curto para decepções. É melhor você durar mais que uma pilha AA, porque se não, volto para a caixa de brinquedos. Agora, tire a roupa e me impressione!",
              "followUpOptions": [
                {
                  "optionText": "[Foder ela]",
                  "changeSprite": "Characters/Diana/new NSFW/resized/anal sex",
                  "interactable": "Characters/Diana/Interactables/sex",
                  "newSpriteXPos": 0.6,
                  "newSpriteYPos": -0.16,
                  "specialEffects": ["Blackout"],
                  "endingEffects": ["Flashes"],
                  "interactableBGcolor": "#747474",
                  "icon": "GUI/animated icon",
                  "spriteAtTheEndOfHscene": "Characters/Diana/in cum/sitting on the table in cum",
                  "spriteAtTheEndOfHscenePosition": [0.43, -0.4],
                  "swapAnotherCharacterDialogue": [
                    "Diana",
                    "Characters/Diana/Dialogues/after_sex"
                  ],
                  "lineAfterHevent": "Ahh... foi incrível... ♥︎",
                  "closeDialogueOptions": true,
                  "isHEventStarted": true,
                  "reduceDesireAfterAutoLines": 18,
                  "addPerk": "got_diana_pregnant",
                  "progressionEventPlayed": "diana_sex_lewd_request_diana_room",
                  "hEventName": "PlayerSex_dRoom",
                  "auto_lines": [
                    "Oh, você acha que é uma montaria melhor que este garotão? Vamos ver se você consegue fazer minha buceta ronronar mais alto que o Sr. Buzz na velocidade máxima.",
                    "Mmm, ♥︎, tire a roupa e me mostre se você tem mais caldo que essas baterias. Minha buceta está mais molhada que um Deathclaw no cio, e você está prestes a ser arranhado.",
                    "Porra, já estou encharcada. Venha aqui e entre, ou está com medo que seu joystick não se compare aos meus brinquedos?",
                    "Ahh, ♥︎, sim! Me faça gozar tanto que o refúgio vai precisar de um rodo, e vou garantir que você nunca mais precise descascar batatas.",
                    "Ajoelhe-se e adore esta buceta como se fosse a última gota de Nuka-Cola na wasteland, ou volte a se masturbar na Câmara da Vergonha.",
                    "Ahh, ♥︎ mais forte! Se você não me fizer esguichar, vou contar para todo mundo no refúgio que você é mais seco que o Deserto de Mojave. Acha que aguenta, garanhão?",
                    "Mmm, porra, é melhor você vir aqui e começar a trabalhar neste clitóris antes que o Sr. Buzz te vença. O primeiro a me fazer gozar ganha o direito de se gabar e talvez um boquete depois.",
                    "Oh, porra, sim, ♥︎! Me bata como a porta do refúgio durante uma tempestade de radiação! Me faça gritar como se eu estivesse no Botão de Liberação de Emergência!",
                    "Ahh, ♥︎, é isso! Minha buceta está mais molhada que a bunda de um Mirelurk. Se você não me fizer gozar, vou te jogar para a Polícia da Pureza só de algemas.",
                    "Caramba, ♥︎, meu dildo pode ser bom, mas quero que seu pau atinja lugares que me façam ver estrelas. Faça minha buceta parecer o 4 de Julho, baby!",
                    "Ahh, porra, sim! Me mostre que você não é só mais um garoto do refúgio com papo furado. Me faça gozar tanto que esqueço meu próprio nome!",
                    "Sim, isso mesmo, ♥︎, continue. Me deixe mais molhada que a boca de um Ghoul. Se você conseguir me fazer gozar, vou gritar tão alto que o Supervisor vai pensar que há uma rebelião.",
                    "Mmm, ♥︎, você está me deixando perto! Se conseguir me fazer gozar mais rápido que o Sr. Buzz, vou deixar você provar o brilho posterior direto da fonte.",
                    "Oh, porra, ♥︎, minha buceta está doendo por você! Se você não me encher agora, vou te substituir pelo maior dildo que encontrar e transmitir ao vivo.",
                    "Ahh, porra, sim! Me foda como se o mundo estivesse acabando, e vou deixar você gozar nos meus peitos enquanto te cavalgo até a próxima semana.",
                    "Puta merda, ♥︎, não pare! Minha buceta está tão molhada. Se você me fizer esguichar, vou usar sua porra como se fosse a última moda do refúgio.",
                    "Mmm, ♥︎, estou pingando. É melhor você me foder mais forte que uma barata radioativa chapada, ou vou gozar na sua cara.",
                    "Porra, ♥︎, sim! Me faça gozar tanto, que eles nos ouvirão na Wasteland. Quero que cada morador do refúgio saiba quem está me fazendo gritar esta noite.",
                    "Mmm, ♥︎, continue assim, e te darei uma recompensa que fará seu macacão do refúgio ficar de pé. Acha que aguenta um segundo round?",
                    "Porra, ♥︎, quero que você me encha como se eu fosse uma garrafa de Nuka-Cola, e você a última gota de porra na wasteland. Não derrame uma única gota!",
                    "Oh, você acha que pode foder melhor que meu dildo? Por favor. Esta buceta está mais molhada que a Wasteland na estação das monções, e você está prestes a se afogar, querido.",
                    "Certo, bonitão, tire para fora e vamos ver se você consegue gozar antes que eu termine o segundo round com o Sr. Buzz. Spoiler: você vai precisar de uma toalha quando perder.",
                    "Mmm, esta buceta tem estado mais apertada que uma porta de Refúgio, mas para você? Vou deixar inundar. Só se certifique de saber nadar.",
                    "Você tem uma chance de me foder mais forte que este brinquedo, ou vou te mandar para a Câmara da Vergonha com saco azul e uma história triste.",
                    "Ah, é? Você acha que pode me fazer gozar mais forte que isso? Querido, meu vibrador tem uma configuração que fará seu pau chorar pela mamãe.",
                    "Mmm, me deixe mais molhada que uma Rainha Mirelurk no cio, e talvez eu deixe você provar o verdadeiro sabor da vitória.",
                    "Ahh, porra, é isso. Me mostre o que esse pau pode fazer, ou é voltar a ser o segundo violinista do meu amigo vibrador.",
                    "Você me faz gozar tanto que o Supervisor vai pensar que há um terremoto, e talvez eu deixe você ser meu brinquedo em tempo integral.",
                    "♥︎ É isso, me faça gritar mais alto que um Deathclaw na época de acasalamento. Me mostre que você é mais do que apenas um zé ninguém do refúgio com uma ereção.",
                    "Tenho mais truques nesta buceta do que um Yao Guai em um circo, e estou prestes a te fazer gozar tanto que você esquecerá seu próprio nome.",
                    "Porra, sim, me deixe mais molhada que o cu de um rato de pântano. Se você fizer um bom trabalho, vou garantir que você ande engraçado por uma semana.",
                    "Mmm, ♥︎ você acha que tem o que é preciso para superar este vibrador? Boa sorte, docinho, porque eu quebro homens como você desde antes das bombas caírem.",
                    "Ahh, mais forte, mais rápido! Me foda como se a Wasteland estivesse acabando de novo, e talvez eu deixe você sobreviver às consequências do meu orgasmo.",
                    "Faça esta buceta gozar como se fosse o último dia na Terra, e te recompensarei com uma cavalgada que fará seu Pip-Boy pifar.",
                    "♥︎ Não pare agora, baby. Quero que este refúgio ecoe com o som da sua derrota enquanto eu gozo em cima do seu pequeno ego triste.",
                    "Ahh, sim, me foda como se fosse para valer! Se você me fizer gozar mais forte que meu dildo, vou deixar você se chamar de novo ‘Supersexy-sor’ do Refúgio 6969.",
                    "Mmm, ♥︎ já sinto você tremendo. Não aguenta a pressão? Melhor se esforçar ou calar a boca, porque esta buceta não se contenta com o segundo lugar.",
                    "Ahh, Deus, você é bom. Mas consegue continuar, ou vai gozar antes mesmo de eu suar?",
                    "Mmm, ♥︎ sim, mais forte! Você está me deixando mais molhada que uma Nuka-Cola em um dia quente. Continue assim, e vou garantir que você seja o homem mais invejado do refúgio.",
                    "Ahh, porra, é isso! Me faça gozar tanto que minha buceta esguiche como um cano de água quebrado. Vamos ver se você consegue lidar com a inundação, garotão."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "[Dar um Presente]",
      "emotion": "none",
      "icon": "GUI/gift icon",
      "neverGreyOut": true,
      "isGifting": true
    },
    {
      "optionText": "Quer sair? [Terminar o Dia]",
      "emotion": "none",
      "isHangingOutWithDiana": true,
      "neverGreyOut": true,
      "relationshipPoints": 1,
      "exitLine": true
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Já vai? Eu estava começando a me divertir.",
        "Não suma, ok? É bom ter alguém por perto que aprecie um pouco de caos."
      ],
      "exitLine": true
    }
  ],
  "random_auto_line": [
    "Oh, ei, olhe quem apareceu! Você veio por mim, ou só queria fazer carinho na minha gatinha? A peluda, obviamente!",
    "Qual é o problema, docinho? Perdido? Ou você está aqui esperando ver algo que te dará uma passagem só de ida para a Câmara da Vergonha?"
  ]
}
