{
  "options": [
    {
      "optionText": "Você parece um bug no sonho molhado de um saqueador. O que está fazendo aqui?",
      "icon": "GUI/heart4",
      "responseText": "Ah, sabe, só te dando a chance da sua vida. Você quer mesmo bancar o herói ou quer brincar de... outra coisa? ♥",
      "followUpOptions": [
        {
          "optionText": "Você está tão reprimida assim? Tipo, estamos falando de níveis de 'reator nuclear prestes a explodir'?",
          "responseText": "Oh, querido, estamos falando de níveis de *megaton*. Sou como uma porra de uma bomba-relógio, e você é o único que pode me desarmar... ou me fazer explodir ainda mais forte!"
        },
        {
          "optionText": "Certo, digamos que estou dentro. E agora?",
          "icon": "GUI/heart4",
          "responseText": "Agora? Oh, agora a diversão *de verdade* começa. Mas primeiro, por que você não tranca essa porta e garantimos que ninguém interrompa nossa pequena... diversão? ♥",
          "followUpOptions": [
            {
              "optionText": "Certo.",
              "changeSprite": "Characters/Diana/Resized/sex with player",
              "newSpriteXPos": -1.07,
              "newSpriteYPos": -0.92,
              "icon": "GUI/heart4",
              "spriteAtTheEndOfHscene": "Characters/Diana/in cum/IPAdapter_00842_(1)",
              "interactableBGcolor": "#919191",
              "spriteAtTheEndOfHscenePosition": [4.84, -0.4],
              "interactable": "Characters/Diana/Interactables/sex",
              "specialEffects": ["Blackout"],
              "endingEffects": ["Flashes", "StopShake"],
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "reduceDesireAfterAutoLines": 10,
              "addPerk": "got_diana_pregnant",
              "hEventName": "diana_asking_PlayerSex",
              "auto_lines": [
                "Mmm, você está realmente dificultando ficar quieta... ♥",
                "Ahh, não pare! Eu desejei isso por semanas... oh deus!",
                "Sinto como se estivesse pingando a cada estocada... hnnng, você vai me fazer explodir!",
                "Mmm, seu pau está atingindo todos os pontos certos... ♥ Continue!",
                "Ohhh, consigo sentir os sucos escorrendo pelas minhas coxas... mais, mais!",
                "Porra, eu não estive tão cheia em anos... não se atreva a parar!",
                "Ahh, é isso... me bata como se fosse para valer! ♥",
                "Mmm, você vai me fazer gozar em todo o seu pau... hnnng!",
                "Ahh, mais fundo, quero sentir cada centímetro desse pau... ♥",
                "Você me deixou encharcada... não consigo ter o suficiente disso!",
                "Oh porra, estou tão perto... só mais um pouco...!",
                "Mmm, cada vez que você estoca, eu sinto fundo na minha buceta... não pare agora!",
                "Hnnng, seu pau está me enlouquecendo... vou perder o controle!",
                "Ahhh, você está atingindo todos os pontos certos... porra, estou gozando!",
                "Mmm, consigo sentir seu pau pulsando... você vai me encher de porra?",
                "Ohhh, porra, você está me fazendo gozar tanto... ♥",
                "Ahh, eu amo o jeito que você me alarga... me dê mais!",
                "Mmm, vou espremer cada gota de porra de você... ♥",
                "Oh porra, você está me deixando tão molhada... não consigo mais segurar!",
                "Mmm, quero sentir cada gota da sua porra dentro de mim... não pare até eu estar transbordando!",
                "Ahh, sim, bem aí! Não pare, oh deus, consigo sentir cada centímetro de você—tão fundo... ♥",
                "Mmm, seu pau está tão duro, está me enlouquecendo... hnnng, estou tão perto, não se atreva a parar agora!",
                "Oh porra, você está me enchendo tão perfeitamente... consigo sentir seu pau me alargando, ahhh, sim!",
                "Hahhh, estou pingando, consegue sentir como estou molhada? Oh deus, está escorrendo pelas minhas coxas... ♥",
                "Mmm, seu pau está pulsando tanto, mal posso esperar para sentir sua porra jorrando fundo dentro de mim... hnngh, sim!",
                "Ahhh, mais forte! Me foda mais forte! Quero sentir você me batendo até eu não conseguir pensar direito... ♥",
                "Ohh, sua língua... está me enlouquecendo! Ahh, lamba minha buceta exatamente assim, não pare!",
                "Hnnngh, estou tão perto! Ahhh, não consigo mais segurar... vou gozar!",
                "Sim, sim, sim! Oh porra, eu amo como você me enche tão perfeitamente... mmm, vou gozar tanto!",
                "Hahhh, seu pau é tão bom dentro de mim... ohh, nunca quero que isso pare!",
                "Mmm, sim, seus dedos estão atingindo todos os pontos certos... oh deus, vou explodir!",
                "Ahh, consigo sentir seu pau se contraindo... você vai gozar, não vai? Mmm, me dê, me encha!",
                "Porra, sua porra é tão quente dentro de mim... oh deus, consigo sentir escorrendo... ahhh, sim!",
                "Mmm, suas mãos... elas estão me enlouquecendo, oh porra, estou tão perto de gozar em todo o seu pau!",
                "Ahh, sim, exatamente assim... não pare, não se atreva a parar, quero sentir cada última gota da sua porra dentro de mim... hnngh!",
                "Ohh, você está me deixando tão molhada, consigo sentir meus sucos escorrendo... ahh, porra, quero mais!",
                "Mmm, sim, me foda como se fosse para valer! Ahh, não consigo ter o suficiente do seu pau... ♥",
                "Hnnngh, estou tão perto, ahhh, sim! Me faça gozar, me faça gozar em você!",
                "Ahh, seu pau é tão incrível, não aguento... hnngh, vou enlouquecer!",
                "Mmm, seu pau está tão fundo em mim... consigo sentir sua porra me enchendo, ohh, porra, estou gozando!"
              ]
            }
          ]
        },
        {
          "optionText": "Vou precisar de uma explicação, porque isso parece a preparação para a pior decisão que já tomei.",
          "responseText": "Pior decisão? Querido, se esta é a sua pior, então vou *arruinar* sua definição de 'más escolhas'. Confie em mim, vale a pena.",
          "followUpOptions": [
            {
              "optionText": "Isso deve ser uma piada. Qual é a pegadinha? De jeito nenhum você está aqui só para... 'se divertir'.",
              "responseText": "Sem pegadinha, querido, apenas eu e você e muita 'diversão' esperando para acontecer. A menos que você esteja com muito medo? Quero dizer, isso seria *adorável*, mas decepcionante.",
              "followUpOptions": [
                {
                  "optionText": "Você realmente espera que eu acredite nisso? Você está a dois segundos de se transformar em um ghoul feral com tesão.",
                  "responseText": "Oh, eu já estou lá, querido. Sou feral, sou selvagem e estou por toda parte. Mas ei, poderia ser pior... você poderia ser o Hugh."
                },
                {
                  "optionText": "Então, o quê, fazemos isso e depois? Você me deixa para explicar por que fui estúpido o suficiente para cair nessa?",
                  "responseText": "Não, sem explicações necessárias. Apenas uma boa e velha diversão, и talvez alguns hematomas—se você tiver sorte!"
                }
              ]
            },
            {
              "optionText": "Você parece uma ninfomaníaca louca que acabou de escapar da Polícia da Pureza. Como você entrou aqui?",
              "responseText": "Oh, não se preocupe com *como* eu entrei. Preocupe-se com o que vou fazer agora que estou aqui. Ou, se você tiver sorte, o que vamos fazer juntos. ♥",
              "followUpOptions": [
                {
                  "optionText": "Você tem sorte de eu não chamar a Polícia da Pureza agora mesmo. Isso parece uma armadilha.",
                  "responseText": "Pfft, chame-os! Eles provavelmente apenas se juntariam... ou desmaiariam com o puro calor que emana de mim. Mas sei que você é mais esperto que isso."
                },
                {
                  "optionText": "E se eu disser não? Você simplesmente vai embora, sem problemas?",
                  "responseText": "Se você disser não, terei que encontrar alguém com colhões. Mas ei, eu tinha a sensação de que você era um pouco *mais* do que apenas conversa."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Ah, qual é! Você vai mesmo me expulsar quando estou *assim*? Tudo bem, você quem perde. Mas você vai pensar nisso mais tarde, confie em mim.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Mmm, bom dia, dorminhoco. Espero que não se importe de eu ter passado por aqui... *assim*."
  ]
}
