{
  "options": [
    {
      "optionText": "Quem é você?",
      "responseText": "Meu nome é Lorde da Borda, rei do saco azul e profeta da provocação de pau perpétua. Enquanto todo mundo se masturba para úberes de brahmin, estou aqui na linha entre o prazer e a tortura de pau absoluta—porque a dor é divertida.",
      "followUpOptions": [
        {
          "optionText": "Lorde da Borda? Você está falando sério agora?",
          "responseText": "Seríssimo. Gozar normalmente é para os fracos. Eu vivo a vida permanentemente preso na última estocada antes do gran finale. Já sentiu suas bolas gritarem por misericórdia? Essa merda é meu café da manhã. Os terapeutas do refúgio desistiram de mim anos atrás."
        },
        {
          "optionText": "Planejando gozar para sair daqui algum dia?",
          "responseText": "Para quê? A wasteland não tem nada comparado à casa de diversões fudida entre minhas pernas. Mas se eu sair algum dia, será para mostrar àqueles degenerados torrados pela radiação como um verdadeiro esquisito lida com a frustração sexual."
        },
        {
          "optionText": "O que você acha da Polícia da Pureza?",
          "responseText": "Aqueles nerds sexualmente reprimidos com seus cacetetes de espancamento? A piada é com eles—eu amo ser espancado. Cada pancada de cassetete só me aproxima da agonia orgásmica. Às vezes eu quebro as regras de propósito só para sentir aquela doce, doce pancada nas minhas bolas."
        }
      ]
    },
    {
      "optionText": "Que porra você está fazendo aqui?",
      "responseText": "Atualmente, estou me masturbando perto dessas plantas—pensei que se eu torturasse minhas bolas o suficiente, absorveria alguma radiação ou algo assim. Sinceramente, nem ligo para os poderes; só gosto da emoção de quase gozar perto de tomates radioativos.",
      "followUpOptions": [
        {
          "optionText": "Então você está basicamente se masturbando para plantas agora?",
          "responseText": "Plantas, portas de refúgio, baratas radioativas—tanto faz. Se existe, eu me masturbo perto. Dizem que o homem precisa ter um hobby, certo?"
        },
        {
          "optionText": "Bio-masturbação? Você é doente, cara.",
          "responseText": "Você não faz ideia. Já se masturbou tanto que seu pau brilhou como uma porra de uma Nuka-Cola Quantum? Foi o que pensei."
        }
      ]
    },
    {
      "optionText": "Algum conselho para sobreviver a este refúgio?",
      "responseText": "Não goze. Nunca. Abrace a dor. Deixe suas bolas doerem."
    },
    {
      "optionText": "Tchau.",
      "responseText": "Claro, vá andando. Só lembre-se—da próxima vez que estiver prestes a gozar, imagine meu saco inchado. Aproveite essa gozada arruinada, campeão.",
      "exitLine": true
    }
  ]
}
