{
  "options": [
    {
      "optionText": "Então... como você está aguentando com todo mundo ficando completamente primitivo lá fora?",
      "responseText": "Hah! Estou intocado por esta imundície! Veja bem, eles são escravos de seus desejos mais básicos. Mas eu, eu estou à beira da iluminação! Meu poder está crescendo!",
      "followUpOptions": [
        {
          "optionText": "Cara, você está suando pelas calças. Tem certeza de que não vai explodir como o resto deles?",
          "responseText": "Este suor é um sinal da minha transcendência iminente! A tensão é meu combustível, e estou empurrando os limites do que o corpo pode suportar! Sou... INQUEBRÁVEL!"
        },
        {
          "optionText": "Para mim, parece que você está a um mau pensamento de perder completamente o controle.",
          "responseText": "Você duvida de mim? Ha! Eu sou o Lorde da Borda! Você acha que esses mortais rolando em sua própria imundície podem me abalar?",
          "followUpOptions": [
            {
              "optionText": "Sim, e aposto que sua 'ascensão' envolve se trancar em um banheiro muito em breve.",
              "responseText": "Zombe de mim o quanto quiser, plebeu! Em breve, quando eu atingir minha forma final, você se curvará aos pés da minha contenção!"
            }
          ]
        }
      ]
    },
    {
      "optionText": "O que exatamente acontece quando você 'ascende', afinal? Brilha? Flutua? Talvez um par de asas?",
      "responseText": "Quando eu ascender, não serei mais constrangido pelos limites da carne! Me tornarei pura energia—um ser de pura força de vontade, incorruptível pelo desejo! Serei capaz de... de… resistir… a qualquer coisa!",
      "followUpOptions": [
        {
          "optionText": "Certo. E você vai apenas flutuar acima de todos, observando-os se ocuparem enquanto você está... bem, apenas observando?",
          "responseText": "Observando? Pah! Estarei acima de tais coisas! Enquanto eles acasalam como animais, estarei voando pelo cosmos! Não estarei mais preso por... por... droga, está ficando muito quente aqui!"
        },
        {
          "optionText": "Espere, pura energia? Então, você está dizendo... sem mais *ahem* necessidades? Tem certeza de que é isso que você quer?",
          "responseText": "É o objetivo final! Estar além de tal fraqueza! Para— para... espere... espere, talvez eu não tenha pensado bem nisso...",
          "followUpOptions": [
            {
              "optionText": "Sim, foi o que pensei. Você estará flutuando por aí, entediado pra caralho. Para sempre.",
              "responseText": "Entediado? Eu, o Lorde da Borda, entediado? Impossível! Terei... força... infinita! Certo? CERTO?!"
            },
            {
              "optionText": "Você sentiria falta da diversão, Lorde da Borda. Só trabalho e nenhuma diversão te torna um... cara bem tenso.",
              "responseText": "Não... não, você está errado! Eu não preciso de... diversão. Diversão é para os fracos! É... quero dizer... talvez um pouco de diversão não faria mal..."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Você... um... já ascendeu? Ou ainda está só na borda?",
      "responseText": "Estou no limite! Tão perto! Mais um teste... só um pouco mais... consigo sentir o poder percorrendo meu corpo!",
      "followUpOptions": [
        {
          "optionText": "Uau. Você está realmente forçando a barra. Mas nesse ritmo, não está preocupado em... uh... 'ascender' bem na frente de todo mundo?",
          "responseText": "Bobagem! Tenho controle perfeito! Ascenderei quando eu escolher! Sou o mestre da minha própria liberação! Espere... não desse jeito... você sabe o que quero dizer!"
        },
        {
          "optionText": "Deixe-me adivinhar, mais uma 'sessão' e você desbloqueará o modo deus, hein?",
          "responseText": "EXATAMENTE! Mais um teste da minha resistência, e transcenderei para um plano superior! Serei intocável, inabalável... ahh, tanto poder! Tanta tensão!"
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Hah! Vá andando, mortal. Enquanto você desperdiça sua energia, continuarei meu caminho para a divindade!",
      "exitLine": true
    }
  ]
}
