{
  "options": [
    {
      "optionText": "Trouxe suas cabeças de mutante. Ainda estão moles.",
      "icon": "GUI/quest mark",
      "itemRequired": "Mutant Head",
      "numItemsReq": 5,
      "giveItemToCharacter": "Mutant Head",
      "numOfCopiesToGive": 5,
      "onlyDisplayIfHasObjective": "Bring 5 mutant heads to Enclave",
      "markObjectiveComplete": "Bring 5 mutant heads to Enclave",
      "showChoiceStats": "20_heads",
      "responseText": "Doce Cristo nuclear. Olhe para esse saco de glória fedorenta... Você realmente se superou—cheira a vitória e carne podre. O General Grim vai gozar lágrimas patrióticas quando vir isso.",
      "followUpOptions": [
        {
          "optionText": "Então... posso me juntar ao Enclave agora?",
          "responseText": "Aww, olhe para você. Coberto de tripas e achando que é um de nós agora? Odeio quebrar seu coraçãozinho irradiado, mas carregar crânios de mutantes não te torna do Enclave. Não distribuo senhas como doces, e com certeza não recruto idiotas nascidos em refúgios que acham que lealdade significa contar cabeças. Quer entrar? Vá lamber o cu do Grim e reze para ele cuspir um distintivo. Até lá, você é só mais uma puta de recados com delírios de relevância."
        },
        {
          "optionText": "Onde está meu pagamento?",
          "addCaps": 200,
          "exitLine": true,
          "responseText": "Certo. Caps e um histórico de mortes limpo em nossos arquivos. Você mereceu — não gaste tudo em drogas e putas."
        }
      ]
    },
    {
      "optionText": "Entrega especial da Irmandade da Capital—para seu bravo General Grim.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Deliver the Special Cake to Enclave",
      "itemRequired": "Special Cake",
      "exitLine": true,
      "giveItemToCharacter": "Special Cake",
      "markObjectiveComplete": "Deliver the Special Cake to Enclave",
      "responseText": "Bem, puta que pariu—uma oferenda de paz daqueles idiotas de lata? Não imaginei que aqueles imbecis da Irmandade fossem padeiros. Veremos se Archie gosta de glacê tanto quanto de sapateado. Valeu, entregador—sinta-se à vontade para dar o fora agora."
    },
    {
      "optionText": "Ajudei um de seus caras a limpar o Refúgio 6969. Ele manda lembranças—e umas cem cabeças em estacas.",
      "responseText": "Então você é um dos bastardos doentes por trás daquele banho de sangue glorioso? Você ganhou uma suíte pessoal—e, diabos, inclua uma de nossas filhas mais puras como esposa. Mas ainda preciso de uma senha antes de te deixar passar.",
      "onlyShowIfProgressionEventPlayed": "hansGavePassword",
      "dontShowIfProgressionEventPlayed": "enclavePasscodePassed",
      "icon": "GUI/quest mark",
      "followUpOptions": [
        {
          "optionText": "\"Legado do Éden.\"",
          "icon": "GUI/quest mark",
          "showButton": "enterEnclave",
          "progressionEventPlayed": "enclavePasscodePassed",
          "exitLine": true,
          "responseText": "Bem, puta merda, você acertou. Bem-vindo ao clube—não fode com tudo."
        }
      ]
    },
    {
      "optionText": "Quem diabos você pensa que é?",
      "responseText": "EU SOU A PORRA DA SUA FADA MADRINHA—AQUI PARA TE CONCEDER TRÊS DESEJOS: UMA BALA, UM PÉ NA BUNDA, OU UMA VISITA GUIADA AO INFERNO. Ah, e também sou do Enclave, aqui para raspar merdas inúteis como você das botas da América. Mas você provavelmente já adivinhou isso. SE EU TE VER FAZENDO UM MOVIMENTO ERRADO, VOU ARRANCAR SEU CRÂNIO E MIJAR NO QUE SOBRAR DO SEU CÉREBRO.",
      "followUpOptions": [
        {
          "optionText": "Relaxe. Só estou explorando.",
          "responseText": "Explorando? ISTO NÃO É UM PARQUE DE DIVERSÕES. Todo mutante, saqueador ou verme da wasteland que encontramos acaba pendurado, estripado e exibido como um aviso. Vê aquelas carcaças podres? ESSE É O NOSSO SINAL DE BOAS-VINDAS. Faça um movimento errado, e você se juntará à nossa pequena exposição na beira da estrada."
        },
        {
          "optionText": "O que te faz pensar que você é especial?",
          "responseText": "Especial? Não, somos apenas pessoas comuns com ótima higiene dental, um arsenal nuclear e genética impecável—descendentes de sangue puro daqueles que riram enquanto seus ancestrais derretiam em poças de gosma gritante. Estamos aqui para continuar a tradição—reduzindo manchas de merda como você A CINZAS.",
          "followUpOptions": [
            {
              "optionText": "Parece que vocês são todos maníacos genocidas.",
              "responseText": "Genocidas? Não. SOMOS ARTISTAS. A obra-prima é uma América purificada, livre do lixo mutante. Eu te esfolaria vivo agora mesmo e decoraria nosso perímetro com seus intestinos como prova de nossa dedicação. O RENASCIMENTO DA HUMANIDADE EXIGE SUA EXTINÇÃO BRUTAL."
            },
            {
              "optionText": "Alguém pode se juntar às suas fileiras?",
              "responseText": "Se juntar? HA, ESSA É BOA PRA CARALHO. Ainda assim, se você tem estômago para esfolar mutantes vivos e dançar com o sangue deles até os joelhos... TALVEZ DEIXEMOS VOCÊ SERVIR DE BUCHA DE CANHÃO. Mas primeiro, qual é a porra da nossa SENHA?",
              "followUpOptions": [
                {
                  "optionText": "Uh... 'Foda-se os Mutantes'?",
                  "responseText": "Fofo. MAS ERRADO. Adivinhe de novo, cérebro de merda, ou vá se foder."
                },
                {
                  "optionText": "'Morte à Irmandade'?",
                  "responseText": "Aprecio o sentimento, mas NÃO É ISSO. Volte quando sua cabeça estiver menos irradiada."
                },
                {
                  "optionText": "'Presidente Dick Richardson'?",
                  "responseText": "Engraçadinho, hein? Diga mais uma palavra e você descobrirá o gosto dos seus dentes."
                }
              ]
            }
          ]
        },
        {
          "optionText": "Então, o que alguém como você faz por diversão por aqui?",
          "responseText": "Quando não estou pendurando mutantes por suas entranhas? Ah, sabe—prática de tiro em saqueadores vivos, jogos de pôquer com meus amigos, ou talvez apenas uma noite casual torturando batedores da Irmandade capturados. Coisa boa de verdade."
        },
        {
          "optionText": "Quem comanda esta fortaleza?",
          "responseText": "Esse seria o General Archibald 'Archie' Grim. Estrategista brilhante, psicopata total e dançarino surpreendentemente habilidoso. Você não temeu um homem de verdade até vê-lo sapatear sobre cadáveres de mutantes enquanto cantarola melodias."
        }
      ]
    },
    {
      "optionText": "Que lugar é este que você está guardando?",
      "responseText": "ESTA É A NOSSA FORTALEZA—o lugar onde reacenderemos a América napalmando toda abominação radioativa até o esquecimento gritante. Fique por aqui, e seus gritos ecoarão bem em nossas câmaras de tortura!"
    },
    {
      "optionText": "Tem algum trabalho?",
      "icon": "GUI/quest mark",
      "dontDisplayIfHasObjective": "Bring 5 mutant heads to Enclave",
      "dontDisplayIfObjectiveComplete": "Bring 5 mutant heads to Enclave",
      "responseText": "Sempre tem espaço para psicopatas ansiosos. Traga-me as cabeças de cinco mutantes—recém-cortadas, de preferência, não aquela merda liofilizada—e você receberá um pagamento generoso o suficiente para deixar sua mãe orgulhosa. Supondo que ela esteja viva. Provavelmente não está, conhecendo sua laia.",
      "followUpOptions": [
        {
          "optionText": "Certo, estou dentro.",
          "icon": "GUI/quest mark",
          "exitLine": true,
          "addObjective": "Bring 5 mutant heads to Enclave",
          "responseText": "Esse é o espírito! Agora vá espalhar um pouco de alegria de decapitação pós-apocalíptica."
        },
        {
          "optionText": "É... não, obrigado.",
          "exitLine": true,
          "responseText": "Imaginei. Mole como merda de brahmin. Vá se juntar à Irmandade—talvez eles te deem uma medalha por não se mijar."
        }
      ]
    },
    {
      "optionText": "Tchau.",
      "responseText": "Corra de volta para sua toca, covarde. Da próxima vez que nos encontrarmos, vou arrancar sua espinha covarde e montá-la em nossos portões.",
      "exitLine": true
    }
  ],
  "showShadowFigures": "Enclave",
  "random_auto_line": [
    "Eu esperava que algo entrasse por aqui hoje. Meu rifle tem estado entediado."
  ]
}
