{
  "options": [
    {
      "optionText": "Que comitê de boas-vindas. Quem é você?",
      "dontShowIfProgressionEventPlayed": "joined_enclave",
      "responseText": "Comandante Archibald Grim — e você acaba de entrar num lugar onde invasores costumam virar adubo. Explique-se, ou em breve vai decorar as paredes.",
      "followUpOptions": [
        {
          "optionText": "Seu agente, Hans, me deu a senha depois da nossa... limpeza no Refúgio 6969.",
          "responseText": "Hans, o desgraçado miserável. Eficiente, pelo menos. Mas não pense que isso lhe dá direito a recompensas ou confiança. Apenas lhe concede uma audiência.",
          "followUpOptions": [
            {
              "optionText": "Então como eu provo minha lealdade?",
              "responseText": "Provar? Você acha que meras palavras ou um pequeno serviço lhe dão o direito de se juntar ao Enclave? Se você realmente quer um lugar aqui, vai conquistá-lo com sangue, obediência e submissão absoluta.",
              "followUpOptions": [
                {
                  "optionText": "Estou ouvindo.",
                  "responseText": "Bom. Há um juramento que você fará — um juramento tão vinculativo quanto uma forca em seu pescoço. Uma promessa de lealdade à América renascida. Você jura sua lealdade, sua vida e seu propósito ao Enclave, à restauração da verdadeira ordem americana. Quebre-o, e eu pessoalmente o estriparei como o verme que você é.",
                  "followUpOptions": [
                    {
                      "optionText": "O que envolve esse 'juramento'?",
                      "responseText": "Você jura lealdade absoluta e inabalável a mim — ao Enclave. Sua vida, sua alma, sua dignidade, tudo pertence à causa. Falhe comigo, e você implorará pela morte muito antes de eu concedê-la.",
                      "followUpOptions": [
                        {
                          "optionText": "Eu entendo. Vou fazer o juramento.",
                          "responseText": "Repita com precisão: 'Eu juro meu coração, alma e existência inútil ao Enclave — os verdadeiros guardiões da pureza americana. Minha vida patética é sua, Comandante Grim, até meu sangue esfriar.'",
                          "followUpOptions": [
                            {
                              "optionText": "Eu juro — pela nova América.",
                              "addPerk": "enclave_joined",
                              "progressionEventPlayed": "joined_enclave",
                              "exitLine": true,
                              "responseText": "Bem-vindo ao inferno, recruta. Você começará por baixo, e se sobreviver, talvez ganhe mais do que migalhas. Quanto à companhia — não se adiante. Apenas minha elite de confiança procria livremente aqui. Você terá privilégios quando provar ser mais útil do que descartável."
                            },
                            {
                              "optionText": "Pensando bem, talvez não.",
                              "exitLine": true,
                              "responseText": "Covarde. Rasteje de volta para o seu deserto, e se eu te vir de novo, vou esfolá-lo vivo e usar seus ossos como troféus."
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "optionText": "Só entrei por acaso. Acho que a segurança por aqui anda meio frouxa.",
          "responseText": "Cuidado. Sua insolência me diverte, mas me divertirá mais ainda assistir ao seu fim lento. Saia agora, ou experimente em primeira mão o que fazemos com intrusos.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Bela estrutura. Este lugar foi criação sua?",
      "responseText": "Suposição lisonjeira, mas não. Não sou arquiteto; sou um conquistador. Esta instalação é anterior a mim. Construída antes da guerra, destinava-se a preservar a liderança americana. Agora é minha e, sob minha liderança, finalmente cumpre seu destino — reconstruir a América a partir dessas cinzas.",
      "followUpOptions": [
        {
          "optionText": "Quem exatamente construiu esta base, se não você?",
          "responseText": "A liderança do velho mundo, aqueles que previram a queda da América. Eles prepararam bunkers como este para a reconstrução assim que a fumaça se dissipasse. Nós somos seus herdeiros de direito."
        }
      ]
    },
    {
      "optionText": "Quem é a mulher ao seu lado?",
      "responseText": "Esta é Vivienne — minha esposa, minha arma, minha rainha. Ela é a lâmina por trás do veludo. Subestime-a, e você se engasgará com seu próprio sangue antes de terminar de piscar.",
      "followUpOptions": [
        {
          "optionText": "Sua esposa parece ter saído de uma pintura pré-guerra. Homem de sorte.",
          "responseText": "Vivienne é minha obra-prima — impecável, leal, mortal. Respeite isso, e você aproveitará imensamente sua estadia."
        }
      ]
    },
    {
      "optionText": "O Enclave tem uma reputação... controversa. Se importa de explicar seu grande plano?",
      "responseText": "Controversa para os ignorantes. Nossa missão é simples: erradicar a fraqueza, purgar a degeneração e reconstruir a América mais forte do que nunca. Você está pronto para fazer parte da história?",
      "followUpOptions": [
        {
          "optionText": "Parece ambicioso. Tem espaço para mais um patriota?",
          "responseText": "A ambição reconhece a ambição. Você se encaixará perfeitamente — contanto que suas ações continuem correspondendo à sua bravata."
        },
        {
          "optionText": "Isso não é um pouco extremo?",
          "responseText": "Extremo? Você não tem ideia. A misericórdia gera fraqueza, e a fraqueza gera decadência. Vou esculpir a pureza na carne da América com fogo e aço, não importa o custo."
        },
        {
          "optionText": "Parece que você gosta de bancar o deus.",
          "responseText": "Deuses mostram misericórdia — eu não. Se eu banco alguma coisa, é de carrasco. Cruse meu caminho, e você experimentará isso em primeira mão."
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Dispensado. A América aguarda a grandeza — e seu papel nela.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Vivienne, querida, parece que temos vermes de novo. Que pitoresco. Ótimo momento — minha última execução foi decepcionantemente breve. Talvez você me entretenha por mais tempo."
  ],
  "showShadowFigures": "Enclave Base"
}
