{
  "options": [
    {
      "optionText": "Ouvi dizer que sua mãe sumiu há um tempo. Preocupada?",
      "onlyShowIfProgressionEventPlayed": "learnedAboutFarmerWifeMissing",
      "dontDisplayIfObjectiveComplete": "Bring the Farmer's Wife back",
      "responseText": "Ah, ela é uma ave velha e durona! Papai diz que a Irmandade só está lhe dando uma lição. Acho que ela vai voltar a qualquer dia com algumas histórias chiques!",
      "followUpOptions": [
        {
          "optionText": "Faz duas semanas, June. Isso não é um bom sinal.",
          "responseText": "Duas semanas? Huh… acho que perdi a conta. O tempo voa quando você está ordenhando Brahmin e matando baratas radioativas!"
        },
        {
          "optionText": "O que exatamente seu pai se recusou a pagar à Irmandade?",
          "responseText": "Algum tipo de tributo. Caps ou colheitas ou algo assim. Papai diz 'nenhum homem vai levar meu suor sem lutar!' Então ele jogou o sapato no mensageiro. Foi um dia e tanto!"
        },
        {
          "optionText": "Ela pode não voltar, June.",
          "responseText": "Não diga isso, docinho! Ela é mais resistente que um deathclaw. Você vai ver!"
        }
      ]
    },
    {
      "optionText": "Ei, quem manda neste lugar?",
      "responseText": "Ei, aqui é a Fazenda da Família Greaves. Papai é o chefe, mas eu sou o verdadeiro cérebro por aqui—pelo menos é o que eu digo a ele!",
      "followUpOptions": [
        {
          "optionText": "Aqueles são... ghouls trabalhando nos seus campos?",
          "responseText": "Ah, eles? Sim, papai os chama de seus 'colhedores de safra mal-humorados'. Eles não comem muito, nem reclamam muito alto. Meio como espantalhos grandes, mas mais fedorentos!"
        },
        {
          "optionText": "Você realmente acha que é o cérebro aqui?",
          "responseText": "Com certeza! Eu descobri como manter o alambique funcionando *e* fiz os corvos mutantes pararem de bicar o chapéu do papai. Não é genial?"
        },
        {
          "optionText": "Este lugar me assusta.",
          "responseText": "Ah, não seja assim! Tome uma sarsaparilla e sente-se um pouco. Nada de ruim acontece por aqui—bem, exceto aquela vez que o Earl se soltou com uma pá. Mas nós consertamos isso!"
        }
      ]
    },
    {
      "optionText": "Encontrei suas roupas.",
      "onlyDisplayIfHasObjective": "Find June's clothes",
      "itemRequired": "Farmer's Daughter's Clothes",
      "giveItemToCharacter": "Farmer's Daughter's Clothes",
      "markObjectiveComplete": "Find June's clothes",
      "responseText": "Bem, olhe só! Acho que isso significa que você ganhou uma coisinha, hein? Papai não está por perto, e eu já estou quase pronta. Quer ir em frente e foder, docinho? Só por diversão! Prometo que não conto se você não contar!",
      "followUpOptions": [
        {
          "optionText": "Com certeza quero.",
          "icon": "GUI/heart4",
          "responseText": "Uau, isso vai ser mais emocionante que o concurso de comer torta da feira da wasteland! Vamos criar algumas memórias, docinho!",
          "followUpOptions": [
            {
              "optionText": "[Foder ela]",
              "changeSprite": "Characters/Farm Girl/farm girl sex2",
              "icon": "GUI/heart4",
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "hEventName": "farmGirlPlayerSex",
              "progressionEventPlayed": "barnFuck",
              "showChoiceStats": "farm_fuck",
              "spriteAtTheEndOfHscene": "Characters/Farm Girl/IPAdapter_02555_",
              "spriteAtTheEndOfHscenePosition": [0.65, -0.39],
              "specialEffects": ["Blackout"],
              "endingEffects": ["Flashes"],
              "lineAfterHevent": "Ahh, é isso...♥︎",
              "auto_lines": [
                "Ahhm, docinho, estou esperando para cavalgar nesse pau desde que você apareceu nesta fazenda.",
                "Mmm, vai me foder com força, não vai? Espero que seu pau seja mais resistente que o uísque do papai.",
                "Ohhh, estou mais molhada que uma tempestade de radiação—enfia esse pau na minha buceta, querido.",
                "Goze onde quiser, querido. Só não conte ao papai que estraguei seus lençóis bons.",
                "Porra, docinho, é melhor você ter fôlego—sou mais apertada que uma porta de refúgio e duas vezes mais carente.",
                "Mmm, esse pau parece mais gostoso que a torta de nozes da mamãe. Se importa se eu der uma lambida primeiro?",
                "Ahhm, espero que esteja pronto para se afogar—minha buceta está pingando como uma máquina de Nuka-Cola quebrada.",
                "Oh, me foda bem agora, querido. Papai deve voltar logo, e não sou quieta quando gozo.",
                "Seu pau é mais duro que armadura da Irmandade, docinho—mal posso esperar para testar o quanto ele aguenta.",
                "Ahhm, vá devagar no começo. Faz um tempo que algo não preenche minha buceta direito.",
                "Mmm, vamos foder alto o suficiente para deixar aqueles ghouls com ciúmes. Aposto que eles vão bater uma junto.",
                "Ohhh, me encha de porra, querido. Faça escorrer pelas minhas coxas como melaço no verão.",
                "Porra, docinho, se eu soubesse que você tinha um pau desse tamanho, teria pulado as tarefas semanas atrás.",
                "Ahhm, seu pau me faz contorcer mais que uma barata radioativa sob a luz do sol.",
                "Vamos, foda esta buceta crua, docinho. Não sou delicada—apenas gulosa.",
                "Mmm, estive fantasiando o dia todo em sentir sua porra escorrendo de mim enquanto faço as tarefas amanhã.",
                "Ohhh, vou cavalgar seu pau como um Brahmin selvagem até você gozar mais forte que uma explosão nuclear.",
                "Porra, já estou quase lá—seu pau atinge mais fundo que um ninho de Mirelurk.",
                "Ahhm, de jeito nenhum esta buceta vai soltar seu pau até estar encharcada de porra.",
                "Mmm, mais forte, docinho—bata nesse pau como se estivesse pregando estacas de cerca. Eu aguento.",
                "Oh, me foda como se estivesse tentando quebrar algo, querido. Papai pode consertar tudo depois.",
                "Seu pau está deslizando para dentro, docinho. Minha buceta estava pronta assim que você entrou no celeiro.",
                "Ahhm, me segure firme, docinho. Quero sentir esse pau pulsando quando você gozar dentro.",
                "Mmm, porra, é isso—alargue esta buceta como se fosse sua, querido.",
                "Ohhh, goze em mim fundo o suficiente para eu sentir por dias, docinho. Não tenho mais nada planejado de qualquer maneira."
              ]
            }
          ]
        },
        {
          "optionText": "Não é meu estilo, June.",
          "responseText": "Ah, você é um osso duro de roer! Mas tudo bem, docinho, a porta está sempre aberta—bem, a porta do celeiro, de qualquer maneira! Vou ficar aqui arejando as mercadorias!"
        }
      ]
    },
    {
      "optionText": "Tudo bem por aqui?",
      "dontDisplayIfObjectiveComplete": "Find June's clothes",
      "responseText": "Oh! Não se importe conosco—Rufus só está bravo porque eu ganhei o último concurso de beber uísque de milho. Ele tem escondido minhas roupas desde então, o bastardo teimoso!",
      "followUpOptions": [
        {
          "optionText": "Aquele ghoul realmente roubou suas roupas?",
          "responseText": "Bem, ele não confessou, mas da última vez elas apareceram enfiadas em um cocho de Brahmin com baba de ghoul por todo lado. Então, a menos que o vento tenha um fetiche por roupas íntimas, eu diria que sim, foi ele!"
        },
        {
          "optionText": "Tem certeza que não está apenas esquecendo onde as jogou?",
          "responseText": "Agora escute aqui, senhor—posso estar seminua e cheia de sol, mas não sou estúpida. Quando eu jogo roupas, eu jogo com *propósito*. Aquele ghoul tem dedos longos e péssimas maneiras!"
        }
      ]
    },
    {
      "optionText": "Por que você está nua?",
      "icon": "GUI/quest mark",
      "dontDisplayIfObjectiveComplete": "Find June's clothes",
      "dontDisplayIfHasObjective": "Find June's clothes",
      "responseText": "Oh! Acredita que minhas roupas sumiram de novo! Malditos ghouls, acham engraçado me ver correndo como uma galinha sem cabeça! Me deixaram com nada além das minhas botas, este cinto velho e meu chapéu da sorte!",
      "followUpOptions": [
        {
          "optionText": "Você anda por aí assim na frente deles?",
          "icon": "GUI/quest mark",
          "responseText": "*risadinha e encolhe os ombros* Bem, não é como se eu fosse tímida! O sol está quente, a brisa é gostosa… além disso, não é como se aqueles ghouls não tivessem visto tudo antes—inferno, eles provavelmente têm minhas calcinhas penduradas como bandeirinhas em algum lugar! Quer me ajudar a encontrá-las, docinho?",
          "followUpOptions": [
            {
              "optionText": "Certo, vamos encontrar suas roupas.",
              "icon": "GUI/quest mark",
              "addObjective": "Find June's clothes",
              "responseText": "Oh, você é um verdadeiro amor! Juro que aqueles ghouls estão escondendo-as em algum lugar atrás dos fardos de feno ou no cocho de novo. Vamos nos separar—o primeiro a encontrar ganha!",
              "exitLine": true
            },
            {
              "optionText": "Sabe de uma coisa, esquece. Você parece feliz como está.",
              "responseText": "*risadinha e faz uma pose de pin-up* Bem, você não é um cavalheiro! Acho que vou continuar deixando a brisa fazer seu trabalho. Quem precisa de roupas, afinal? Só atrapalham quando a vida está tentando acontecer!"
            }
          ]
        },
        {
          "optionText": "Tem certeza que esses ghouls não estão apenas te tarando?",
          "responseText": "*inclina a cabeça, genuinamente confusa* Tarando? Oh, docinho, eles não têm muito com o que tarar! Só gostam de me ver fazer um escândalo, eu acho. Como ver uma ratazana-toupeira perseguir o próprio rabo—a coisa mais engraçada se você pensar bem!"
        },
        {
          "optionText": "Você não está com frio assim?",
          "responseText": "*ri e se espreguiça como se estivesse tomando sol* Frio? Querido, este sol da wasteland é melhor que qualquer fogueira. Só tem que tomar cuidado onde senta—não há nada pior que uma farpa onde não deve!"
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Volte sempre, ouviu? E cuidado onde pisa—o Joe tem mania de tirar uma soneca na grama alta!",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Juro, Rufus, se você escondeu minha calcinha de novo, vou amarrar suas mãos podres no rabo de um Brahmin e deixar ele te arrastar até o anoitecer!"
  ]
}
