{
  "options": [
    {
      "optionText": "Qual é a sua história, carniçal?",
      "responseText": "*O carniçal dá uma gargalhada, lambendo os lábios rachados.* O nome é Stitch. Eu desenhava, agora eu colho nabos pro Senhor Greaves ali. A vida é engraçada, né?",
      "followUpOptions": [
        {
          "optionText": "Você era um artista?",
          "responseText": "É. Fazia capas pra revistas baratas — *Tesão Mutante*, *Robô-Vadias de Vênus*, esse tipo de coisa. Quadris largos e mais decote do que enredo. Vendia que nem Med-X em covil de Saqueador. Agora eu rabisco carniçais sendo empalados por Mirelurks na lama. Ainda levo jeito — só não tenho público.",
          "followUpOptions": [
            {
              "optionText": "Você ainda desenha?",
              "responseText": "Quando o chefe não tá olhando. Rabisco putaria na lama com um osso de dedo. Tenho uma obra da *La Fantoma* montada num Behemoth com um biquíni de asas de Radroach. Obra-prima. O vento levou que nem um peido numa tempestade de areia."
            }
          ]
        },
        {
          "optionText": "Já pensou em fugir?",
          "responseText": "Fugir? De quê, saco de carne? Das correntes? Da fazenda? Da *mente*? Heh... Mesmo se eu corresse, a podridão me seguiria.",
          "followUpOptions": [
            {
              "optionText": "Você ainda poderia ser livre.",
              "responseText": "Liberdade é só escravidão com mais opções. Pelo menos aqui eu sei quem é meu dono."
            },
            {
              "optionText": "Você é patético.",
              "responseText": "É preciso um pra reconhecer o outro, mauricinho. Todos nós usamos correntes — as minhas só fazem mais barulho."
            },
            {
              "optionText": "Eu poderia matar seu mestre.",
              "responseText": "É mesmo? E depois? Você acha que a liberdade vai consertar *isso*?' *Ele bate no crânio, depois no peito.* A podridão é profunda, amigo."
            }
          ]
        },
        {
          "optionText": "Essa guitarra é sua?",
          "icon": "GUI/song icon",
          "responseText": "É minha, sim. O nome dela é Lucy. Uma dama de seis cordas — provavelmente a coisa mais limpa que eu já dedilhei. Achei ela numa carroça de cadáveres há dez anos. As cordas eram de tripa, tripa de verdade.",
          "followUpOptions": [
            {
              "optionText": "Você ainda consegue tocar?",
              "icon": "GUI/song icon",
              "responseText": "Ainda consigo. Ainda *toco*. Quando a lua tá baixa e o mestre tá desmaiado de bêbado. Eu toco até meus dedos sangrarem — deixa o som mais quente.",
              "followUpOptions": [
                {
                  "optionText": "Toca alguma coisa.",
                  "icon": "GUI/song icon",
                  "progressionEventPlayed": "ghoul_song_request",
                  "playMusic": "Songs/Ghoul Song",
                  "responseText": "*Stitch pega a Lucy, com os dedos trêmulos. Ele dedilha uma melodia assustadora e desafinada.*",
                  "exitLine": true
                }
              ]
            },
            {
              "optionText": "Por que não vende e dá o fora daqui?",
              "responseText": "Vender a Lucy? É como vender sua mãe. Ou sua filha. Nah... Vou morrer com ela... e talvez ela murmure sobre meus ossos."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Quem é o cara com a espingarda?",
      "responseText": "Ah, aquele? Aquele é o Sr. Greaves. Guardião das colheitas e da minha adorável coleira. Diga oi, Papai!"
    },
    {
      "optionText": "Tchau",
      "responseText": "Vá rápido, carne fresca. Eu começo a roer se ficar entediado.",
      "exitLine": true
    }
  ]
}
