{
  "options": [
    {
      "optionText": "Eu trouxe os pepinos.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Grow cucumbers for Gina",
      "itemRequired": "Special Cucumber",
      "giveItemToCharacter": "Special Cucumber",
      "markObjectiveComplete": "Grow cucumbers for Gina",
      "showChoiceStats": "grow_cucumber",
      "addGripGaugePoints": 200,
      "giveRandomItem": "random",
      "addSusPoints": 10,
      "relationshipPoints": 15,
      "responseText": "Oh, *finalmente*! Deixe-me ver... oh *uau*, olhe só para estas belezuras? Tão firmes, tão... *carnudas*. A espessura certa também. Você se superou, docinho!",
      "followUpOptions": [
        {
          "optionText": "Não gosto do jeito que você está olhando para eles...",
          "exitLine": true,
          "responseText": "Oh, não seja tímido! É apenas apreciação por um bom produto. Agora, vamos preparar estes garotões para minha *salada muito especial*. Você vai *adorar*."
        },
        {
          "optionText": "O que exatamente é essa ‘salada especial’?",
          "exitLine": true,
          "responseText": "Oh, você descobrirá em breve. Apenas confie em mim—é uma refeição que você não esquecerá. Um pouco salgada, um pouco picante, e com *muito* sabor."
        }
      ]
    },
    {
      "optionText": "[Entregar Livro de Receitas]",
      "icon": "GUI/quest mark",
      "responseText": "Você conseguiu! Meu lindo e sujo livrinho! Agora podemos realmente esquentar este lugar. Ah, e confie em mim, você vai *amar* o que vou cozinhar a seguir.",
      "dontDisplayIfObjectiveComplete": "Retrieve Recipe Book for Gina",
      "onlyDisplayIfHasObjective": "Retrieve Recipe Book for Gina",
      "giveItemToCharacter": "Gina's Recipe Book",
      "itemRequired": "Gina's Recipe Book",
      "giveRandomItem": "random",
      "markObjectiveComplete": "Retrieve Recipe Book for Gina",
      "addGripGaugePoints": 600,
      "addSusPoints": 10,
      "relationshipPoints": 15,
      "exitLine": true
    },
    {
      "optionText": "Pode me dar um pouco de atum? Uh... preciso para o gato.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Get tuna for Sir Whiskers.",
      "giveItem": "Tuna",
      "wTokensRequired": 13,
      "addWillpowerTokens": -13,
      "exitLine": true,
      "responseText": "O gato? Claro, claro. É o que todos dizem. Vocês, garotos do refúgio, são todos iguais. Bem, tenho uma lata da boa aqui. Mas é melhor ter cuidado ao abrir—pode espirrar para todo lado se não for gentil."
    },
    {
      "optionText": "O que tem no menu hoje?",
      "icon": "GUI/trade icon",
      "isTrading": true,
      "responseTexts": [
        "Oh, o especial de hoje é uma surpresa de carne misteriosa. Não estou dizendo que é Brahmin, mas também não estou dizendo que não é. Vem com uma porção de batatas fritas tão crocantes que poderiam acordar os mortos—ou pelo menos dar um ataque cardíaco na Polícia da Pureza. Se tiver sorte, pode até encontrar algo que pareça um vegetal. Pode. Sem promessas.",
        "Oh, o especial de hoje é uma deliciosa criação culinária que gosto de chamar de “Surpresa de Sobrevivência”. Por que a surpresa? Porque nem eu sei o que tem dentro na metade das vezes. Pode ser resto de barata radioativa da semana passada ou algo que caiu atrás da geladeira há seis meses.",
        "Bem, já que perguntou, temos o Clássico do Refúgio—Bolo de Carne Misterioso. É Brahmin? É rato-toupeira? Inferno, é mesmo carne? Gosto de manter o suspense. Servido com um lado do melhor purê de batatas da Vault-Tec, que pode ou não conter batatas de verdade.",
        "A iguaria de hoje é o “Chili do Fim do Mundo”. Tem feijão, carne misteriosa e um tempero que vai te fazer pensar duas vezes antes de usar o banheiro nas próximas 24 horas. Para a sobremesa, estamos servindo “Brownies Nucleares”. Eles brilham no escuro, mas ei, isso só torna mais fácil encontrar o caminho de volta para sua beliche quando as luzes se apagam.",
        "No menu de hoje está o “Especial do Supervisor”—um prato que é todo sobre insipidez e controle. É uma torrada. Sem manteiga, sem geleia, apenas torrada seca e esmagadora de almas. Ou, se estiver se sentindo ousado, pode experimentar nosso “Hambúrguer da Rebelião”. Tem gordura extra e um dedo do meio para a Polícia da Pureza cozido diretamente no hambúrguer."
      ]
    },
    {
      "optionText": "Quem é você?",
      "responseText": "Quem sou eu? Sou Gina, a única cozinheira neste refúgio que pode fazer feijão enlatado parecer uma refeição gourmet—ou pelo menos não comida de cachorro. Também atuo como instrutora de educação sexual não oficial do refúgio, principalmente mostrando às pessoas o que não fazer com um pepino. <i>[Ela sorri, jogando um pepino no ar e o pegando.]</i>",
      "followUpOptions": [
        {
          "optionText": "Tem alguma receita secreta?",
          "responseText": "Receitas secretas? Ah, sim, várias! Como meu ensopado especial de “não pergunte o que é”. O ingrediente secreto é o mistério. Mantém todos adivinhando e com muito medo de pedir mais."
        },
        {
          "optionText": "Você tem algo para beber?",
          "responseText": "Claro! Temos água, ou você pode experimentar meu “Especial da Gina” caseiro. É como Nuka-Cola, mas com mais álcool e menos consideração pelo seu fígado. Não pergunte o que tem dentro. Digamos que vai te nocautear ou limpar a ferrugem do seu Pip-Boy.",
          "followUpOptions": [
            {
              "optionText": "Certo, me dê um.",
              "responseText": "Aqui está, um Especial da Gina. Só não beba muito rápido, a menos que queira experimentar como é ver o som.",
              "specialEffects": ["ChromaticAberration", "TemporalBlur"],
              "exitLine": true
            }
          ]
        },
        {
          "optionText": "Tem alguma dica de cozinha para um iniciante?",
          "responseText": "Sim, aqui vai uma dica: se cheirar mal, cozinhe por mais tempo. Se ainda cheirar mal, adicione sal. Se pegar fogo, está pronto. E se alguém perguntar o que tem dentro, apenas sorria e diga que é uma receita de família. E se tudo mais falhar, afogue em ketchup. Ketchup cobre uma infinidade de pecados."
        },
        {
          "optionText": "Já teve algum problema com a Polícia da Pureza?",
          "responseText": "Oh, vários. Eles adoram fazer essas inspeções aleatórias de “saúde e segurança”. Uma vez, encontraram meu estoque de pepinos e ficaram todos nervosos. Tive que explicar para aqueles idiotas que às vezes um pepino é apenas um pepino. Mas eles escutam? De jeito nenhum. Estou na “lista de observação” deles agora."
        }
      ]
    },
    {
      "optionText": "Precisa de ajuda?",
      "icon": "GUI/quest mark",
      "dontDisplayIfObjectiveComplete": "Retrieve Recipe Book for Gina",
      "dontDisplayIfHasObjective": "Retrieve Recipe Book for Gina",
      "responseText": "Na verdade, agora que você mencionou... aqueles policiais estraga-prazeres pegaram meu livro de receitas. Disseram que era ‘sugestivo demais’. Dá para acreditar? Quer dizer, claro, alguns pratos são um pouco... ousados, mas vamos lá, é *arte*. De qualquer forma, preciso dele de volta se quiser evitar que este refúgio morra de tédio.",
      "followUpOptions": [
        {
          "optionText": "Por que eles pegaram? O que há de tão sugestivo em um livro de receitas?",
          "responseText": "Oh, você ficaria surpreso! Aparentemente, meus ‘Donuts Recheados com Creme’ e ‘Surpresa de Linguiça Grossa e Suculenta’ foram um pouco demais para suas sensibilidades delicadas. Bando de puritanos! Eles simplesmente não conseguiram lidar com meu *sabor*.",
          "followUpOptions": [
            {
              "optionText": "Certo, vou pegá-lo de volta para você.",
              "responseText": "Oh, seu herói absoluto! Mas aqueles policiais de bunda apertada não vão simplesmente entregá-lo. Você vai precisar de uma boa conversa ou talvez *suborná-los*. Jogue certo, e eu te deverei uma grande. E por grande, quero dizer *você nunca mais passará fome*—se é que me entende.",
              "addObjective": "Retrieve Recipe Book for Gina",
              "exitLine": true
            },
            {
              "optionText": "Parece arriscado. Acho que vou passar.",
              "responseText": "Oh, não seja tão mole! Mas ei, se mudar de ideia e quiser apimentar sua vida, sabe onde me encontrar."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Precisa de mais alguma ajuda?",
      "icon": "GUI/quest mark",
      "onlyDisplayIfObjectiveComplete": "Retrieve Recipe Book for Gina",
      "dontDisplayIfObjectiveComplete": "Help Gina Clean the Diner",
      "responseText": "Bem, agora que você mencionou, eu poderia usar uma ajuda para limpar por aqui. Está uma bagunça e meus braços estão tão cansados. Topa dar uma mão, querido? Farei valer a pena—prometo.",
      "followUpOptions": [
        {
          "optionText": "Claro, eu ajudo.",
          "specialEffects": ["Blackout"],
          "responseText": "Oh, você é um salva-vidas! Certo, vamos ao trabalho. Comece pelo chão, depois cuidamos das mesas.",
          "addObjective": "Help Gina Clean the Diner",
          "followUpOptions": [
            {
              "optionText": "[Limpar o Chão]",
              "specialEffects": ["Blackout"],
              "responseText": "*Você pega o rodo e começa a esfregar o chão. O chão está uma bagunça—alguém derramou muito 'molho' aqui atrás.*",
              "followUpOptions": [
                {
                  "optionText": "[Limpar as Mesas]",
                  "specialEffects": ["Blackout"],
                  "responseText": "*Agora é hora de limpar aquelas mesas pegajosas. Há uma mancha misteriosa que você tem certeza que está aqui desde antes das bombas caírem.*",
                  "followUpOptions": [
                    {
                      "optionText": "[Limpar o Balcão]",
                      "specialEffects": ["Blackout"],
                      "responseText": "*Você limpa o balcão, e—sim, mais molho. A Gina está derramando molho por todo lado de propósito? Talvez você precise pedir a ela um avental à prova de derramamento da próxima vez.*",
                      "followUpOptions": [
                        {
                          "optionText": "[Procurar por mais bagunça]",
                          "specialEffects": ["Blackout"],
                          "responseText": "*Você olha ao redor e se sente bastante realizado. O lugar está impecável... bem, quase.*",
                          "followUpOptions": [
                            {
                              "optionText": "[Voltar para a Gina]",
                              "changeSprite": "Characters/Gina/no panties",
                              "newSpriteXPos": 3.6,
                              "newSpriteYPos": 0.21,
                              "resetToDefaultSpriteAfterClosingDialogues": true,
                              "specialEffects": ["Blackout"],
                              "hEventName": "gina_diner_oopsie",
                              "followUpOptions": [
                                {
                                  "optionText": "Uh... Gina, terminei de limpar o—",
                                  "markObjectiveComplete": "Help Gina Clean the Diner",
                                  "emotion": "Characters/Gina/emotions/IPAdapter_00922_(1)(1)",
                                  "responseText": "Oh, ótimo! Obrigada por—espere, POR QUE SEUS OLHOS ESTÃO SALTANDO ASSIM? Oh meu deus. OH, MERDA, ISTO É UM PESADELO. Esqueça que isso aconteceu, ou eu... eu te dou para os Mirelurks! APENAS SAIA!",
                                  "followUpOptions": [
                                    {
                                      "optionText": "Uh... onde estão suas calças?",
                                      "responseText": "Oh! Uh... bem, isso é... embaraçoso! Eu—eu devo ter... uh, esquecido na lavanderia! Sim, é isso! Apenas... tente não pensar muito sobre isso, ok? Juro que não costumo trabalhar assim!",
                                      "followUpOptions": [
                                        {
                                          "optionText": "Claro... totalmente um acidente, hein?",
                                          "responseText": "Bem... sim, *totalmente*! Quer dizer, quem *esquece* as calças? Não é como se eu tivesse planejado isso, certo? Heh... certo?! De qualquer forma, que tal eu fazer um pouco de comida para nós e esquecemos que isso aconteceu?",
                                          "followUpOptions": [
                                            {
                                              "optionText": "Certo, eu aceito a comida.",
                                              "responseText": "Oh, graças a Deus! Uma refeição misteriosa saindo—não pergunte o que tem dentro. Você já viu o suficiente.",
                                              "emotion": "none",
                                              "specialEffects": ["Blackout"],
                                              "giveRandomItem": "random_food_or_drink",
                                              "progressionEventPlayed": "took_food_from_gina",
                                              "showChoiceStats": "took_food_from_gina2",
                                              "relationshipPoints": 5,
                                              "exitLine": true
                                            },
                                            {
                                              "optionText": "[Denunciá-la por atentado ao pudor]",
                                              "icon": "GUI/eye icon",
                                              "responseText": "Oh... oh não. Você está me denunciando sério? Por *isso*? Não é como se eu estivesse fazendo agachamentos na sua cama. Certo. A Segurança do Refúgio vai adorar essa. Espero que goste de papelada.",
                                              "emotion": "none",
                                              "specialEffects": ["Blackout"],
                                              "reported": 1,
                                              "progressionEventPlayed": "refused_food_from_gina",
                                              "showChoiceStats": "refused_food_from_gina",
                                              "exitLine": true
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "optionText": "Limpeza? Não, estou de boa.",
          "responseText": "Como quiser, docinho. Mas aposto que está perdendo um... *verdadeiro deleite* lá atrás. Espero que goste de comer enlatados, no entanto. Você poderia ter tido meu molho especial por conta da casa.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Precisa de mais alguma ajuda?",
      "icon": "GUI/quest mark",
      "onlyDisplayIfObjectiveComplete": "Help Gina Clean the Diner",
      "dontDisplayIfHasObjective": "Grow cucumbers for Gina",
      "dontDisplayIfObjectiveComplete": "Grow cucumbers for Gina",
      "responseText": "Oh, querido, você não tem ideia do quanto preciso de uma mãozinha... Consegui estas sementes de pepino 'especiais', e preciso que você as plante na estufa. São para uma salada muito *especial*.",
      "followUpOptions": [
        {
          "optionText": "O que há de tão especial nesses pepinos?",
          "responseText": "Oh, você *adoraria* saber, não é? Digamos que estes garotões estão *pulsando* com nutrientes, crescem extra grossos, extra suculentos, e com uma forma que—uh... *única*. Puramente para fins culinários, claro!"
        },
        {
          "optionText": "Claro, eu os planto para você.",
          "icon": "GUI/quest mark",
          "addObjective": "Grow cucumbers for Gina",
          "dontDisplayIfHasObjective": "Grow cucumbers for Gina",
          "giveItem": "Special Cucumber Seeds",
          "exitLine": true,
          "responseText": "Esse é o espírito! Vá para a estufa, arranje um buraco bom e fundo, e deslize estes garotões com cuidado e delicadeza. Eles gostam de uma *inserção lenta*, bem delicada. Estarei esperando aqui, sonhando com aqueles pepinos grandes, gordos e deliciosos—uh, pepinos. *Para a salada*."
        },
        {
          "optionText": "Gina… você está só me zoando?",
          "responseText": "Eu? Zoando você? Longe de mim! Sou apenas uma humilde cozinheira com uma profunda, profunda apreciação por... *produtos agrícolas*."
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Qual é, você sabe que vai voltar. Ninguém resiste ao fascínio de... manutenção de canos.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Bem, se não é carne fresca. Você veio pela comida, fofoca, ou só para encarar meus pães? E por pães, quero dizer os de pão, seu pervertido."
  ],
  "resetToDefaultSpriteAfterClosingDialogues": true
}
