{
  "options": [
    {
      "optionText": "Eu trouxe os pepinos pra você.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Grow cucumbers for Gina",
      "itemRequired": "Special Cucumber",
      "giveItemToCharacter": "Special Cucumber",
      "markObjectiveComplete": "Grow cucumbers for Gina",
      "showChoiceStats": "grow_cucumber",
      "addGripGaugePoints": 200,
      "giveRandomItem": "random",
      "addSusPoints": 10,
      "relationshipPoints": 15,
      "responseText": "Ah, *finalmente*! Deixa eu ver... oh, *uau*, olha só que belezuras! Tão firmes, tão... *carnudos*. A grossura tá no ponto também. Você se superou, docinho!",
      "followUpOptions": [
        {
          "optionText": "Não tô gostando do jeito que você tá olhando pra eles...",
          "exitLine": true,
          "responseText": "Ah, não seja tímido! É só apreciação por um produto de qualidade. Agora, vamos preparar esses danados pra minha *salada superespecial*. Você vai *amar*."
        },
        {
          "optionText": "O que é exatamente essa 'salada especial'?",
          "exitLine": true,
          "responseText": "Ah, você vai descobrir logo, logo. Confia em mim, é uma refeição que você não vai esquecer. Meio salgadinha, meio picante, e com *muito* sabor."
        }
      ]
    },
    {
      "optionText": "[Entregar Livro de Receitas]",
      "icon": "GUI/quest mark",
      "responseText": "Você conseguiu! Meu livrinho lindo e safado! Agora a gente pode esquentar as coisas de verdade por aqui. Ah, e confia em mim, você vai *amar* o que eu vou preparar em seguida.",
      "dontDisplayIfObjectiveComplete": "Retrieve Recipe Book for Gina",
      "onlyDisplayIfHasObjective": "Retrieve Recipe Book for Gina",
      "giveItemToCharacter": "Gina's Recipe Book",
      "itemRequired": "Gina's Recipe Book",
      "giveRandomItem": "random",
      "markObjectiveComplete": "Retrieve Recipe Book for Gina",
      "addGripGaugePoints": 600,
      "addSusPoints": 10,
      "relationshipPoints": 15,
      "exitLine": true
    },
    {
      "optionText": "Pode me dar um atum? Uh... preciso pra gata.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Get tuna for Sir Whiskers.",
      "giveItem": "Tuna",
      "wTokensRequired": 13,
      "addWillpowerTokens": -13,
      "exitLine": true,
      "responseText": "A gata? Claro, claro. É o que todos dizem. Vocês, garotos do Refúgio, são todos iguais. Bom, eu tenho uma lata da boa aqui. Mas é melhor ter cuidado ao abrir, pode espirrar pra todo lado se não for gentil."
    },
    {
      "optionText": "Bom, Gina... parece que as coisas tão esquentando aqui.",
      "icon": "GUI/heart4",
      "responseText": "Ah, querido, você não faz ideia do *calor* que tem feito. O calor, a tensão... tô quase implorando pra explodir. Quer provar meus pãezinhos agora que estão quentinhos e úmidos?",
      "followUpOptions": [
        {
          "optionText": "Eu passei o dia todo duro só de pensar nesses pãezinhos.",
          "icon": "GUI/heart4",
          "responseText": "Mmm, benzinho, consigo ver essa rola se esforçando pra sair... por que não bate com ela no balcão e eu cubro com meu molho especial?",
          "followUpOptions": [
            {
              "optionText": "Vamos ver quão fundo eu consigo meter esse 'pão' no seu forno.",
              "responseText": "Ohhh, sim, enfia fundo! Vamos assar essa rola até ela ficar pingando porra. Aposto que você vai gozar por todo o meu forninho quente."
            },
            {
              "optionText": "Cuidado, ou eu vou gozar em cima dos seus pãezinhos.",
              "responseText": "Ah, eu *quero* que você goze em mim. Cobre essas tetas, essa xoxota, onde você quiser. Eu aceito cada gota dessa porra grossa e quente."
            },
            {
              "optionText": "[Foder a Gina]",
              "icon": "GUI/heart4",
              "changeSprite": "Characters/Gina/sex",
              "newSpriteXPos": 3.33,
              "newSpriteYPos": -2.32,
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "spriteAtTheEndOfHscene": "Characters/Gina/IPAdapter_00466_(1)(1)",
              "spriteAtTheEndOfHscenePosition": [3.5, -1.13],
              "swapAnotherCharacterDialogue": [
                "Buster",
                "Characters/Buster/Buster after banging Gina"
              ],
              "setAnotherCharacterEmotion": [
                "Buster",
                "Characters/Buster/emotions/buster shock"
              ],
              "lineAfterHevent": "Ahhh, ainda tô tremendo... porra, você me arruinou. Mmm, vou sonhar com essa rola até você me foder de novo. ♥︎",
              "emotionsDuringHevent": [
                "none",
                "Characters/Gina/emotions/sex/e1",
                "Characters/Gina/emotions/sex/e2",
                "Characters/Gina/emotions/sex/e3"
              ],
              "specialEffects": ["Blackout", "Shake"],
              "endingEffects": ["Flashes"],
              "hEventName": "gina_diner_PlayerSex",
              "auto_lines": [
                "Mmm, minha xoxota tá doendo por essa rola... tão dura que eu sinto ela latejar. Ahh, porra, você vai me fazer gozar só de olhar.",
                "Ohhh, você não tem ideia do quanto eu precisei disso. Mmm, tira esse pau pra fora pra mim, benzinho. Deixa eu ver... Ahhh, sim, é disso que eu preciso. Tão grosso, caralho.",
                "Bate essa rola na minha xoxota. Mmm, isso... ohh, porra, já tô pingando por você. Essa xoxota esperou tanto que tá praticamente te implorando pra me foder.",
                "Mmm, benzinho, preciso que você me encha. Ohhh, enfia logo de uma vez. Quero esse pau tão fundo em mim que eu consiga sentir na porra da minha garganta.",
                "Ahhh, sim, desse jeito. Porra, você tá me alargando tão bem. Mmm, cada centímetro parece tão perfeito dentro de mim. Ohh, não para!",
                "Mmm, mais forte, benzinho... oh, porra, eu preciso mais forte. Arrebenta essa xoxota até eu não conseguir nem pensar direito. Ahh, sim, é isso!",
                "Ohhh, sim, benzinho! Porra, já vou gozar. Ohh, minha xoxota tá te apertando tão forte. Mmm, consigo sentir cada veia dessa rola grossa.",
                "Ahh, benzinho, tô quase lá... só continua me comendo assim. Ohhh, porra, sim, não para! Ohhh, eu vou gozar tanto!",
                "Ohh, porra, sim! Tô gozando, benzinho! Ahh, ohhh, é bom pra caralho! Ohhh, tô encharcando sua rola, você tá me fazendo gozar muito!",
                "Mmm, não para... preciso de mais. Ohh, benzinho, eu não terminei. Minha xoxota ainda tá latejando por você. Me fode até eu não conseguir andar!",
                "Ohhh, benzinho, você tá tão fundo em mim... mmm, sinto suas bolas batendo em mim. Porra, quero que você goze tão forte dentro de mim que eu consiga sentir o gosto!",
                "Ahhh, porra, eu amo como você me preenche. Toda vez que você mete, eu sinto lá no fundo das minhas entranhas. Ohh, não para!",
                "Mmm, benzinho, quero que você goze fundo em mim. Porra, quero sentir sua rola pulsar enquanto você jorra essa carga grossa em mim. Ohhh, me dá!",
                "Mmm, sim, sim, sim! Porra, sinto que você tá quase lá. Ohhh, benzinho, não tira. Eu quero essa porra me enchendo!",
                "Ahh, porra, tô tão pronta... mmm, jorra essa porra bem fundo na minha xoxota. Ohhh, benzinho, quero sentir escorrendo de mim!",
                "Ohhh, porra, siimmm! Ahhh, goza pra mim, benzinho! Ohhh, porra, me enche... mmm, quero cada gota dessa porra quente e grossa.",
                "Mmm, porra, sim, consigo sentir... ohh, tá tão quente aqui dentro. Porra, você tá me fazendo gozar de novo, benzinho!",
                "Ahhh, caralho, você ainda tá duro? Ohh, eu não terminei ainda. Mmm, preciso dessa rola de novo. Deixa eu te esgotar, benzinho.",
                "Mmm, me cavalga até eu ficar encharcada. Ohhh, quero que você me arrebente. Ohh, benzinho, me faz gozar até eu não conseguir nem falar.",
                "Ahhh, porra, você tá acertando todos os lugares certos. Ohhh, vou esguichar em você! Mmm, não consigo mais segurar!",
                "Mmm, sim, sim, ohh, sim! Tô gozando de novo, caralho! Ahhh, benzinho, você me deixou toda molhada!",
                "Ohhh, benzinho, me fode mais forte! Eu quero tanto, preciso de mais! Porra, tô viciada nessa rola!",
                "Ahhh, não para, não para! Ohhh, benzinho, você tá me deixando louca... porra, tô gozando de novo!",
                "Ohhh, caralho, você tá tão fundo. Mmm, vou sentir essa rola por dias... ahhh, quero que você me alargue até eu não aguentar mais!",
                "Mmm, benzinho, preciso que você me arrebente. Ohh, me arrebenta mais forte até eu gritar seu nome. Ahhh, porra!",
                "Ahh, sim, sim! Ohh, você é bom pra caralho, benzinho. Tô tão cheia, consigo te sentir na porra da minha alma.",
                "Mmm, vou explodir! Ohhh, benzinho, tô esguichando de novo, porra, tô tão molhada! Tô encharcando seu pau!",
                "Ahhh, porra, sim! Quero mais uma carga... ohhh, quero que você goze tão forte dentro de mim que vou ficar vazando por dias.",
                "Mmm, me enche uma última vez, benzinho... ohh, quero que você me destrua com essa rola!",
                "Ahhh, sim! Ohhh, sinto que você tá chegando perto. Não para... porra, goza pra mim, benzinho. Quero essa carga grossa em cima de mim!",
                "Mmm, porra, tô gozando de novo! Ohhh, benzinho, tô gozando tanto que minha xoxota tá te segurando bem apertado!",
                "Ahhh, porra, sim! Ohhh, goza pra mim! Mmm, me cobre com essa porra quente e grudenta. Quero escorrendo das minhas tetas!"
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Esses pãezinhos parecem extra carnudos hoje, Gina.",
      "responseText": "Ah, querido, eles estão firmes e no ponto pra você... e confia em mim, foram manuseados сom cuidado. Quer dar uma apertadinha?"
    },
    {
      "optionText": "[Abrir Menu]",
      "icon": "GUI/trade icon",
      "isTrading": true,
      "random_auto_line": [
        "Ah, querido, voltou pra mais dos meus pãezinhos? Cuidado, hoje eles tão super quentes!",
        "Quer provar meu molho especial? Fiz ele extra cremoso só pra você.",
        "Mmm, você tem um bom apetite. Acha que aguenta minha linguiça grande hoje?",
        "Pedido saindo! Meus pãezinhos são tão macios que vão derreter na sua boca, do jeitinho que você gosta."
      ]
    },
    {
      "optionText": "Precisa de ajuda?",
      "icon": "GUI/quest mark",
      "dontDisplayIfObjectiveComplete": "Retrieve Recipe Book for Gina",
      "dontDisplayIfHasObjective": "Retrieve Recipe Book for Gina",
      "responseText": "Na verdade, agora que você mencionou... aqueles policiais estraga-prazeres pegaram meu livro de receitas. Disseram que era 'sugestivo demais'. Dá pra acreditar? Quer dizer, claro, alguns pratos são um pouco... picantes, mas qual é, é *arte*. De qualquer forma, preciso dele de volta se quiser impedir que este Refúgio morra de tédio.",
      "followUpOptions": [
        {
          "optionText": "Por que eles pegaram? O que tem de tão sugestivo num livro de receitas?",
          "responseText": "Ah, você ficaria surpreso! Aparentemente, meus 'Donuts Recheados com Creme' e 'Surpresa de Linguiça Grossa e Suculenta' foram um pouco demais para a sensibilidade delicada deles. Bando de puritanos! Eles simplesmente não aguentaram o meu *tempero*.",
          "followUpOptions": [
            {
              "optionText": "Certo, eu pego de volta pra você.",
              "responseText": "Ah, seu herói! Mas aqueles Policiais da Pureza não vão simplesmente entregá-lo. Você vai precisar de uma boa lábia ou talvez *suborná-los*. Jogue direito, e eu vou te dever uma grande. E por grande, quero dizer *você nunca mais vai passar fome* — se é que me entende.",
              "addObjective": "Retrieve Recipe Book for Gina",
              "exitLine": true
            },
            {
              "optionText": "Parece arriscado. Acho que vou passar.",
              "responseText": "Ah, não seja um banana! Mas ei, se mudar de ideia e quiser apimentar sua vida, sabe onde me encontrar."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Precisa de mais alguma ajuda?",
      "icon": "GUI/quest mark",
      "onlyDisplayIfObjectiveComplete": "Retrieve Recipe Book for Gina",
      "dontDisplayIfObjectiveComplete": "Help Gina Clean the Diner",
      "responseText": "Bem, agora que você mencionou, eu poderia usar uma mãozinha para limpar por aqui. Está uma bagunça e meus braços estão tão cansados. Topa dar uma ajuda, querido? Eu faço valer a pena — prometo.",
      "followUpOptions": [
        {
          "optionText": "Claro, eu ajudo.",
          "specialEffects": ["Blackout"],
          "responseText": "Ah, você é um anjo! Certo, vamos ao trabalho. Comece pelo chão, depois a gente cuida das mesas.",
          "addObjective": "Help Gina Clean the Diner",
          "followUpOptions": [
            {
              "optionText": "[Esfregar o Chão]",
              "specialEffects": ["Blackout"],
              "responseText": "*Você pega o esfregão e começa a esfregar o chão. O chão está uma bagunça — alguém derramou 'molho' demais aqui atrás.*",
              "followUpOptions": [
                {
                  "optionText": "[Limpar as Mesas]",
                  "specialEffects": ["Blackout"],
                  "responseText": "*Agora é hora de limpar essas mesas grudentas. Há uma mancha misteriosa que você tem quase certeza que está aqui desde antes das bombas caírem.*",
                  "followUpOptions": [
                    {
                      "optionText": "[Limpar o Balcão]",
                      "specialEffects": ["Blackout"],
                      "responseText": "*Você limpa o balcão e — sim, mais molho. A Gina está derramando molho de propósito? Talvez você precise pedir a ela um avental à prova de derramamentos da próxima vez.*",
                      "followUpOptions": [
                        {
                          "optionText": "[Procurar por mais bagunça]",
                          "specialEffects": ["Blackout"],
                          "responseText": "*Você olha ao redor e se sente bastante realizado. O lugar está impecável... bem, quase.*",
                          "followUpOptions": [
                            {
                              "optionText": "[Voltar para a Gina]",
                              "changeSprite": "Characters/Gina/no panties",
                              "newSpriteXPos": 3.6,
                              "newSpriteYPos": 0.21,
                              "resetToDefaultSpriteAfterClosingDialogues": true,
                              "specialEffects": ["Blackout"],
                              "hEventName": "gina_diner_oopsie",
                              "followUpOptions": [
                                {
                                  "optionText": "Uh... Gina, terminei de limpar o—",
                                  "markObjectiveComplete": "Help Gina Clean the Diner",
                                  "emotion": "Characters/Gina/emotions/IPAdapter_00922_(1)(1)",
                                  "responseText": "Ah, ótimo! Obrigada por—espera, POR QUE SEUS OLHOS TÃO SALTADOS DESSE JEITO? Meu Deus. AH, MERDA, ISSO É UM PESADELO. Esqueça que isso aconteceu, ou eu... eu te dou de comer para os Mirelurks! APENAS SAIA!",
                                  "followUpOptions": [
                                    {
                                      "optionText": "Uh... cadê suas calças?",
                                      "responseText": "Oh! Uh... bem, isso é... embaraçoso! Eu—eu devo ter... uh, esquecido na lavanderia! É, é isso! Apenas... tente não pensar muito sobre isso, ok? Juro que não costumo trabalhar assim!",
                                      "followUpOptions": [
                                        {
                                          "optionText": "Claro... totalmente um acidente, hein?",
                                          "responseText": "Bem... sim, *totalmente*! Quer dizer, quem *esquece* as calças? Não é como se eu tivesse planejado isso, certo? Heh... certo?! Enfim, que tal eu fazer algo pra gente comer e esquecermos que isso aconteceu?",
                                          "followUpOptions": [
                                            {
                                              "optionText": "Certo, eu aceito a comida.",
                                              "responseText": "Oh, graças a Deus! Uma refeição misteriosa saindo — não pergunte o que tem nela. Você já viu o suficiente.",
                                              "emotion": "none",
                                              "specialEffects": ["Blackout"],
                                              "giveRandomItem": "random_food_or_drink",
                                              "progressionEventPlayed": "took_food_from_gina",
                                              "showChoiceStats": "took_food_from_gina2",
                                              "relationshipPoints": 5,
                                              "exitLine": true
                                            },
                                            {
                                              "optionText": "[Denunciá-la por atentado ao pudor]",
                                              "icon": "GUI/eye icon",
                                              "responseText": "Ah... ah não. Você vai mesmo me denunciar? Por *isso*? Não é como se eu estivesse fazendo agachamentos na sua cama. Tudo bem. A Segurança do Refúgio vai adorar essa. Espero que você goste de papelada.",
                                              "emotion": "none",
                                              "specialEffects": ["Blackout"],
                                              "reported": 1,
                                              "progressionEventPlayed": "refused_food_from_gina",
                                              "showChoiceStats": "refused_food_from_gina",
                                              "exitLine": true
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "optionText": "Limpar? Nah, tô de boa.",
          "responseText": "Como quiser, docinho. Mas aposto que você está perdendo uma... *verdadeira delícia* lá atrás. Espero que goste de comer enlatados. Poderia ter ganhado meu molho especial por conta da casa.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Precisa de mais alguma ajuda?",
      "icon": "GUI/quest mark",
      "onlyDisplayIfObjectiveComplete": "Help Gina Clean the Diner",
      "dontDisplayIfHasObjective": "Grow cucumbers for Gina",
      "dontDisplayIfObjectiveComplete": "Grow cucumbers for Gina",
      "responseText": "Ah, querido, você não tem ideia do quanto eu preciso de uma mãozinha... consegui essas sementes de pepino 'especiais' e preciso que você as plante na sala de cultivo. São para uma salada muito *especial*.",
      "followUpOptions": [
        {
          "optionText": "O que esses pepinos têm de tão especial?",
          "responseText": "Ah, você não *adoraria* saber? Digamos apenas que esses danados *latejam* de nutrientes, crescem extra grossos, extra suculentos e com um formato que é... *único*. Puramente para fins culinários, claro!"
        },
        {
          "optionText": "Claro, eu os cultivo para você.",
          "icon": "GUI/quest mark",
          "addObjective": "Grow cucumbers for Gina",
          "dontDisplayIfHasObjective": "Grow cucumbers for Gina",
          "giveItem": "Special Cucumber Seeds",
          "exitLine": true,
          "responseText": "Esse é o espírito! Vá até a sala de cultivo, arrume um buraco bem fundo e deslize esses danados para dentro, com cuidado. Eles gostam de uma *inserção lenta*, bem delicada. Estarei aqui esperando, sonhando com aqueles deliciosos... uh, pepinos grandes e gordos. *Para a salada.*"
        },
        {
          "optionText": "Gina… você tá só me zoando?",
          "responseText": "Eu? Zoando você? Longe de mim! Sou apenas uma humilde cozinheira com uma apreciação profunda, muito profunda por... *hortaliças*."
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Já vai? Acho que você não está com fome o suficiente para este banquete... mas você vai voltar, eu sei que vai.",
      "exitLine": true
    }
  ],
  "showShadowFigures": "Diner ending"
}
