{
  "options": [
    {
      "optionText": "Ei, como você está aguentando?",
      "onlyShowIfProgressionEventPlayed": "grace_blowjob",
      "responseText": "*olha para cima, cansada e na defensiva* …Por que você está aqui?",
      "followUpOptions": [
        {
          "optionText": "Só vim ver como você está.",
          "responseText": "É… bem… acho que não tenho muito o que te dizer agora…"
        },
        {
          "optionText": "Pensando no boquete do outro dia?",
          "responseText": "*se encolhe* Não. Só… não fale sobre isso. Nunca mais.",
          "followUpOptions": [
            {
              "optionText": "Por que não? Você parecia… estar gostando.",
              "responseText": "*te encara, com os olhos marejados instantaneamente apesar da raiva* Não diga isso. Não… não distorça as coisas assim. Foi um erro… tá? Eu não estava pensando direito. Eu não… eu não quero ser essa garota…",
              "followUpOptions": [
                {
                  "optionText": "Você já é essa garota, Grace. Não tem como voltar atrás.",
                  "responseText": "*desvia o olhar bruscamente, com a voz trêmula* Cala a boca. Só cala a boca. Eu te odeio…"
                },
                {
                  "optionText": "Por que você não quer ser 'essa garota'?",
                  "responseText": "…Porque… eu vi o que acontece com garotas assim…",
                  "followUpOptions": [
                    {
                      "optionText": "Como assim?",
                      "responseText": "*a voz falha um pouco* Lá no bordel dos saqueadores… as garotas de lá… elas simplesmente… deixaram de ser pessoas. Era como… como se suas almas tivessem sumido…"
                    },
                    {
                      "optionText": "Você não é como elas, Grace.",
                      "responseText": "*balança a cabeça rapidamente* Você не entende… é o que todas elas pensavam no começo… até que não pensavam mais em nada…"
                    },
                    {
                      "optionText": "Por que isso te assusta tanto?",
                      "responseText": "*um pequeno soluço escapa de seus lábios* Porque eu não quero acabar como elas… só… usada… quebrada… algo que as pessoas tocam e jogam fora quando se cansam…"
                    },
                    {
                      "optionText": "O que você quer então?",
                      "responseText": "…Eu só… eu quero ser feliz… Eu quero que alguém… realmente se importe comigo… não… só com o meu corpo…"
                    },
                    {
                      "optionText": "Você acha que sou como eles? Os saqueadores?",
                      "responseText": "*olha para você* Eu não sei… quero pensar que você não é… mas… eu não sei mais…",
                      "followUpOptions": [
                        {
                          "optionText": "Eu não sou como eles. Eu prometo. Eu… me importo com você, Grace.",
                          "responseText": "*respira tremulamente* Não… não minta pra mim… por favor… eu não aguento se você estiver mentindo…"
                        },
                        {
                          "optionText": "Sinceramente? Não me importo com o que você pensa. Você é só minha putinha de estimação agora.",
                          "emotion": "Characters/Grace Wells/emotions/grace scared",
                          "responseText": "*seus olhos se arregalam de horror* Não… não… eu não sou… eu não sou isso… eu não sou…",
                          "followUpOptions": [
                            {
                              "optionText": "É bom se acostumar. Da próxima vez, vou enfiar meu pau na sua garganta, quer você queira ou não.",
                              "responseText": "*balança a cabeça violentamente, lágrimas escorrendo pelo rosto*",
                              "exitLine": true,
                              "advanceDayWithStatusMessage": "Grace corre para a porta, soluçando incontrolavelmente enquanto desce o corredor, deixando você sozinho.",
                              "progressionEventPlayed": "grace_doesnt_talk_to_you_anymore"
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "optionText": "Não finja que você não gostou.",
              "responseText": "*treme* Eu não… quer dizer… talvez… não… eu não sei… Deus, só me deixa em paz… por favor…",
              "followUpOptions": [
                {
                  "optionText": "Que tal continuarmos de onde paramos? Ir mais longe desta vez.",
                  "emotion": "Characters/Grace Wells/emotions/grace scared",
                  "responseText": "*balança a cabeça violentamente* Não. Não… eu não vou… eu não vou fazer isso de novo… eu não posso… eu não quero…"
                },
                {
                  "optionText": "Tudo bem. Outra hora, então.",
                  "emotion": "none",
                  "responseText": "*suspira tremulamente* …Tanto faz… só… vai embora…"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Pensando sobre… o que aconteceu outro dia?",
      "dontShowIfProgressionEventPlayed": "grace_blowjob",
      "onlyShowIfProgressionEventPlayed": "first_grace_masturbation",
      "responseText": "*geme baixinho* Podemos não falar sobre isso? Eu já sinto vontade de morrer toda vez que me lembro…",
      "followUpOptions": [
        {
          "optionText": "Se te faz sentir melhor… é normal. Sério.",
          "responseText": "É, bem… normal ou não, ainda me sinto uma completa idiota. Eu nem sei por que eu… ugh, deixa pra lá. Eu só não pensei que alguém realmente entraria… sabe."
        },
        {
          "optionText": "Você tem me evitado desde então.",
          "responseText": "*dá uma risada nervosa* Bem… sim. Pode me culpar? Toda vez que vejo seu rosto, eu só me lembro… sabe. Daquilo. E meu cérebro derrete e minha boca para de funcionar."
        },
        {
          "optionText": "Sabe… existem maneiras melhores de se sentir bem do que usar apenas os dedos.",
          "emotion": "Characters/Grace Wells/emotions/grace shocked",
          "icon": "GUI/heart4",
          "responseText": "*os olhos se levantam de repente, arregalados e nervosos* O-o que diabos isso quer dizer?! Você está falando sério… sugerindo… sexo…?",
          "followUpOptions": [
            {
              "optionText": "Sim. Sexo é melhor do que os dedos jamais poderiam ser.",
              "emotion": "Characters/Grace Wells/emotions/grace scared",
              "icon": "GUI/heart4",
              "responseText": "*abraça os joelhos com mais força, balançando a cabeça rapidamente* D-de jeito nenhum. Isso… isso parece doloroso. Todo mundo diz que a primeira vez dói pra caramba. Eu não estou… não estou pronta para isso.",
              "followUpOptions": [
                {
                  "optionText": "Não precisa doer. Mas tudo bem… poderíamos começar com algo mais fácil.",
                  "emotion": "none",
                  "icon": "GUI/heart4",
                  "responseText": "*olha para cima hesitantemente* Mais fácil…? Tipo… o quê?",
                  "followUpOptions": [
                    {
                      "optionText": "Outra lição. Apenas… olhar. Tocar. Aprender.",
                      "icon": "GUI/heart4",
                      "emotion": "Characters/Grace Wells/emotions/biting lip closed eyes",
                      "responseText": "*o rosto queima de vermelho instantaneamente* Deus… você é… você é inacreditável… mas… eu… acho que… não… machucaria… só… olhar… certo?",
                      "followUpOptions": [
                        {
                          "optionText": "Exato. Vem aqui. Você está apenas aprendendo. Nada assustador.",
                          "icon": "GUI/heart4",
                          "emotion": "Characters/Grace Wells/emotions/grace scared",
                          "responseText": "*se arrasta para mais perto, relutante* Certo… aprendendo… totalmente normal… não acredito que estou fazendo isso… Deus…",
                          "followUpOptions": [
                            {
                              "optionText": "Vá em frente. Tire para fora e… envolva sua mão nele, devagar.",
                              "icon": "GUI/heart4",
                              "changeSprite": "Characters/Grace Wells/handjob2",
                              "setBGcolor": "#B0B0B0",
                              "emotion": "none",
                              "newSpriteXPos": -3.03,
                              "newSpriteYPos": 0.11,
                              "responseText": "*engole em seco audivelmente, os olhos se arregalando* O-o quê… tipo… realmente… tocar nele…? *respira tremulamente, sua pequena mão pairando antes de finalmente envolver seu pau* Oh meu Deus… é… quente… e… tão estranho…",
                              "followUpOptions": [
                                {
                                  "optionText": "Você está indo muito bem. Tente… acariciá-lo um pouco.",
                                  "icon": "GUI/heart4",
                                  "responseText": "*um pequeno guincho escapa de seus lábios enquanto ela move a mão* A-assim…? Oh Deus… está ficando… maior…",
                                  "followUpOptions": [
                                    {
                                      "optionText": "Isso é porque você está me excitando.",
                                      "responseText": "*dá uma risada trêmula e nervosa* Não… não diga isso… faz minha cabeça ficar estranha…"
                                    },
                                    {
                                      "optionText": "Quer ver que gosto tem?",
                                      "icon": "GUI/heart4",
                                      "responseText": "*os olhos se levantam para os seus, horrorizados e curiosos ao mesmo tempo* P-provar…? Você é… você é louco…",
                                      "followUpOptions": [
                                        {
                                          "optionText": "Vamos lá. Não vai doer. Só uma lambidinha.",
                                          "icon": "GUI/heart4",
                                          "changeSprite": "Characters/Grace Wells/blowjob",
                                          "emotion": "none",
                                          "newSpriteXPos": 3.97,
                                          "newSpriteYPos": 0.11,
                                          "progressionEventPlayed": "grace_blowjob",
                                          "spriteAtTheEndOfHscene": "Characters/Grace Wells/grace in vault suit",
                                          "spriteAtTheEndOfHscenePosition": [
                                            1.1, -0.52
                                          ],
                                          "swapAnotherCharacterDialogue": [
                                            "Grace Wells",
                                            "Characters/Grace Wells/post-blowjob"
                                          ],
                                          "emotionsDuringHevent": [
                                            "none",
                                            "Characters/Grace Wells/emotions/blowjob/1",
                                            "Characters/Grace Wells/emotions/blowjob/2"
                                          ],
                                          "lineAfterHevent": "Deus… eu… não acredito que eu acabei de… fazer isso…",
                                          "exitLine": true,
                                          "isHEventStarted": true,
                                          "closeDialogueOptions": true,
                                          "hEventName": "grace_blowjob",
                                          "auto_lines": [
                                            "*respirando tremulamente, bochechas em chamas* Eu… eu… ok… só… não… não ria de mim…",
                                            "Oh Deus… é… é salgado…",
                                            "Isso… está ok… estou fazendo certo…?",
                                            "*engasga um pouco, recuando com os olhos marejados* D-desculpa… é… é tão grande…",
                                            "É… tão quente… e… duro…",
                                            "Eu posso… sentir ele se contorcendo… isso é… por minha causa…?",
                                            "Deus… está… enchendo minha boca inteira…",
                                            "*se afasta com um suspiro* Eu não consigo… é demais…",
                                            "Eu… eu posso sentir o gosto… de algo…",
                                            "*geme fracamente em volta do seu pau sem perceber*",
                                            "Por que… por que é… meio bom… fazer isso…?",
                                            "*os olhos se fecham enquanto ela balança a cabeça lentamente*",
                                            "Por favor… me diga que estou… indo bem…",
                                            "*se afasta, ofegando suavemente* Meu maxilar… dói… mas… eu posso continuar…",
                                            "*respirando tremulamente pelo nariz enquanto tenta pegar mais*",
                                            "Nnnh… está… esticando tanto meus lábios…",
                                            "Deus… minha boca… parece tão cheia…",
                                            "Eu… não sei se deveria ter esse gosto…",
                                            "Mmm… ngh… por favor… não empurre muito fundo…",
                                            "Está… está vazando algo… salgado…",
                                            "Eu não consigo… respirar… quando está todo dentro…",
                                            "Meu… meu peito fica estranho toda vez que você se mexe na minha boca…",
                                            "Eu… estou te dando prazer…? Mesmo…?",
                                            "Deus… sou uma idiota… por que estou fazendo isso…",
                                            "É tão… grosso… Deus…",
                                            "Mmmph… está… está ficando ainda mais duro…",
                                            "*recua tossindo suavemente* Me desculpe… eu vou… tentar de novo…",
                                            "Por favor… me diga quando você for…",
                                            "*pequeno gemido vibra em volta da sua ponta enquanto ela tenta ir mais fundo*",

                                            "Ngh… oh Deus… eu… não acredito que estou… realmente fazendo isso…",
                                            "Mmmph… mmph… por favor… не olhe para mim assim… é vergonhoso…",

                                            "*engasga suavemente de novo, lágrimas escorrendo por suas bochechas coradas*",
                                            "Nnnh… é tão… grosso… eu não consigo…",
                                            "*tenta passar a língua timidamente em volta da sua ponta*",
                                            "Mmm… isso… está… melhor…?",
                                            "Por que… por que meu peito está tão apertado… é só… um pau…",
                                            "*soluça suavemente em volta de você enquanto a baba escorre de seu queixo*",
                                            "Eu… eu posso sentir… latejando… você vai…?",
                                            "*os olhos se fecham com força enquanto ela acelera seu movimento desajeitadamente*",
                                            "Mmmph… por favor… só… termine logo…",
                                            "*se afasta ofegando antes de mergulhar de volta*",
                                            "Estou… indo bem o suficiente para você… terminar…?",
                                            "*pequeno gemido quando você atinge o fundo da garganta dela de novo*",
                                            "Eu… não sei se consigo aguentar tudo…",
                                            "Está… tão quente… dentro da minha boca…",
                                            "*engasga de novo, lágrimas escorrendo pelo rosto, mas ela não para*",
                                            "Mmmph… só… termine logo… por favor… eu não consigo…",
                                            "*sua língua lambe desesperadamente sua ponta, sua mão acariciando o que ela não consegue engolir*",
                                            "Nnnh… você está… você está gozando…?"
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Estou sentindo uns sinais confusos aqui, sobre a lição de mais cedo.",
      "reqProgressionEvent": "showing_dick_to_grace",
      "dontShowIfProgressionEventPlayed": "grace_blowjob",
      "responseText": "O único sinal que você deveria estar sentindo é: CORRA. PARA BEM LONGE. De preferência de volta para a Câmara da Vergonha, onde você pertence.",
      "followUpOptions": [
        {
          "optionText": "Ei, pelo menos eu tentei! De nada pela lição.",
          "exitLine": true,
          "responseText": "Uma 'lição'?! Ah, eu aprendi algo, sim. Aprendi que você é a *última pessoa* que eu gostaria que me ensinasse qualquer coisa. Nunca."
        }
      ]
    },
    {
      "optionText": "O que você acha do refúgio?",
      "emotion": "Characters/Grace Wells/emotions/grace closed eyes",
      "onlyDisplayIfObjectiveComplete": "Get a vault suit for Grace.",
      "responseText": "É... definitivamente não é o que eu esperava. Quer dizer, fico feliz por estar segura, mas algumas das regras aqui são meio malucas. Tipo, não pode dar as mãos? Não pode tocar de jeito nenhum? As pessoas ficam dizendo que é 'pela ciência', mas acho que estão todos sendo muito bobos.",
      "followUpOptions": [
        {
          "optionText": "É, este lugar é bem rigoroso.",
          "emotion": "none",
          "responseText": "Né? Tipo, eu entendo — não mate ninguém, não roube comida — mas 'sem tempo a sós' é um pouco demais."
        },
        {
          "optionText": "Talvez eles tenham um bom motivo para as regras?",
          "icon": "GUI/heart4",
          "dontShowIfProgressionEventPlayed": "showing_dick_to_grace",
          "emotion": "none",
          "responseText": "Talvez? Quer dizer, ouvi todo o papo da 'energia da abstinência', mas... uh, o que 'abstinência' significa exatamente? Todo mundo fica falando como se eu devesse saber, mas ninguém explica.",
          "followUpOptions": [
            {
              "optionText": "Significa... cuidar de si mesmo, em particular.",
              "responseText": "Ah, tipo pentear o cabelo ou algo assim? Espera, não, isso não parece certo. Por que eles fariam uma regra sobre isso?"
            },
            {
              "optionText": "É, uh, algo que as pessoas fazem quando estão sozinhas e... excitadas.",
              "emotion": "Characters/Grace Wells/emotions/grace closed eyes",
              "responseText": "Excitadas? Tipo, felizes? Eu fico feliz quando estou sozinha às vezes. Isso é ruim?"
            },
            {
              "optionText": "É quando alguém toca no próprio pau ou xoxota para se sentir bem, sabe, sexualmente.",
              "icon": "GUI/heart4",
              "emotion": "Characters/Grace Wells/emotions/grace shocked",
              "responseText": "ESPERA, O QUÊ?! Uh, as pessoas fazem isso? POR QUÊ?",
              "followUpOptions": [
                {
                  "optionText": "Você nunca fez isso, sério?",
                  "icon": "GUI/heart4",
                  "responseText": "Não! Por que eu faria? Quer dizer, eu nunca nem pensei nisso. É pra ser bom ou algo assim?",
                  "followUpOptions": [
                    {
                      "optionText": "Sim, a maioria das pessoas se sente muito bem fazendo isso.",
                      "responseText": "Huh... acho que eu nunca pensei nisso. É realmente algo tão importante para as pessoas?"
                    },
                    {
                      "optionText": "Bem, se algum dia você quiser, só não seja pega aqui.",
                      "responseText": "Espera, eles realmente pegam pessoas fazendo isso? O que eles fazem se alguém for pego?"
                    },
                    {
                      "optionText": "Quer que eu te mostre como se faz?",
                      "icon": "GUI/heart4",
                      "dontShowIfProgressionEventPlayed": "showing_dick_to_grace",
                      "responseText": "Espera, o quê? Me mostrar? Você está falando sério? Isso é... isso é tão estranho! Mas... você está brincando, certo?",
                      "followUpOptions": [
                        {
                          "optionText": "Não, estou falando sério. Olhe. [Abaixa as calças]",
                          "specialEffects": ["Blackout"],
                          "icon": "GUI/heart4",
                          "changeSprite": "Characters/Grace Wells/grace and dick",
                          "emotion": "none",
                          "newSpriteXPos": 0.86,
                          "newSpriteYPos": 0.19,
                          "hEventName": "showing_dick_to_grace",
                          "progressionEventPlayed": "showing_dick_to_grace",
                          "responseText": "ESPERA. O QUÊ?! EHH?! MEU DEUS, O QUE É ISSO?! POR QUE ESTÁ ME ENCARANDO?!",
                          "followUpOptions": [
                            {
                              "optionText": "Calma, é só um pau, garota.",
                              "responseText": "PAU?! PAU?! É UM RATO-TOUPEIRA MUTANTE E VEIUDO DO CARALHO! GUARDA ISSO ANTES QUE EU VOMITE EM TUDO!! É ISSO! TÔ FORA DAQUI!",
                              "exitLine": true,
                              "advanceDayWithStatusMessage": "Grace correu direto para o Supervisor gritando sobre 'rato-toupeira mutante e veiado' e agora você vai passar o resto do dia na Câmara da Vergonha — encarando uma parede enquanto uma voz da TV repete 'Mau Morador do Refúgio.' sem parar."
                            },
                            {
                              "optionText": "Você disse que queria aprender! Considere isso uma lição.",
                              "responseText": "A VAULT-TEC NÃO APROVA ISSO! A VAULT-TEC NÃO APROVA ISSO DE JEITO NENHUM! QUEM TE COLOCOU NO COMANDO DE ENSINAR QUALQUER COISA?! É ISSO! TÔ FORA DAQUI!",
                              "exitLine": true,
                              "advanceDayWithStatusMessage": "Grace correu direto para o Supervisor gritando sobre 'rato-toupeira mutante e veiado' e agora você vai passar o resto do dia na Câmara da Vergonha — encarando uma parede enquanto uma voz da TV repete 'Mau Morador do Refúgio.' sem parar."
                            },
                            {
                              "optionText": "Você está corando. Admita, você está curiosa.",
                              "responseText": "E-EU NÃO ESTOU CORANDO! VOCÊ É UM LUNÁTICO. UM LUNÁTICO ESTRANHO E PERVERTIDO! É ISSO! TÔ FORA DAQUI!",
                              "exitLine": true,
                              "advanceDayWithStatusMessage": "Grace correu direto para o Supervisor gritando sobre 'rato-toupeira mutante e veiado' e agora você vai passar o resto do dia na Câmara da Vergonha — encarando uma parede enquanto uma voz da TV repete 'Mau Morador do Refúgio.' sem parar."
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "optionText": "O que você acha do seu quarto?",
          "emotion": "Characters/Grace Wells/emotions/grace closed eyes",
          "responseText": "É… pequeno. E simples. Mas acho que é melhor que um acampamento de saqueadores. Pelo menos não cheira a jet e mijo.",
          "followUpOptions": [
            {
              "optionText": "É só temporário. Vamos te levar de volta para seu pai em breve.",
              "emotion": "none",
              "responseText": "Certo, de volta para o papai. Tenho certeza de que ele está preocupado..."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Aqui está seu macacão do refúgio. Contemple sua gloriosa perfeição colada à pele.",
      "markObjectiveComplete": "Get a vault suit for Grace.",
      "onlyDisplayIfHasObjective": "Get a vault suit for Grace.",
      "itemRequired": "Vault suit",
      "exitLine": true,
      "specialEffects": ["Blackout"],
      "giveItemToCharacter": "Vault suit",
      "relationshipPoints": 5,
      "changeSprite": "Characters/Grace Wells/grace in vault suit",
      "responseText": "Uau, uh, o quê? Por que você disse isso desse jeito? Você é... estranho. Sério, este lugar está cheio de esquisitos. Olha, eu vou vestir, só... para de me olhar assim, ok?"
    },
    {
      "optionText": "Por que você ainda está de calcinha e sutiã?",
      "icon": "GUI/quest mark",
      "dontDisplayIfHasObjective": "Get a vault suit for Grace.",
      "dontDisplayIfObjectiveComplete": "Get a vault suit for Grace.",
      "responseText": "Ah! Uh... isso é um problema? Ninguém me deu mais nada para vestir, e eu não estou exatamente saqueando armários por aqui. As pessoas realmente usam aqueles macacões azuis engraçados o tempo todo?",
      "followUpOptions": [
        {
          "optionText": "Vou te arrumar um macacão do refúgio. Só... fica aí por enquanto.",
          "addObjective": "Get a vault suit for Grace.",
          "exitLine": true,
          "responseText": "Um macacão do refúgio? Ah, você quer dizer aquelas coisas apertadas e brilhantes que todo mundo está usando? Bem, claro. Acho que é melhor do que isso, né?"
        },
        {
          "optionText": "Você não pode simplesmente andar por aí assim. É uma distração. Fique aqui, vou te trazer algo.",
          "addObjective": "Get a vault suit for Grace.",
          "exitLine": true,
          "responseText": "Distração? Para quem? Todo mundo aqui age como se nunca tivesse visto uma garota antes! Tudo bem, vá pegar sua coisa chique de macacão."
        },
        {
          "optionText": "Sinceramente, você está arrasando. Talvez devesse fazer disso o seu visual característico?",
          "responseText": "Uau, obrigada pelo voto de confiança, mas acho que vou passar."
        }
      ]
    },
    {
      "optionText": "Precisamos falar sobre seus planos. Você ainda está pensando em voltar para o seu pai?",
      "responseText": "Quer dizer, acho que esse é o plano? A menos que… você ache que não é seguro? Eu vi o que tem lá fora, e é... aterrorizante.",
      "followUpOptions": [
        {
          "optionText": "Ainda não é seguro. Preciso de tempo para limpar a estrada.",
          "responseText": "Ah. Bem, acho que ficar aqui mais um pouco não vai fazer mal. Pelo menos você não está, tipo, me jogando de volta para as Vadias Saqueadoras. Obrigada por isso, a propósito."
        },
        {
          "optionText": "Sinceramente, acho que seria melhor você ficar aqui para sempre.",
          "onlyShowIfProgressionEventPlayed": "met_graces_father",
          "responseText": "Aqui? Para sempre? Quer dizer, não é terrível, mas e o meu pai? E se ele pensar que estou morta? E se ele estiver me esperando?",
          "followUpOptions": [
            {
              "optionText": "Eu conheci seu pai. Ele... não é um cara legal.",
              "responseText": "O quê? Como assim? Ele sempre foi... quer dizer, ele é rigoroso, claro, mas... ele ainda é meu pai. Ele disse alguma coisa sobre mim?",
              "followUpOptions": [
                {
                  "optionText": "Ele não parecia se importar muito em ter te perdido. Você merece coisa melhor.",
                  "responseText": "Ele não...? Eu... Isso realmente dói. Eu continuei esperando estar errada sobre o quão distante ele ficou depois que a mamãe morreu. Talvez eu estivesse me apegando a uma pessoa que já se foi há muito tempo."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Ah, ok! Uh, não some, tá? Quer dizer, não é como se eu tivesse mais alguém para conversar aqui... ainda.",
      "exitLine": true
    }
  ]
}
