{
    "options": [
        {
            "optionText": "Alright, Grace. Looks like you’re coming with me. Ready to go?",
            "dontDisplayIfHasObjective": "Talk to Tina",
            "dontDisplayIfObjectiveComplete": "Talk to Grace",
            "icon": "GUI/quest mark",
            "responseText": "Wait, you’re... you’re taking me? Like, actually rescuing me? Is this a joke or... are you serious?",
            "followUpOptions": [
                {
                    "optionText": "Dead serious. Pack up your... well, you don’t have anything. Let’s just go.",
                    "markObjectiveComplete": "Talk to Grace",
                    "exitLine": true,
                    "icon": "GUI/quest mark",
                    "addFollower": "Grace",
                    "addObjective": "Bring Grace to her father.",
                    "progressionEventPlayed": "grace_rescued",
                    "responseText": "Wow, way to rub it in. But okay, yeah, I’m ready. I think. Do you... have a coat or something? It’s a little breezy in this, uh, situation."
                },
                {
                    "optionText": "Not a joke, Grace. You’ve been through enough. Time to get you out of here.",
                    "markObjectiveComplete": "Talk to Grace",
                    "exitLine": true,
                    "icon": "GUI/quest mark",
                    "addObjective": "Bring Grace to her father.",
                    "addFollower": "Grace",
                    "progressionEventPlayed": "grace_rescued",
                    "responseText": "Thank you... I didn’t think anyone would actually come for me. I don’t even know what to say."
                },
                {
                    "optionText": "Serious as a deathclaw in heat. Let’s move before Tina changes her mind.",
                    "markObjectiveComplete": "Talk to Grace",
                    "exitLine": true,
                    "icon": "GUI/quest mark",
                    "addObjective": "Bring Grace to her father.",
                    "addFollower": "Grace",
                    "progressionEventPlayed": "grace_rescued",
                    "responseText": "Ew, thanks for that mental image. But yeah, good idea. Let’s not stick around for round two."
                }
            ]
        },
        {
            "optionText": "So, what’s the story with your dad? Tina made him sound like a big deal.",
            "dontDisplayIfHasObjective": "Talk to Tina",
            "responseText": "My dad? Oh, um... yeah, he’s kind of a big deal. He runs Cumorah Crest—what’s left of it, anyway. He’s always been about power and bottle caps.",
            "followUpOptions": [
                {
                    "optionText": "Sounds like he’ll pay a lot to get you back.",
                    "responseText": "He will. But, uh, just a heads-up—he’s not exactly the warm and fuzzy type. Don’t expect hugs and thank-you speeches."
                },
                {
                    "optionText": "Is he really gonna care? Tina made it sound like he might just be relieved you’re gone.",
                    "responseText": "Wow, harsh. But no, he’ll care. I mean, I think he will? I’m still technically his daughter, even if I’m not his favorite... or his second favorite... or... let’s just go."
                },
                {
                    "optionText": "Do you even know how to survive out there?",
                    "responseText": "Um... no? I mean, I’ve read books. Does that count? I know not to drink out of glowing puddles, and I can sort of cook...",
                    "followUpOptions": [
                        {
                            "optionText": "Books, huh? Yeah, those will totally keep you alive. Stick close, rookie.",
                            "responseText": "Rookie? Okay, rude. But yeah, sticking close sounds like a solid plan right now."
                        },
                        {
                            "optionText": "We’ll work on that. First lesson: don’t trust raiders.",
                            "responseText": "Lesson learned. Big time. Can we move on to 'how not to freeze to death in raider underwear' next?"
                        }
                    ]
                }
            ]
        },
        {
            "optionText": "Tina said you’re... well, a virgin. That true?",
            "dontDisplayIfHasObjective": "Talk to Tina",
            "responseText": "What?! Oh my God, she told you that? Why—why would she even say that?! That’s so weird!",
            "followUpOptions": [
                {
                    "optionText": "She thought it made you valuable. I’m guessing she’s not wrong.",
                    "responseText": "Great. So I’m just a walking unopened box in Raiderland now? Cool. Love that for me."
                },
                {
                    "optionText": "Relax. I don’t care. Just making sure she wasn’t exaggerating.",
                    "responseText": "Oh, well, uh, yeah... no exaggeration. I didn’t exactly have a lot of... opportunities at the Crest."
                } 
            ]
        },  
        {
            "optionText": "What’s your name? You got a story?",
            "responseText": "Oh, um, it’s Grace. Grace Wells. I used to live somewhere called Cumorah Crest. It was... different from all this. Then they came. The raiders. And now, I guess, here I am.",
            "followUpOptions": [
                {
                    "optionText": "Cumorah Crest? Sounds fancy.",
                    "responseText": "It was. Too fancy, maybe. My dad thought walls and caps could protect us. Turns out, he was wrong."
                },
                {
                    "optionText": "Sorry you had to go through that. The wasteland’s brutal.",
                    "responseText": "Thanks. I don’t think I’ve really processed it yet. Everything’s just... gone."
                }
            ]
        }, 
        {
            "optionText": "Bye.",
            "responseText": "Wait—you’re just leaving me here?",
            "exitLine": true
        }
    ]
} 