{
  "options": [
    {
      "optionText": "Certo, Grace. Parece que você vem comigo. Pronta para ir?",
      "dontDisplayIfHasObjective": "Talk to Tina",
      "dontDisplayIfObjectiveComplete": "Talk to Grace",
      "icon": "GUI/quest mark",
      "responseText": "Espere, você está... você está me levando? Tipo, realmente me resgatando? Isso é uma piada ou... você está falando sério?",
      "followUpOptions": [
        {
          "optionText": "Seríssimo. Arrume suas... bem, você não tem nada. Vamos apenas ir.",
          "markObjectiveComplete": "Talk to Grace",
          "exitLine": true,
          "icon": "GUI/quest mark",
          "addFollower": "Grace",
          "addObjective": "Bring Grace to her father.",
          "progressionEventPlayed": "grace_rescued",
          "responseText": "Uau, bela maneira de esfregar na cara. Mas ok, sim, estou pronta. Acho. Você... tem um casaco ou algo assim? Está um pouco ventoso nesta, uh, situação."
        },
        {
          "optionText": "Não é piada, Grace. Você já passou por o suficiente. Hora de te tirar daqui.",
          "markObjectiveComplete": "Talk to Grace",
          "exitLine": true,
          "icon": "GUI/quest mark",
          "addObjective": "Bring Grace to her father.",
          "addFollower": "Grace",
          "progressionEventPlayed": "grace_rescued",
          "responseText": "Obrigada... não pensei que alguém realmente viria por mim. Nem sei o que dizer."
        },
        {
          "optionText": "Sério como um deathclaw no cio. Vamos antes que a Tina mude de ideia.",
          "markObjectiveComplete": "Talk to Grace",
          "exitLine": true,
          "icon": "GUI/quest mark",
          "addObjective": "Bring Grace to her father.",
          "addFollower": "Grace",
          "progressionEventPlayed": "grace_rescued",
          "responseText": "Ew, obrigada por essa imagem mental. Mas sim, boa ideia. Não vamos ficar para o segundo round."
        }
      ]
    },
    {
      "optionText": "Então, qual é a história com seu pai? A Tina o fez parecer um figurão.",
      "dontDisplayIfHasObjective": "Talk to Tina",
      "responseText": "Meu pai? Ah, um... sim, ele é meio que um figurão. Ele comanda Cumorah Crest—o que sobrou dela, de qualquer forma. Ele sempre foi sobre poder e tampinhas de garrafa.",
      "followUpOptions": [
        {
          "optionText": "Parece que ele vai pagar muito para te ter de volta.",
          "responseText": "Vai sim. Mas, uh, só um aviso—ele não é exatamente do tipo caloroso e fofo. Não espere abraços e discursos de agradecimento."
        },
        {
          "optionText": "Ele realmente vai se importar? A Tina fez parecer que ele talvez fique aliviado por você ter sumido.",
          "responseText": "Uau, pesado. Mas não, ele vai se importar. Quero dizer, acho que vai? Eu ainda sou tecnicamente a filha dele, mesmo que não seja a favorita dele... ou a segunda favorita... ou... vamos apenas ir."
        },
        {
          "optionText": "Você sequer sabe como sobreviver lá fora?",
          "responseText": "Hum... não? Quero dizer, eu li livros. Isso conta? Sei que não se deve beber de poças brilhantes, e sei cozinhar mais ou menos...",
          "followUpOptions": [
            {
              "optionText": "Livros, hein? Sim, isso vai te manter viva. Fique perto, novata.",
              "responseText": "Novata? Ok, grosseiro. Mas sim, ficar perto parece um plano sólido agora."
            },
            {
              "optionText": "Vamos trabalhar nisso. Primeira lição: não confie em saqueadores.",
              "responseText": "Lição aprendida. E como. Podemos passar para 'como não morrer de frio em roupa íntima de saqueador' a seguir?"
            }
          ]
        }
      ]
    },
    {
      "optionText": "A Tina disse que você é... bem, virgem. É verdade?",
      "dontDisplayIfHasObjective": "Talk to Tina",
      "responseText": "O quê?! Oh meu Deus, ela te contou isso? Por que—por que ela diria isso?! Isso é tão estranho!",
      "followUpOptions": [
        {
          "optionText": "Ela achou que isso te tornava valiosa. E acho que ela não está errada.",
          "responseText": "Ótimo. Então agora sou apenas uma caixa fechada ambulante em Raiderland? Legal. Adoro isso para mim."
        },
        {
          "optionText": "Relaxe. Não me importo. Só queria ter certeza de que ela não estava exagerando.",
          "responseText": "Ah, bem, uh, sim... sem exagero. Eu não tive exatamente muitas... oportunidades no Crest."
        }
      ]
    },
    {
      "optionText": "Qual é o seu nome? Você tem uma história?",
      "responseText": "Oh, um, é Grace. Grace Wells. Eu morava em um lugar chamado Cumorah Crest. Era... diferente de tudo isso. Então eles vieram. Os saqueadores. E agora, eu acho, aqui estou eu.",
      "followUpOptions": [
        {
          "optionText": "Cumorah Crest? Parece chique.",
          "responseText": "Era. Chique demais, talvez. Meu pai achou que muros e tampinhas de garrafa poderiam nos proteger. Acontece que ele estava errado."
        },
        {
          "optionText": "Sinto muito que tenha passado por isso. A wasteland é brutal.",
          "responseText": "Obrigada. Acho que ainda não processei tudo. Tudo simplesmente... se foi."
        }
      ]
    },
    {
      "optionText": "Tchau.",
      "responseText": "Espere—você vai simplesmente me deixar aqui?",
      "exitLine": true
    }
  ]
}
