{
  "options": [
    {
      "optionText": "[Observar]",
      "spriteAtTheEndOfHscene": "Characters/Grace Wells/masturbating",
      "spriteAtTheEndOfHscenePosition": [7.12, -0.6],
      "changeSprite": "Characters/Grace Wells/Focused/masturbating",
      "setBGcolor": "#FFFFFF",
      "exitLine": true,
      "isHEventStarted": true,
      "closeDialogueOptions": true,
      "progressionEventPlayed": "first_grace_masturbation",
      "newSpriteXPos": 0.8,
      "newSpriteYPos": 0.3,
      "swapAnotherCharacterDialogue": [
        "Grace Wells",
        "Characters/Grace Wells/post_fapping"
      ],
      "icon": "GUI/eye icon",
      "hEventName": "grace_masturbation",
      "lineAfterHevent": "Ahhh… ok, Grace. Você oficialmente ama se tocar. Parabéns por se tornar a garota mais excitada do refúgio!",
      "auto_lines": [
        "Ok... respira fundo, Grace. É só se tocar, certo? Quão complicado pode ser?",

        "Oh, Deus… oh, Deus… e se alguém entrar…",

        "Por que as pessoas fazem tanto alarde sobre isso, afinal… tipo, é só pele, né? Só—oh... oh meu...",

        "Ahh… que sensação foi essa? Foi meio… brilhante? Formigante?",

        "Mmm, ok, isso é estranhamente bom… Por que eu não fiz isso antes?",

        "Oh, Deus, aquele botãozinho... é super sensível. Não é à toa que todo mundo é obcecado por isso!",

        "Uh, isso é normal? É tipo… eletricidade, mas boa. Muito boa.",

        "Mmm, ok… vai com calma, Grace. Você deveria saborear, certo? Certo?",

        "Oh… oh uau, não acredito que estou realmente fazendo isso—mmm… quebrar as regras nunca foi tão bom…",

        "Ugh… dedos estúpidos… só… continuem…",

        "Ahh… Essa coisa toda do refúgio é uma loucura. Como eles podem proibir algo tão incrível?",

        "Ah! Minhas pernas estão tremendo… uh, o que eu deveria pensar agora?",

        "Mmm, imaginar as mãos de outra pessoa em vez das minhas torna tudo ainda melhor… oh Deus, isso é tão safado!",

        "Ah, uh, essa umidade—isso é normal? Eu deveria estar pingando tanto assim?",

        "Uhh, oh Deus… eu preciso de mais… mais forte? Mais rápido? Eu não sei! Só—mmm—mais!",

        "Eu não deveria estar fazendo isso… mas é… bom demais…",

        "Ah, oh uh, acho que vou explodir se continuar—uh, isso deveria acontecer?!",

        "Mmm, por que ninguém me disse que minha xoxota podia se sentir assim? É como descobrir um poder oculto…",

        "Ahhh, uh… por que eu continuo imaginando outros me observando agora? Por que isso me excita ainda mais?",

        "Oh Deus… mmm… eu queria que alguém estivesse aqui me observando fazer isso. Uh, isso é tão sujo… por que isso torna tudo ainda melhor?",

        "Uh, acho que estou perto? Estou perto? Oh meu Deus, como eu vou saber!?",

        "Mmm—oh uh, uh—algo está acontecendo! Oh Deus, estou quebrando alguma coisa!?",

        "Ahhhh… oh Deus… uh sim… é isso? Isso é incrível, eu vou chorar!",

        "Uh… é por isso que todo mundo sempre parece tão feliz depois de escapar para seus quartos?",

        "Ohhh, uau… é como se meu corpo inteiro tivesse acabado de me agradecer. Por que ninguém me disse?",

        "Mmm, oh meu Deus… com certeza vou fazer isso de novo… tipo, em dez segundos. Isso pode? Dá pra ter uma overdose disso?",

        "Ahhh, eu nem me importo… que se danem as regras, minha xoxota exige atenção!",

        "Oh Deus, meus dedos parecem perfeitos lá… é estranho se eu os chamar de meus novos melhores amigos?",

        "Uh, pensar em como alguém reagiria ao me ver assim… me dá vontade de continuar…",

        "Ohh, se me tocar é tão bom, quanto melhor os dedos de alguém — ou outra coisa — poderiam ser?",

        "Deus, isso é incrível… uh as regras. uh esperar. Preciso que alguém me veja assim…"
      ],
      "endingEffects": ["Flashes"]
    }
  ],
  "auto_lines": [
    "Ok... respira fundo, Grace. É só se tocar, certo? Quão complicado pode ser?",

    "Por que as pessoas fazem tanto alarde sobre isso, afinal… tipo, é só pele, né? Só—oh... oh meu..."
  ]
}
