{
  "options": [
    {
      "optionText": "Então... e agora?",
      "icon": "GUI/quest mark",
      "dontShowIfProgressionEventPlayed": "hansGavePassword",
      "progressionEventPlayed": "speakingWithHansAfterPurge",
      "responseText": "Agora? Eu deixo este monte de composto e retorno para onde a civilização ainda existe. Você se provou útil, então vou te dar um presente: acesso à Cidadela do Enclave.",
      "followUpOptions": [
        {
          "optionText": "Continue...",
          "responseText": "**Coordenadas:** 22.91°N, 102.77°O. Antiga estação de energia sob o Lago Turquesa. **Senha:** *Legado do Éden*. Diga a um dos guardas e eles saberão que você é meu representante. Não estrague tudo.",
          "progressionEventPlayed": "hansGavePassword",
          "addObjective": "Entrar na Cidadela do Enclave",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Hans... QUE PORRA VOCÊ FEZ?!",
      "progressionEventPlayed": "speakingWithHansAfterPurge",
      "responseText": "Eu fiz o que VOCÊ não pôde. O que NINGUÉM teve coragem de fazer! Os indignos se foram, o sangue deles é a tinta que escreverá o futuro do refúgio. Lindo, não é?",
      "followUpOptions": [
        {
          "optionText": "Lindo? Você está parado numa poça do baço do Paul!",
          "responseText": "Ah, Paul. Um homem sem ambição, sem propósito... e um baço perturbadoramente pequeno. Ele serviu como exemplo do que acontece com os fracos!",
          "followUpOptions": [
            {
              "optionText": "Tenho que admitir... o Paul era um cuzão.",
              "responseText": "Exato! Paul era um microcosmo de tudo que havia de errado neste refúgio. Sua morte foi um ato de caridade."
            },
            {
              "optionText": "Não, você é um psicopata. Hora de eu dar o fora daqui.",
              "responseText": "Corra, pequeno verme. Você só atrasará a purificação inevitável. E confie em mim, o acerto de contas está CHEGANDO!",
              "exitLine": true
            },
            {
              "optionText": "Hora de te abater como o cão raivoso que você é...",
              "itemRequired": "Knife",
              "nutSuckerKilled": true,
              "killCharacter": true,
              "responseText": "Me abater? Ah, por favor, eu sou o alfa aqui, queridi... AAAHHH!",
              "exitLine": true
            }
          ]
        },
        {
          "optionText": "Isso não é purificação! É um filme de terror do caralho!",
          "responseText": "Terror? Não, não, não. Isso é ARTE. Os diretores pré-guerra DESEJARIAM ter o orçamento para este nível de carnificina.",
          "followUpOptions": [
            {
              "optionText": "O que quer que te ajude a dormir à noite, psicopata.",
              "responseText": "Ah, eu durmo como um bebê. Os gritos dos indignos são minha canção de ninar."
            },
            {
              "optionText": "Não consigo nem ficar bravo, Hans. Isso é tão FODIDO que é impressionante.",
              "responseText": "Obrigado! Finalmente, alguém que aprecia os detalhes mais refinados do renascimento social através da destruição criativa. A arte sempre ofende os pouco inteligentes. Mas você? Você entende."
            }
          ]
        },
        {
          "optionText": "Você massacrou a Diana. Ela era uma das poucas pessoas decentes que restavam!",
          "onlyShowIfProgressionEventPlayed": "talkedToDianaAfterPurge",
          "responseText": "Diana? Aquela esponja de sêmen manipuladora? Ela colecionava homens como tampinhas de garrafa e se vestia como se não fosse apenas mais um vetor de DST ambulante. Sem disciplina. Sem legado. Nenhuma perda."
        },
        {
          "optionText": "A filha do Supervisor... Ela era só uma criança, cara.",
          "onlyShowIfProgressionEventPlayed": "talkedToODAfterPurge",
          "responseText": "Doutrinada desde o nascimento para manter este sistema de piada. O pai dela era um fracasso — ela não seria muito diferente. Eu corto as linhagens ruins como um tumor."
        },
        {
          "optionText": "Você matou a Gina. Ela não fez nada para você.",
          "onlyShowIfProgressionEventPlayed": "talkedToGinaAfterPurge",
          "responseText": "Exatamente. Ela *existia*. Isso foi o suficiente. Ela tinha um útero e valor zero: comedora emocional, reprodutora emocional. Nada além de uma sopa de hormônios num avental. Não era material para mãe — apenas uma puta inútil."
        }
      ]
    },
    {
      "optionText": "Eu só vou indo...",
      "responseText": "Ah, vá em frente! Corra de volta para o seu cantinho de mediocridade. Mas saiba de uma coisa: a mediocridade sempre morre no final.",
      "exitLine": true
    }
  ],
  "showShadowFigures": "HansSelectedGirls"
}
