{
  "options": [
    {
      "optionText": "Aqui, é isso que você queria?",
      "icon": "GUI/quest mark",
      "itemRequired": "Raider's Automatic Rifle",
      "onlyDisplayIfHasObjective": "Get a Gun for Hans",
      "markObjectiveComplete": "Get a Gun for Hans",
      "giveItemToCharacter": "Raider's Automatic Rifle",
      "showChoiceStats": "hansGotGun",
      "responseText": "Ah, agora *sim*! Esta belezinha vai servir... muito bem. Você acabou de se tornar *muito* útil e garantiu um lugar na nova ordem, meu amigo. Com isto, posso parar de fingir que sou um desses degenerados. Agora o verdadeiro trabalho começa. Chega de compromissos. Chega de piscinas de acasalamento cheias de posseiros consanguíneos.",
      "followUpOptions": [
        {
          "optionText": "Então, qual é o próximo passo?",
          "responseText": "Próximo passo? Ah, a diversão começa agora. Manterei as coisas quietas por um tempo — deixar os fracos se sentirem seguros. Isolamos o estoque viável — talvez dois, três no máximo — e quando for a hora certa, nós *extraímos*. Você terá seu papel a desempenhar, é claro. Sempre há necessidade de pessoas capazes no novo regime."
        },
        {
          "optionText": "É melhor você se lembrar de mim quando tomar o poder.",
          "responseText": "Ah, confie em mim — você será recompensado muito além dos seus sonhos mais loucos. Não me esqueço daqueles que provam seu valor, e você acabou de provar o seu. Você pode não se qualificar para o programa de reprodução — mas nem todos precisam ser doadores. Alguns de nós são simplesmente executores."
        },
        {
          "optionText": "Não comece um massacre imediatamente. Precisamos planejar isso com cuidado.",
          "responseText": "Massacre? Não, não. Não imediatamente. Precisamos de sutileza primeiro, precisão. Mas não se preocupe... haverá um momento para a *ação*, e quando esse momento chegar, a purga será rápida. Faremos isso de forma inteligente e faremos direito.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Quem é você?",
      "icon": "GUI/quest mark",
      "dontShowIfProgressionEventPlayed": "agreed_to_help_hans",
      "responseText": "Quem sou eu? Há! Eu sou Hans 'Übercel' Schmidt, escolhido pelo destino e pela minha linhagem superior para purificar este refúgio da degenerescência. Vocês todos são parasitas roendo os ossos do velho mundo e eu fui enviado aqui para avaliar o que é recuperável — e a coisa não parece boa.",
      "followUpOptions": [
        {
          "optionText": "O que isso significa? Recuperável?",
          "responseText": "Pureza genética. Faixa de fertilidade. Potencial cognitivo. A maioria dos residentes aqui? Fracassos. DNA lixo enfiado em cáqui. A única razão pela qual ainda estou aqui é porque há uma *fração* de material reprodutivo viável andando por aí."
        },
        {
          "optionText": "Você quer dizer... você é do Enclave?",
          "responseText": "Ah, finalmente. Uma célula cerebral dispara. Sim — eu nasci Enclave, fui treinado Enclave, enviado pelo Enclave. Nós nunca desaparecemos, apenas paramos de perder tempo nos explicando para sub-humanos. Nós somos a continuidade da ordem, e estou aqui para peneirar este aterro genético em busca de algo que valha a pena salvar.",
          "followUpOptions": [
            {
              "optionText": "Sabe, eu concordo. Este refúgio é um show de horrores.",
              "icon": "GUI/quest mark",
              "responseText": "Finalmente. Alguém que consegue ver através da ilusão mofada da 'igualdade'. Este lugar é um experimento social que deu errado — idiotas procriando com viciados, parasitas votando na liderança. É um zoológico sem jaulas. Mas com a aliança certa... poderíamos abater os piores e elevar os dignos.",
              "followUpOptions": [
                {
                  "optionText": "Eu poderia ser convencido a te ajudar... se o plano for bom.",
                  "icon": "GUI/quest mark",
                  "responseText": "Ah, agora estamos chegando a algum lugar. O plano, veja bem, é tão simples quanto genial: Identificar o estoque fértil — jovem, puro, com boa proporção quadril-crânio — e extrair. O resto? Bem, digamos apenas que eles serão 'removidos' da equação.",
                  "followUpOptions": [
                    {
                      "optionText": "Fértil? Quer dizer, você está planejando escolher quem vai viver?",
                      "responseText": "Alguém tem que fazer isso. Você acha que deixar posseiros com QI abaixo de 80 terem filhos vai salvar a humanidade? Não. Nós escolhemos a dedo os reprodutores. Qualquer coisa menos que isso é sabotagem contra nossa espécie. Por que deixar os fracos nos arrastarem para baixo? O futuro не precisa de massas de mediocridade. Precisa de alguns poucos selecionados — escolhidos a dedo, indivíduos *puros* que podem reiniciar a humanidade da maneira *certa*."
                    },
                    {
                      "optionText": "E o que acontece com todos os outros?",
                      "responseText": "Todos os outros? Eles já ultrapassaram sua utilidade. Assim que tivermos o que precisamos, eles serão tratados — silenciosamente, é claro. Sem bagunça, sem confusão."
                    },
                    {
                      "optionText": "O que exatamente você quer de mim?",
                      "icon": "GUI/quest mark",
                      "responseText": "Ah, então você está interessado em agir, é? Bom. Preciso de uma arma — algo barulhento o suficiente para que esses idiotas fiquem fora do meu caminho enquanto eu movo os ativos. Consiga uma para mim, e você ganhará um lugar na nova ordem. Pode até conseguir direitos de reprodução se seus cromossomos não forem lixo.",
                      "followUpOptions": [
                        {
                          "optionText": "Você quer dizer, tipo uma arma?",
                          "responseText": "Exatamente. Uma pequena apólice de seguro. Com uma arma em minhas mãos, serei capaz de guiar este navio na direção certa."
                        },
                        {
                          "optionText": "Estou dentro. Este refúgio precisa de uma mudança.",
                          "icon": "GUI/quest mark",
                          "addObjective": "Get a Gun for Hans",
                          "progressionEventPlayed": "agreed_to_help_hans",
                          "exitLine": true,
                          "responseText": "Inteligente. Muito inteligente. Com você ao meu lado, vamos consertar as coisas. Consiga essa arma para mim — temos um refúgio para purgar."
                        },
                        {
                          "optionText": "Vou pensar sobre isso, mas não conte comigo.",
                          "responseText": "Pense com cuidado. Quando este refúgio começar a desmoronar, você vai querer estar alinhado com alguém que tem um plano — e a *vontade* de executá-lo. Não vou esperar para sempre, mas quando estiver pronto, você sabe onde me encontrar."
                        }
                      ]
                    }
                  ]
                },
                {
                  "optionText": "Eu concordo. As pessoas são burras pra caralho.",
                  "responseText": "Burras, doentes, iludidas. Você poderia mostrar a esses mutantes um defeito genético em sua própria linhagem e eles ainda gritariam sobre 'inclusividade'. O refúgio é um zoológico de fracassos. Mas não por muito tempo. Não com pessoas como *nós* prontas para zerar o placar."
                }
              ]
            },
            {
              "optionText": "Você é louco. Vou te denunciar.",
              "icon": "GUI/police hat",
              "responseText": "O que você acabou de dizer? Me denunciar? Há! Vá em frente — corra. Você acha que eu não planejei isso? Eu *sou* o futuro, e quando a hora chegar, você se arrependerá de ter se voltado contra mim.",
              "followUpOptions": [
                {
                  "optionText": "Eles saberão a verdade sobre seus planos doentios em breve. [Denunciar]",
                  "exitLine": true,
                  "fadeOutCharacter": true,
                  "killCharacter": true,
                  "showChoiceStats": "hansReported",
                  "icon": "GUI/police hat",
                  "progressionEventPlayed": "hans_reported",
                  "addSusPoints": -40,
                  "addWillpowerTokens": 100,
                  "responseText": "A verdade? Seu tolo ingênuo. Você acha que eles vão agir com base na sua pequena 'denúncia'? Há! Mas anote minhas palavras, quando a purga começar, traidores como você serão os primeiros a ir."
                },
                {
                  "optionText": "Na verdade, deixa pra lá... vou guardar seu segredinho.",
                  "responseText": "Hmm, escolha inteligente. Você não quer estar do lado errado da história quando as coisas acontecerem. Lembre-se, não esqueço meus amigos — ou meus inimigos. Cuidado onde pisa, e talvez você permaneça do meu lado bom."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "O que você acha do refúgio?",
      "responseText": "Este refúgio? É um zoológico cheio de vira-latas, todos fingindo que são civilizados. Eles andam por aí como se fossem especiais, mas consigo sentir o cheiro da *fraqueza* a um quilômetro de distância. Este lugar deveria ser um santuário para os *dignos* — mas o Supervisor deixou entrar todo sub-humano de queixo fraco que encontrou.",
      "followUpOptions": [
        {
          "optionText": "E o Supervisor?",
          "responseText": "O Supervisor? Iludido demais, disposto demais a tolerar... contaminação genética. Um líder de verdade já teria eliminado os indesejáveis, se é que me entende."
        },
        {
          "optionText": "Você se acha melhor que todo mundo aqui, hein?",
          "responseText": "Ah, eu não sou melhor. Eu sou *significativamente* melhor. Se cérebros fossem balas, você estaria atirando com um mosquete enquanto eu operaria um sistema de defesa de mísseis totalmente automatizado. Vocês são plantas de interior pós-apocalípticas — agarrando-se a restos de civilidade. Eu não quero governar vocês. Eu quero apagar vocês."
        }
      ]
    },
    {
      "optionText": "No que você acredita?",
      "responseText": "Legado. Estrutura. Arquitetura genética. Os Ermos são um teste, e a maioria de vocês está falhando. O futuro pertence às linhagens que o *conquistam*. Se isso me faz parecer frio, ótimo. Prefiro ser frio do que extinto.",
      "followUpOptions": [
        {
          "optionText": "Legado? Cara, é o apocalipse, ninguém se importa com quem era seu avô.",
          "responseText": "Certo. Continue dizendo isso a si mesmo enquanto observa seus netos se transformarem em abominações com cara de polegar. Legado é *tudo*! Os fortes sobrevivem e ascendem ao poder, enquanto os fracos acabam roendo ossos velhos de Brahmins no jantar."
        },
        {
          "optionText": "Você já parou pra pensar que talvez não seja tão importante quanto pensa?",
          "responseText": "Toda vez que respiro este ar imundo reciclado. Mas então eu olho ao redor e me lembro: o nível está baixíssimo. Não preciso ser importante — só preciso ser *menos defeituoso* que o resto de vocês."
        },
        {
          "optionText": "Qual é a sua visão para este seu 'mundo perfeito'?",
          "responseText": "Limpeza. Sem peso morto. Sem descendentes de código misto. Uma nova gênese, estruturada em torno da força verificável — mental, física, reprodutiva. Os fracos recebem o silêncio. Os fortes recebem o legado. Esse é o contrato."
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Vá em frente. Apenas lembre-se — quando as luzes se apagarem neste refúgio para sempre, você vai querer estar ao lado de alguém com uma visão para o futuro. Não daqueles que estão prestes a ser abatidos.",
      "exitLine": true
    }
  ]
}
