{
    "options": [
        {
          "optionText": "So... what now?",
          "icon": "GUI/quest mark",
          "dontShowIfProgressionEventPlayed": "hansGavePassword",
          "progressionEventPlayed": "speakingWithHansAfterPurge",
          "responseText": "Now? I leave this compost heap and return to where civilization still exists. You’ve proven yourself useful, so I’ll give you a gift: access to the Enclave Citadel.",
          "followUpOptions": [
            {
              "optionText": "Go on...",
              "responseText": "**Coordinates:** 22.91°N, 102.77°W. Old world power station under Lake Turquoise. **Password:** *Eden's Legacy*. Tell it to one of the guards and they’ll know you’re my proxy. Don’t screw this up.",
              "progressionEventPlayed": "hansGavePassword",
              "addObjective": "Enter the Enclave Citadel",
              "exitLine": true
            } 
          ]
        },
        {
            "optionText": "Hans... WHAT THE HELL DID YOU DO?!",
            "progressionEventPlayed": "speakingWithHansAfterPurge",
            "responseText": "I did what YOU couldn’t. What NO ONE had the guts to do! The unworthy are gone, their blood is the ink that will write the vault's future. Beautiful, isn't it?",
            "followUpOptions": [
                {
                    "optionText": "Beautiful? You’re standing in a puddle of Paul's spleen!",
                    "responseText": "Ah, Paul. A man of no ambition, no purpose... and a disturbingly small spleen. He served as an example of what happens to the weak!",
                    "followUpOptions": [ 
                        {
                            "optionText": "Gotta admit... Paul was a bitch.",
                            "responseText": "Exactly! Paul was a microcosm of everything wrong with this vault. His death was an act of charity." 
                        },
                        {
                            "optionText": "Nah, you’re a psycho. Time for me to nope out of here.",
                            "responseText": "Run, little worm. You’ll only delay the inevitable cleansing. And trust me, the reckoning is COMING!",
                            "exitLine": true
                        },
                        {
                            "optionText": "Time to put you down like the rabid dog you are...",
                            "itemRequired": "Knife",
                            "nutSuckerKilled": true,
                            "killCharacter": true,
                            "responseText": "Put ME down? Oh please, I’m the alpha here, cupca—AAAHHH!",
                            "exitLine": true
                        }
                    ]
                },
                {
                    "optionText": "This isn’t purification! It’s a goddamn horror movie!",
                    "responseText": "Horror? No, no, no. This is ART. The pre-war directors WISH they had the budget for this level of carnage.",
                    "followUpOptions": [ 
                        {
                            "optionText": "Whatever helps you sleep at night, psycho.",
                            "responseText": "Oh, I sleep like a baby. The screams of the unworthy are my lullaby." 
                        },
                        {
                            "optionText": "I can’t even be mad, Hans. This is so FUCKED UP it’s impressive.",
                            "responseText": "Thank you! Finally, someone who appreciates the finer details of societal rebirth through creative destruction. Art always offends the unintelligent. But you? You get it." 
                        }
                    ]
                },
                {
                    "optionText": "You've butchered Diana. She was one of the few decent people left!",
                    "onlyShowIfProgressionEventPlayed": "talkedToDianaAfterPurge",
                    "responseText": "Diana? That manipulative little semen sponge? She collected men like bottle caps and played dress-up like she wasn’t just another walking STD vector. No discipline. No legacy. No loss."
                },
                {
                    "optionText": "Overseer's daughter... She was just a kid, man.",
                    "onlyShowIfProgressionEventPlayed": "talkedToODAfterPurge",
                    "responseText": "Indoctrinated from birth to uphold this joke of a system. Her father was a failure—she wasn't going to turn out much different. I cut the bad bloodlines like a tumor."
                },
                {
                    "optionText": "You've killed Gina. She didn’t do anything to you.",
                    "onlyShowIfProgressionEventPlayed": "talkedToGinaAfterPurge",
                    "responseText": "Exactly. She *existed*. That was enough. She had a womb and zero worth: emotional eater, emotional breeder. Nothing but hormone soup in an apron. Not mother material—just a worthless whore."
                }
            ]
        }, 
        {
            "optionText": "I’m just gonna go...",
            "responseText": "Oh, go ahead! Run back to your little corner of mediocrity. But know this: mediocrity always dies in the end.",
            "exitLine": true
        } 
    ],
    "showShadowFigures": "HansSelectedGirls"
} 