{
  "options": [
    {
      "optionText": "Uh... Hugh? Você tá bem?",
      "responseText": "*[Hugh encara para a frente, tremendo levemente]* Ela... ela nem pisca. Só fica sentada ali. Como a tentação destilada em forma humana. Eu não estou bem. Eu *nunca* mais vou ficar bem.",
      "followUpOptions": [
        {
          "optionText": "Por que você não desvia o olhar, cara?",
          "responseText": "Eu *não consigo*. É como tentar desviar o olhar de uma explosão nuclear. Minhas córneas estão queimadas nas coxas dela. Consigo ver as curvas quando fecho os olhos agora. Me ajude."
        },
        {
          "optionText": "Você já viu coisa pior, né? Em holofitas pornô?",
          "responseText": "Holofitas não *respiram*, mano. Elas não movem as pernas lentamente a cada cinco minutos como se fosse um acidente. Essa mulher está jogando jogos mentais de nível divino com o meu pau. E eu estou perdendo."
        },
        {
          "optionText": "Só não fica encarando, cara. Foca em outra coisa.",
          "responseText": "Focar? Mano, meu cérebro é uma bagunça de curvas proibidas. Tentei contar as placas do teto e acabei gemendo na quarta placa. Eu não sei mais quem eu sou."
        },
        {
          "optionText": "Ela te disse alguma coisa?",
          "responseText": "Nenhuma palavra. Essa é a pior parte. Silêncio. Serenidade total de olhos fechados. É como assistir a um monge nu meditando à beira da minha sanidade. Eu espirrei uma vez e ela se *espreguiçou*. Eu quase morri."
        },
        {
          "optionText": "Você está suando. Tipo... muito.",
          "responseText": "Não é suor. É medo pré-gozada. Tentei pensar em estatísticas de beisebol и acabei imaginando ela lambendo um taco. Estou preso no purgatório da tesão."
        }
      ]
    },
    {
      "optionText": "Vira homem. Ela só tá te provocando.",
      "responseText": "Você acha que eu não sei?! Isso é guerra. Guerra psicológica baseada em tetas. Ela está jogando xadrez 8D com os mamilos dela e eu estou preso jogando damas com a minha mão.",
      "followUpOptions": [
        {
          "optionText": "Já considerou fechar *seus* olhos?",
          "responseText": "Tentei. Acabei vendo ela *melhor*. É como se ela estivesse dentro da minha mente."
        },

        {
          "optionText": "Foi isso que finalmente te quebrou?",
          "responseText": "Não, o que me quebrou foi o *momento* em que ela coçou a coxa. Apenas uma coçada longa e preguiçosa. Eu transcendi. Vi Deus. Ele também estava chorando."
        },
        {
          "optionText": "Por que você não fode ela?",
          "responseText": "*[Hugh se encolhe violentamente]* Você tá maluco?! Aquilo não é uma mulher — é uma sereia feita de tetas e dano psicológico. Aquilo não é sexo. É uma luta de chefe. Você não fode a Diana... você *entra* nela como um refúgio amaldiçoado e reza para sair com sua alma intacta.",
          "followUpOptions": [
            {
              "optionText": "Você tem medo dela? Sério? Pensei que você fosse o campeão da punheta do Refúgio 6969.",
              "responseText": "Exatamente! Eu sou o campeão — eu sei quando sou superado. Isso não é uma mulher. Isso é uma deusa. Ela tem debuffs passivos que acionam alucinações de vergonha. Uma vez, eu fui pegar meu cinto e vi minha avó morta gritando 'NÃO!'"
            },
            {
              "optionText": "Você conseguiria. É só ir lá e pegar ela.",
              "responseText": "*[Os olhos de Hugh se arregalam de horror]* Não. Pelo amor do meu pau, eu não conseguiria. Esse caminho leva à loucura. Ela *quer* que você tente. É assim que ela vence. Ela vai respirar um pouco diferente e você vai gozar pelos dentes."
            },
            {
              "optionText": "Você é patético. Rasteje para o canto e termine de apodrecer.",
              "responseText": "*[Hugh rasteja alguns centímetros para longe, resmungando]* Talvez o mofo tenha piedade. Talvez eu possa bater uma para o fungo. Eu mereço isso.",
              "exitLine": true
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Não me deixe. Ela pode suspirar de novo. Se ela suspirar, eu posso gozar de pura exaustão psíquica.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Ela não disse uma palavra o dia inteiro. Mas a bunda dela está falando em línguas. Não fui feito para esta guerra psicológica. Por favor, me mate ou me cegue. O que quer que me tire deste pesadelo..."
  ]
}
