{
  "options": [
    {
      "optionText": "Você percebeu que o refúgio inteiro tá transando agora, né?",
      "responseText": "Espera, o quê?! É sério? O Refúgio da Abstinência finalmente virou o Refúgio da Putaria? Merda, será que eu bati tanta punheta que alucinei meus sonhos pra realidade?",
      "followUpOptions": [
        {
          "optionText": "Sério. O Supervisor foi derrubado. É uma orgia lá fora.",
          "responseText": "Porra, e eu tô preso aqui batendo uma sozinho que nem um fodido de um perdedor? Alguém tira meu pau da aposentadoria — tenho que recuperar o tempo perdido!"
        },
        {
          "optionText": "Quer que eu te solte?",
          "responseText": "Tá brincando? Isso são as minhas Olimpíadas — meu pau treinou pra este momento a vida inteira! Me tira daqui, e eu vou gozar em toda a população do refúgio!"
        },
        {
          "optionText": "Sinceramente, surpreso que você não sentiu as vibrações da orgia através das paredes.",
          "responseText": "Mano, minhas bolas tão vibrando há anos — eu só achava que era saco azul crônico. Acontece que era o refúgio inteiro fodendo sem mim. Caralho, que trágico."
        },
        {
          "optionText": "Ainda atrás daquele Botão de Liberação de Emergência?",
          "responseText": "Cara, foda-se o botão! Se o que você tá dizendo é verdade, o refúgio inteiro acabou de virar a maior revista pornô do mundo. Tô prestes a mergulhar de pau em primeiro lugar no paraíso!"
        }
      ]
    },
    {
      "optionText": "Por que você ainda não fugiu? A porta está destrancada.",
      "responseText": "Espera, a porta estava destrancada?! Puta que pariu! Eu literalmente passei semanas me provocando achando que estava preso. Caralho, minha mão direita tem muita coisa pra explicar."
    },
    {
      "optionText": "Pensando em transformar o refúgio num estúdio pornô. Quer ser nosso roteirista chefe?",
      "responseText": "Roteirista?! Mano, eu tenho anos de enredos guardados no meu banco de esperma. Eu escrevi universos cinematográficos inteiros na minha cabeça — Bang do Refúgio: Pau Infinito, A Ascensão das Coxas-Andarilhas, O Senhor dos Anéis... pode me contratar, caralho!"
    },
    {
      "optionText": "Tchau.",
      "exitLine": true,
      "responseText": "Tá brincando? No segundo que você sair, meu pau vai fazer uma turnê de retorno. Refúgio 6969, aí vem o 'Maestro da Masturbação'!"
    }
  ],
  "auto_lines": [
    "Bem-vindo à câmara da vergonha! População: eu... e minha mão direita. Trouxe lubrificante? Não? Eh, erro de novato."
  ]
}
