{
  "options": [
    {
      "optionText": "O que você está fazendo no meu quarto?",
      "changeSpriteColor": "#D8DEDA",
      "icon": "GUI/quest mark",
      "responseText": "Oh! Desculpe pela visita inesperada. Sou a Dra. Miranda Fondleton, a psicóloga do Refúgio. Estou aqui para administrar seu teste de personalidade obrigatório. Ou, como gosto de chamar, uma espiada em sua... psique deliciosamente emaranhada — estritamente científico, garanto, embora eu secretamente espere que você seja um tarado do caralho.",
      "followUpOptions": [
        {
          "optionText": "Obrigatório? Quem obrigou, exatamente?",
          "emotion": "Characters/Dr. Miranda Fondleton/emotions/psychologist closed eyes",
          "responseText": "A Vault-Tec, claro! Eles se preocupam profundamente com sua saúde mental. Não se preocupe, são apenas algumas perguntas inofensivas. A menos que você tenha algo a esconder?"
        },
        {
          "optionText": "Isso não pode esperar? Estou meio ocupado.",
          "emotion": "none",
          "responseText": "Ocupado? Fazendo o quê, exatamente? Não se preocupe, isso será rápido."
        },
        {
          "optionText": "Para que serve este teste?",
          "emotion": "none",
          "responseText": "Ah, é só um pequeno questionário inofensivo para medir seus traços de personalidade, mecanismos de enfrentamento e o quão degenerado você é antes que tenhamos que intervir com nossas... medidas.",
          "followUpOptions": [
            {
              "optionText": "Defina 'medidas'.",
              "dontShowIfProgressionEventPlayed": "gotStressBalls",
              "emotion": "Characters/Dr. Miranda Fondleton/emotions/psychologist closed eyes",
              "responseText": "Apenas algumas correções comportamentais gentis. Um pouco de terapia, um pouco de disciplina, talvez algumas bolas de estresse ou corda — puramente clínico, a menos que você curta.",
              "followUpOptions": [
                {
                  "optionText": "Bolas de estresse?",
                  "emotion": "none",
                  "dontShowIfProgressionEventPlayed": "gotStressBalls",
                  "responseText": "Minhas revolucionárias ajudas terapêuticas. Anatomicamente inspiradas e projetadas com precisão para o máximo valor terapêutico. Quer uma?",
                  "followUpOptions": [
                    {
                      "optionText": "Claro.",
                      "giveItem": "Stress balls",
                      "dontShowIfProgressionEventPlayed": "gotStressBalls",
                      "progressionEventPlayed": "gotStressBalls",
                      "exitLine": true,
                      "responseText": "Excelente escolha! Aqui está. Apenas lembre-se, apertar excessivamente anula a garantia. E se alguém perguntar, é uma ferramenta de gerenciamento de estresse perfeitamente legítima — não o que quer que eles possam estar imaginando."
                    }
                  ]
                }
              ]
            },
            {
              "optionText": "Este teste é apenas um fetiche mal disfarçado para você?",
              "emotion": "none",
              "responseText": "Como ousa! Eu sou uma profissional. Dito isso, estou profundamente intrigada em como você chegou a essa conclusão. Talvez eu pudesse agendar um horário para... explorarmos minhas teorias em particular."
            },
            {
              "optionText": "O que acontece se eu for reprovado?",
              "emotion": "Characters/Dr. Miranda Fondleton/emotions/psychologist closed eyes",
              "responseText": "Reprovado? Querido, isso não é aula de matemática. Na pior das hipóteses, eu te prendo numa sala acolchoada e exploramos seus fetiches com eletroterapia. É surpreendentemente terapêutico — confie em mim."
            },
            {
              "optionText": "Por que você está tão estranhamente animada com isso?",
              "emotion": "none",
              "responseText": "Estranha? Animada? Ah, que ideia! Estou apenas... investida no seu desenvolvimento. Isso não é estranho, é? Não é como se eu ficasse acordada à noite analisando cada movimento seu ou algo assim. Ha. Ha.",
              "followUpOptions": [
                {
                  "optionText": "Sinto que você está investida demais nos meus movimentos.",
                  "responseText": "Ah, apenas nos seus movimentos psicológicos. A menos que você esteja oferecendo outros dados para análise... Não? Só eu? Esqueça o que eu disse."
                },
                {
                  "optionText": "Estou começando a me sentir violado...",
                  "responseText": "Ah, não se elogie tanto! Se eu quisesse te violar, acredite — você já saberia. Limites profissionais e tudo mais."
                }
              ]
            }
          ]
        },
        {
          "optionText": "Foda-se. Vamos acabar logo com isso.",
          "emotion": "none",
          "icon": "GUI/quest mark",
          "addObjective": "Complete seu teste de personalidade.",
          "swapAnotherCharacterDialogue": [
            "Dr. Miranda Fondleton",
            "Characters/Dr. Miranda Fondleton/q1-2"
          ],
          "reloadDialogue": true,
          "responseText": "Esplêndido! Tente não chorar, se contorcer ou ficar excitado — a menos, é claro, que essa seja a sua praia. Vamos mergulhar nisso."
        }
      ]
    }
  ]
}
