{
  "options": [
    {
      "optionText": "Por que caralhos você está nua no meio do refúgio?",
      "responseText": "Mmm—porra! Roupas ruins, quente, não aguento... preciso de pau, por favor—rola, qualquer coisa! Quero vê-los se contorcer, babar, enlouquecer—você não sente? Estou pingando aqui!",
      "followUpOptions": [
        {
          "optionText": "Jesus, calma. Você está literalmente babando.",
          "responseText": "Calma? CALMA?! Foda-se a calma—preciso de algo bruto, fundo, nojento... enforcamento, tapas—Deus, só me arrebenta logo! Eles têm muito medo—uns bananas, paus inúteis—não conseguem nem foder direito!",
          "followUpOptions": [
            {
              "optionText": "Talvez eles tenham medo que você arranque os paus deles.",
              "responseText": "SIM! Deus, sim! Arrancar, morder, arranhar, me foder até sangrar—preciso de dor, prazer—me use, me machuque, por favor!"
            },
            {
              "optionText": "Você percebe que a Polícia da Pureza vai te prender, né?",
              "responseText": "Foda-se a polícia! Me algema, me dobra, me acorrenta—use os cassetetes deles, as porras das varas elétricas—deixa eles assistirem, deixa eles gozarem, quero me afogar na vergonha imunda deles!"
            }
          ]
        },
        {
          "optionText": "Porra, Diana—você está completamente surtada. Há quanto tempo você está assim?",
          "responseText": "PARA SEMPRE—dias, semanas, porra de anos—não consigo pensar, só com tesão, faminta por rola, xoxota, bunda—não importa, qualquer coisa! Estou tão molhada que dói, porra de tortura!",
          "followUpOptions": [
            {
              "optionText": "Talvez você precise de atenção médica ou algo assim.",
              "responseText": "Sem remédios, só pau—grosso, latejante, duro—me enche até eu quebrar! Os médicos só olham, lambem os lábios—inúteis do caralho batendo uma a portas fechadas!"
            },
            {
              "optionText": "Como você não está na cadeia ainda?",
              "responseText": "Eles tentaram—uma vez—mas os guardas ficaram com tesão, foderam um ao outro em vez disso. Assisti—tão patético, hilário—bando de virgens de pau mole."
            }
          ]
        },
        {
          "optionText": "Ser um desastre de gozo ambulante é seu novo hobby?",
          "responseText": "Sim—Deus, sim, descrição perfeita! Desastre de gozo, tempestade de foda, apocalipse da putaria—me contrata, me sufoca, me veja babar! Quero ser o fim da sanidade deles!"
        },
        {
          "optionText": "Foda-se. VOCÊ vai fazer com que EU seja preso só de ficar aqui.",
          "responseText": "Então deixa eles nos prenderem! Nos algemem, nos fodam juntos—force-os a assistir enquanto você me arrebenta. Você sabe que adoraria—exibicionista sujo e imundo!"
        }
      ]
    }
  ]
}
