{
    "options": [
        {
            "optionText": "Why the fuck are you naked in the middle of the vault?",
            "responseText": "Mmm—fuck! Clothes bad, hot, can't... need dick, please—cock, anything! Wanna watch them squirm, drool, fucking lose it—don't you feel it? I'm dripping here!",
            "followUpOptions": [
                {
                    "optionText": "Jesus, calm down. You're literally drooling.",
                    "responseText": "Calm? CALM?! Fuck calm—need rough, deep, nasty... choking, slapping—god, just break me already! They're too scared—pussy boys, useless cocks—can't even fuck straight!",
                    "followUpOptions": [
                        {
                            "optionText": "Maybe they’re afraid you’ll rip their dicks off.",
                            "responseText": "YES! God, yes! Rip, bite, scratch, fuck me until blood—need pain, pleasure—use me, bruise me, please!"
                        },
                        {
                            "optionText": "You realize the Purity Police will lock your ass up, right?",
                            "responseText": "Fuck the police! Cuff me, bend me, chain me—use their batons, goddamn electric rods—let 'em watch, let 'em cum, wanna drown in their filthy shame!"
                        }
                    ]
                },
                {
                    "optionText": "Fuck, Diana—you're completely losing it. How long have you been like this?",
                    "responseText": "FOREVER—days, weeks, fucking years—can't think, just horny, starving for cock, pussy, ass—doesn't matter, anything! I'm so wet it hurts, goddamn torture!",
                    "followUpOptions": [
                        {
                            "optionText": "Maybe you need medical attention or something.",
                            "responseText": "No meds, just dick—fat, throbbing, hard—fill me until I break! Docs just stare, lick their lips—useless fucks jerking off behind closed doors!"
                        },
                        {
                            "optionText": "How are you not already in jail?",
                            "responseText": "They tried—once—but guards got horny, fucked each other instead. Watched 'em—so pathetic, hilarious—bunch of limp-dick virgins."
                        }
                    ]
                },
                {
                    "optionText": "Is being a walking cum-disaster your new hobby?",
                    "responseText": "Yes—god yes, perfect description! Cum-disaster, fuck-storm, slut apocalypse—sign me up, choke me out, watch me drool! I wanna be the end of their fucking sanity!"
                },
                {
                    "optionText": "Fuck it. You're gonna get ME arrested just standing here.",
                    "responseText": "Then let 'em arrest us! Cuff us, fuck us together—force them to watch as you pound me raw. You know you'd love it—dirty, filthy exhibitionist!"
                }
            ]
        }
    ]
}
