{
  "options": [
    {
      "optionText": "Que porra foi essa que acabou de acontecer?",
      "emotion": "Characters/Overseer Daughter/emotions/after deathclaw fuck/happy",
      "responseText": "O que parece? Ciência, obviamente. Você não leu o memorando do Supervisor sobre 'ultrapassar os limites da pesquisa'? Meus limites acabaram de ser arrebentados com força, pode ter certeza. Além disso, relaxa. Esses são apenas bebês. Espere até eu atrair os adultos!",
      "followUpOptions": [
        {
          "optionText": "Ciência? Você chama ser comida por um Deathclaw de 'ciência'?",
          "emotion": "Characters/Overseer Daughter/emotions/after deathclaw fuck/closed eyes, determined",
          "responseText": "Com certeza. Isso é biologia de fronteira, querido. Acabei de escrever o livro sobre educação sexual radioativa — com a minha xoxota. Chama-se experimentação prática. Bem, talvez não prática. Mais como 'garras na massa'. De qualquer forma, mereço um Prêmio Nobel... e uma soneca."
        },
        {
          "optionText": "Por favor, me diga que eles estão indo embora agora...",
          "emotion": "Characters/Overseer Daughter/emotions/after deathclaw fuck/happy",
          "responseText": "Ah, eles vão ficar. A gente acabou de criar um vínculo. Este pântano é oficialmente nosso ninho de amor agora. Além disso, tenho 90% de certeza de que pelo menos um deles me engravidou, então parabéns — você vai ser titio!"
        },
        {
          "optionText": "Sério, você gostou DAQUILO?",
          "emotion": "Characters/Overseer Daughter/emotions/after deathclaw fuck/closed eyes, determined",
          "responseText": "Ah, com certeza. O melhor alívio de estresse que tive desde... sempre. Além disso, você viu o jeito que ele olhou para mim — como um bife de Brahmin fresco. Quem poderia resistir?"
        }
      ]
    },
    {
      "optionText": "Eu nem sei por onde começar a descrever o quão fodido foi isso...",
      "emotion": "Characters/Overseer Daughter/emotions/after deathclaw fuck/closed eyes, sad",
      "responseText": "Então talvez nem comece. Apenas me traga uma toalha, um pouco de Rad-X e um suor de saco extra, se conseguir. A ciência exige repetibilidade — e minha xoxota está pronta para o segundo round."
    }
  ]
}
