{
  "options": [
    {
      "optionText": "Então estamos aqui. E agora?",
      "icon": "GUI/quest mark",
      "emotion": "Characters/Overseer Daughter/emotions/at the bog/biting lip",
      "responseText": "Agora, a gente espalha essa bela marinada de nozes de Deathclaw por aí e espera os desgraçados tarados virem correndo. Ou a gente revolucionou os encontros nos Ermos ou estamos prestes a levar uma suruba até o esquecimento. Empolgante, né?",
      "followUpOptions": [
        {
          "optionText": "Me lembra de novo por que estou arriscando minha vida pela sua insanidade?",
          "emotion": "Characters/Overseer Daughter/emotions/at the bog/biting lip",
          "responseText": "Porque no fundo você ama a emoção de potencialmente ser montado por répteis radioativos — ou porque você secretamente gosta de mim. A escolha é sua."
        },
        {
          "optionText": "Qual é o plano de fuga se isso der merda?",
          "emotion": "Characters/Overseer Daughter/emotions/at the bog/smile",
          "responseText": "Plano de fuga? Ha! Fofo. Se der errado, você grita, eu rio, e então nós dois corremos como o diabo. Simples e à prova de falhas."
        },
        {
          "optionText": "É melhor essa poção funcionar. Não apalpei bolas de Deathclaw à toa.",
          "icon": "GUI/quest mark",
          "emotion": "Characters/Overseer Daughter/emotions/at the bog/biting lip closed eyes",
          "responseText": "Ah, vai funcionar. Ou eles vão se acasalar até a exaustão ou nos acasalar até a exaustão. Honestamente, ambos parecem resultados hilários.",
          "followUpOptions": [
            {
              "optionText": "Quanto tempo até os Deathclaws chegarem?",
              "emotion": "none",
              "responseText": "Pode levar minutos, pode levar segundos. Se eles estiverem com metade da tesão que você estava ao pegar as partes deles, estarão aqui rapidinho."
            },
            {
              "optionText": "Você está perturbadoramente empolgada com isso.",
              "emotion": "Characters/Overseer Daughter/emotions/at the bog/smile",
              "responseText": "Perturbadoramente? Nah, sou perfeitamente normal. Se você não fica excitado com a ideia de Deathclaws se quebrando na porrada em um frenesi de feromônios, você está mesmo vivo?"
            },
            {
              "optionText": "[Esperar em silêncio]",
              "icon": "GUI/quest mark",
              "specialEffects": ["fade to black"],
              "emotion": "none",
              "responseText": "*puxa o pino da granada de feromônios* Tarde demais para desistir agora, papai. O pântano vai ficar bem grudento. Reze para qualquer Deus em que você ainda acredita — e talvez contraia o cu.",
              "followUpOptions": [
                {
                  "optionText": "Estou ouvindo um movimento. São eles?",
                  "icon": "GUI/quest mark",
                  "changeSprite": "Characters/Overseer Daughter/monster sex(1)",
                  "newSpriteYPos": -0.97,
                  "newSpriteXPos": 0.38,
                  "changeSpriteColor": "9A8E8B",
                  "responseText": "Ou são Deathclaws tarados ou saqueadores que acabaram de descobrir um novo fetiche. De qualquer forma, prepare-se para a penetração.",
                  "followUpOptions": [
                    {
                      "optionText": "Quer brincar de Foder-Casar-Mutar enquanto morremos de suspense?",
                      "responseText": "Claro. Foder: Deathclaw. Casar: Rainha Mirelurk. Mutar: Provavelmente já aconteceu ao inalar essa merda."
                    },
                    {
                      "optionText": "[Continuar esperando nervosamente]",
                      "icon": "GUI/quest mark",
                      "playSound": "Sounds/combat/deathclaw OD snatch",
                      "responseText": "Relaxa — qual é a pior coisa que pode aconte— AHHH — puta merda! Ele está aqui! ELE ESTÁ AQUI PRA CARALHO — ME PÕE NO CHÃO SEU PERVERTIDO ESCAMOSO!",
                      "exitLine": true,
                      "specialEffects": ["restore color filter"],
                      "showShadowFigures": "Deathclaws2",
                      "swapAnotherCharacterDialogue": [
                        "Overseer Daughter",
                        "Characters/Overseer Daughter/deathclaw_sex2"
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Estou com um mau pressentimento sobre isso.",
      "emotion": "Characters/Overseer Daughter/emotions/at the bog/smile",
      "responseText": "Bom! Isso significa que seus instintos de sobrevivência não estão totalmente mortos. Fique esperto — e lembre-se, se a merda feder, derrube alguém mais lento que você. Spoiler: não serei eu."
    }
  ]
}
