{
  "options": [
    {
      "optionText": "Então... a gente não vai falar sobre a suruba de Deathclaws?",
      "onlyShowIfProgressionEventPlayed": "daughter_railed_by_deathclaw",
      "responseText": "Ah, *aquela* pequena delícia da tarde? Honestamente, eu estava mais preocupada em pegar farpas de Deathclaw nos lugares errados. Aquelas garras não são brincadeira — você já tentou fazer a vaqueira reversa em um tanque biológico com facas no lugar das mãos? É um esporte.",
      "followUpOptions": [
        {
          "optionText": "Ainda ouço os tapas nos meus sonhos.",
          "responseText": "Esse é o ritmo da selva. A natureza encontra um jeito — e às vezes ela encontra três lagartos radioativos e anabolizados e uma garota com zero vergonha e um desejo de morte. Agradeça por eles не terem se interessado muito por *você*. Embora estivessem te olhando como sobremesa."
        },
        {
          "optionText": "Você acenou para mim. *No meio da metida.*",
          "responseText": "O que eu deveria fazer, te ignorar? Isso é falta de educação. Além disso, pensei que você talvez quisesse participar. Você estava espreitando como um tarado atrás da hidroponia, como se tivesse acabado de pegar seus pais no flagra."
        },
        {
          "optionText": "Aquele Deathclaw no final piscou para mim. Explique.",
          "responseText": "Ah, aquele é o Krugg. Não liga pra ele — ele tem um olho preguiçoso e uma gozada ainda mais preguiçosa. Se ele começar a te enviar ovos pelo correio, apenas bloqueie-o. Ou crie-os. Eu não julgo."
        }
      ]
    },
    {
      "optionText": "Em nome de tudo que é sagrado, o que você vai fazer com o suor?",
      "dontDisplayIfHasObjective": "Escort Overseer's Daughter to Deathroot Bog",
      "onlyDisplayIfObjectiveComplete": "Extract Deathclaw ball sweat",
      "dontShowIfProgressionEventPlayed": "daughter_railed_by_deathclaw",
      "icon": "GUI/quest mark",
      "responseText": "Ah, é ciência simples! Eu misturo com uma pitada do extrato de raiz psicodélica caseiro do Boogey, salpico um pouco de erva de gato cultivada no refúgio e voilà — um perfume tão potente que fará os Deathclaws virem em debandada de quilômetros de distância. Ou vai ser revolucionário ou vou ser estraçalhada. De qualquer forma, vai ser hilário.",
      "followUpOptions": [
        {
          "optionText": "Isso é insano.",
          "icon": "GUI/quest mark",
          "responseText": "Você acha isso insano? Espere até ver o teste de campo. O que me lembra — prepare seu equipamento. Estamos indo para os Ermos para que eu possa testar essa belezinha em algum lugar com menos probabilidade de terminar em uma suruba de Deathclaws em todo o refúgio.",
          "followUpOptions": [
            {
              "optionText": "Pode contar comigo. Não posso perder isso.",
              "addObjective": "Escort Overseer's Daughter to Deathroot Bog",
              "icon": "GUI/quest mark",
              "addFollower": "Overseer’s Daughter",
              "responseText": "Porra, sim. Pegue sua arma, seus remédios — estamos prestes a usar iscas falsas em uns Deathclaws tarados. E se eu for apalpada ou morta, vou culpar você!",
              "exitLine": true
            },
            {
              "optionText": "Não. Não vou ser empalado a seco por lagartos radioativos.",
              "responseText": "Covarde. Tudo bem. Eu vou sozinha — e se eu acabar sendo estuprada por alguns saqueadores, vou dar o seu nome para os bebês.",
              "exitLine": true
            }
          ]
        }
      ]
    },
    {
      "optionText": "Aqui. Eu peguei seu... uh... suco de Deathclaw.",
      "onlyDisplayIfHasObjective": "Extract Deathclaw ball sweat",
      "dontDisplayIfObjectiveComplete": "Extract Deathclaw ball sweat",
      "itemRequired": "Deathclaw ball sweat",
      "giveItemToCharacter": "Deathclaw ball sweat",
      "markObjectiveComplete": "Extract Deathclaw ball sweat",
      "addSusPoints": 10,
      "relationshipPoints": 15,
      "icon": "GUI/quest mark",
      "responseText": "Puta merda, você conseguiu mesmo. Olha só isso — o néctar profano das bolas de um lagarto assassino radioativo, e ainda está quente. Você não... provou nem nada, né? Nah, não responde. Não quero saber.",
      "followUpOptions": [
        {
          "optionText": "Você é uma garota doente, sabia?",
          "responseText": "Diz o esquisito corajoso que apalpou as partes baixas de um Deathclaw para conseguir isso. Não venha com moralismo pra cima de mim agora."
        },
        {
          "optionText": "Em nome de tudo que é sagrado, o que você vai fazer com isso?",
          "dontDisplayIfHasObjective": "Escort Overseer's Daughter to Deathroot Bog",
          "icon": "GUI/quest mark",
          "responseText": "Ah, é ciência simples! Eu misturo com uma pitada do extrato de raiz psicodélica caseiro do Boogey, salpico um pouco de erva de gato cultivada no refúgio e voilà — um perfume tão potente que fará os Deathclaws virem em debandada de quilômetros de distância. Ou vai ser revolucionário ou vou ser estraçalhada. De qualquer forma, vai ser hilário.",
          "followUpOptions": [
            {
              "optionText": "Isso é insano.",
              "icon": "GUI/quest mark",
              "responseText": "Você acha isso insano? Espere até ver o teste de campo. O que me lembra — prepare seu equipamento. Estamos indo para os Ermos para que eu possa testar essa monstruosidade em algum lugar com menos probabilidade de terminar em uma suruba de Deathclaws em todo o refúgio.",
              "followUpOptions": [
                {
                  "optionText": "Pode contar comigo. Não posso perder isso.",
                  "addObjective": "Escort Overseer's Daughter to Deathroot Bog",
                  "icon": "GUI/quest mark",
                  "addFollower": "Overseer’s Daughter",
                  "responseText": "Porra, sim. Pegue sua arma, seus remédios — estamos prestes a usar iscas falsas em uns Deathclaws tarados. E se eu for apalpada ou morta, vou culpar você!",
                  "exitLine": true
                },
                {
                  "optionText": "Não. Não vou ser empalado a seco por lagartos radioativos.",
                  "responseText": "Covarde. Tudo bem. Eu vou sozinha — e se eu acabar sendo estuprada por alguns saqueadores, vou dar o seu nome para os bebês.",
                  "exitLine": true
                }
              ]
            }
          ]
        },
        {
          "optionText": "É melhor você me pagar. Quase morri por isso.",
          "addWillpowerTokens": 200,
          "exitLine": true,
          "responseText": "Pagar? Pode deixar, corajoso apalpador de sacos de Deathclaw. Aqui estão seus 200 Tokens W. É o suficiente para comprar uma bebida forte — ou talvez uma terapia para qualquer trauma que você acabou de passar."
        }
      ]
    },
    {
      "optionText": "Quem é o cara alto e esquisito? Ele parece que coleciona dentes.",
      "responseText": "Ah, esse é o Boogie. Sim, ele é esquisito, mas de um jeito divertido. Ele coleciona coisas estranhas, sim, mas não se preocupe, ele só coleciona dentes de pessoas que o irritam de verdade.",
      "followUpOptions": [
        {
          "optionText": "Qual é a sua relação com ele?",
          "responseText": "Ah, somos como a Bonnie e o Clyde da putaria do refúgio. Ele é o cérebro por trás do mercado negro, e eu sou a espertinha que encontra maneiras de nos tirar de enrascadas. Basicamente, somos os heróis que este lugar não merece."
        }
      ]
    },
    {
      "optionText": "Isso é... a sala de cultivo?",
      "responseText": "Uau, Sherlock, você realmente desvendou o caso. Sim, é a sala de cultivo. Plantas, terra e eu — a filha do Supervisor — a única fonte de entretenimento neste refúgio. Quer adivinhar o que eu realmente estou cultivando aqui?",
      "followUpOptions": [
        {
          "optionText": "Espera, você é a filha do Supervisor?",
          "responseText": "Ding ding ding! Sim, sou a sortuda cria do próprio chefe da polícia da diversão do refúgio. Não se deixe enganar por isso — não pretendo desperdiçar minha vida nessa baboseira de abstinência como ele faz.",
          "followUpOptions": [
            {
              "optionText": "Então, você é... rebelde.",
              "responseText": "Rebelde? Ha! Prefiro 'exploradora profissional de brechas'. Regras são apenas sugestões para pessoas que não sabem se divertir. Se houver problema, pode apostar que estou envolvida de alguma forma."
            },
            {
              "optionText": "Como é ser a filha do Supervisor?",
              "responseText": "É como estar em uma cela de prisão com as regras do papai estampadas em todas as paredes, exceto que eu tenho uma chave e zero fodas para dar. Ele fica falando sobre 'responsabilidade' enquanto eu contrabandeio holofitas e faço apostas sobre quando ele terá seu próximo colapso nervoso."
            },
            {
              "optionText": "Você não se preocupa que seu pai descubra o que você está fazendo?",
              "responseText": "Meu pai? Por favor. Ele não conseguiria encontrar a própria bunda com as duas mãos e um GPS do caralho. Tenho evitado seus discursos de 'Você deve permanecer pura!' desde que tive idade para revirar os olhos."
            },
            {
              "optionText": "Se seu pai proíbe a liberação sexual, como você sequer existe?",
              "responseText": "Sim, essa deixa a maioria das pessoas confusa. Os registros do refúgio dizem que eu 'simplesmente apareci' um dia no berçário com um bilhete colado no meu macacão: 'Um presente da devoção do Supervisor'. Tenho quase certeza de que isso é linguagem de culto para 'ninguém quer admitir como aconteceu'. Nem ele fala sobre isso. Vibe de concepção imaculada, né?"
            }
          ]
        },
        {
          "optionText": "O que você está cultivando aqui?",
          "responseText": "Ah, você não gostaria de saber? Digamos apenas que é uma pequena 'mistura especial' em que o Boogeyman e eu estamos trabalhando. Um trago e até a Patrulha da Pureza começa a transar com os móveis. E sim, é ilegal pra caralho. Isso é metade da diversão."
        }
      ]
    },
    {
      "optionText": "Você precisa de ajuda?",
      "dontDisplayIfHasObjective": "Extract Deathclaw ball sweat",
      "dontDisplayIfObjectiveComplete": "Extract Deathclaw ball sweat",
      "dontShowIfProgressionEventPlayed": "refused_overseer_daughter_request",
      "icon": "GUI/quest mark",
      "responseText": "Oh, você está se voluntariando? Corajoso. Ou estúpido. Mas sim, eu tenho uma pequena 'missão'. Topa?",
      "followUpOptions": [
        {
          "optionText": "Qual é o trabalho?",
          "progressionEventPlayed": "daughter_asked_for_deathclaw_nut",
          "responseText": "Preciso que você colete um pouco de suor de saco de Deathclaw. Sim, você ouviu direito. Preciso da marinada de bolas daqueles grandes lagartos assassinos escamosos em um pote. Não pergunte por que — apenas pegue o néctar do saco e dê o fora daqui.",
          "followUpOptions": [
            {
              "optionText": "Por que diabos você precisa DISSO?",
              "responseText": "É para um experimento. Estou trabalhando em uma 'poção do amor' especial para Deathclaws. Não me olhe assim — é puramente científico. Definitivamente não é sobre criar um ritual de acasalamento de Deathclaw no refúgio para minha própria diversão doentia ou algo assim. Ahem."
            },
            {
              "optionText": "Você está completamente maluca.",
              "responseText": "Ah, com certeza. Mas a questão é a seguinte: ninguém se lembra das pessoas chatas. Lendas são feitas por lunáticos como eu — e pelos pobres coitados como você que ajudam."
            },
            {
              "optionText": "Beleza. Como eu faço isso?",
              "icon": "GUI/quest mark",
              "exitLine": true,
              "progressionEventPlayed": "accepted_overseer_daughter_request",
              "showChoiceStats": "accepted_overseer_daughter_request",
              "addObjective": "Extract Deathclaw ball sweat",
              "responseText": "Fácil! Primeiro, encontre um Deathclaw. Segundo, espere ele te atacar. Terceiro, mergulhe por baixo das pernas, desvie daquelas garras e dê um aperto nos seus brinquedinhos escamosos. Quarto, corra como o diabo antes que ele faça de você seu próximo brinquedo de mastigar. Entendeu? Ótimo!"
            },
            {
              "optionText": "[Denunciá-la]",
              "progressionEventPlayed": "refused_overseer_daughter_request",
              "showChoiceStats": "refused_overseer_daughter_request",
              "onlyShowIfProgressionEventPlayed": "REMOVED",
              "reported": 1,
              "exitLine": true,
              "responseText": "Pfft, covarde. Acho que vou ter que encontrar outra pessoa então..."
            }
          ]
        },
        {
          "optionText": "O que eu ganho com isso?",
          "responseText": "Ah, farei valer a pena, não se preocupe. Que tal 200 Tokens W? É o suficiente para subornar metade do refúgio, estocar lanches ou apostar tudo na próxima luta clandestina do Boogeyman. Além disso, você ganha o direito de se gabar eternamente por tocar em um Deathclaw onde ninguém ousou antes. Legal, né?"
        }
      ]
    },
    {
      "optionText": "Tchau.",
      "exitLine": true,
      "responseText": "Até mais."
    }
  ]
}
