{
  "options": [
    {
      "optionText": "[Observar]",
      "spriteAtTheEndOfHscene": "Characters/Overseer Daughter/od post deathclaw",
      "spriteAtTheEndOfHscenePosition": [0.38, -1.64],
      "exitLine": true,
      "isHEventStarted": true,
      "closeDialogueOptions": true,
      "icon": "GUI/eye icon",
      "hEventName": "daughter_tentacle_fuck",
      "progressionEventPlayed": "daughter_tentacle_sex",
      "interactable": "Characters/Overseer Daughter/Interactables/tentacles",
      "lineAfterHevent": "Ahh... obrigada por cultivar isso... é incrível... ♥︎",
      "auto_lines": [
        "Ahh, merda, ok, você tá indo bem fundo, hein? Acho que encontrei a planta mais tarada do refúgio.",

        "Porra, minha xoxota não estava preparada para a dominação do pepino mutante hoje!",

        "Ahhh! Oh, Deus... é por isso que o papai regula a jardinagem? Faz sentido, porra.",

        "Deus, meu corpo me traiu — tentáculos de pepino? Sério?",

        "Porra, sim! Esta planta é oficialmente meu novo contrabando favorito.",

        "Ohhh, Deus... me arromba — foda-se a Vault-Tec e a chatice deles!",

        "Mmm, sim... xoxota rebelde encontra pepino mutante — combinação perfeita.",

        "Ahhh… mais fundo! Porra, talvez eu comece a apoiar produtos orgânicos agora!",

        "Puta merda, pepino, se você me engravidar, vamos ter um problema.",

        "Mmm, sim... me mostre exatamente como a natureza quebra as regras do papai.",

        "Deus, esta planta mutante fode melhor que a maioria dos moradores do refúgio — ahhh!",

        "Me fode, mais fundo! Juro que isso fica fora das fitas do Boogeyman.",

        "Ahhh… minha xoxota oficialmente se tornou rebelde — foda-se a autoridade do papai!",

        "Caralho, pepino — me fode como se estivesse contrabandeando para dentro da minha xoxota!",

        "Porra, pepino... me faça esquecer as regras idiotas do papai.",

        "Ahhh, merda... você é melhor em quebrar regras do que eu, porra!",

        "Porra, sim! Minha xoxota é oficialmente o novo ponto de mercado negro do refúgio!",
        "Ahh, porra… está deslizando dentro de mim — tão fundo, Deus, mal consigo aguentar! ♥︎",

        "Mmm, minha xoxota está encharcada... porra, esta planta sabe exatamente o que quer. ♥︎",

        "Merda, nunca imaginei que seria comida assim… ahhh, Deus, não pare! ♥︎",

        "Ohhh… porra, sim… me arromba — mais fundo, Deus, mais fundo! ♥︎",

        "Puta que pariu, este pepino mutante está me fodendo melhor do que qualquer um já fez. ♥︎",

        "Ahhh, Deus, é tão bom — me fode mais forte, me enche completamente! ♥︎",

        "Porra, minhas coxas estão tremendo… sim, enfia seus tentáculos fundo na minha xoxota! ♥︎",

        "Oh Deus… está explorando cada centímetro sensível da minha xoxota… ahhh, porra! ♥︎",

        "Ahh, Deus, estou sendo comida por uma planta… porra, e eu amo cada segundo. ♥︎",

        "Ahh, porra, é tão grosso… minha xoxota está esticada ao máximo! ♥︎",

        "Mmm… sim, me abre, invade cada centímetro — porra, você é selvagem! ♥︎",

        "Porra, está me enchendo — tão fundo, Deus, está atingindo lugares que eu não sabia que existiam! ♥︎",

        "Ahhh… sou sua agora… continue fodendo minha xoxota como nunca foi fodida antes! ♥︎",

        "Oh Deus, esta planta está me fazendo gozar… porra, sim! ♥︎",

        "Porra, isto é puro êxtase… está bombando para dentro e para fora, dominando completamente minha xoxota! ♥︎",

        "Ahhh, Deus, sinto cada estocada, cada centímetro deslizando fundo... ♥︎",

        "Oh, porra… está pressionando mais fundo, minha xoxota se apertando — Deus, sim! ♥︎",

        "Porra, mal consigo aguentar… mas não me canso de sentir isso me enchendo! ♥︎",

        "Ahhh… meu corpo está tremendo de prazer… porra, continue me devastando! ♥︎",

        "Deus, sim, me inunde com seus tentáculos grossos… me fode até eu quebrar! ♥︎",

        "Porra, é avassalador… minha xoxota latejando ao seu redor… ♥︎",

        "Oh Deus… é bom demais… me fode mais fundo — eu aguento! ♥︎",

        "Porra, cada centímetro mais fundo é pura felicidade… ahhh, não se segure! ♥︎",

        "Ahh… Deus, você está me arrombando — porra, meu corpo anseia por isso! ♥︎",

        "Porra, sim… me encha, use minha xoxota até que esteja totalmente semeada! ♥︎"
      ],
      "endingEffects": ["Flashes"]
    }
  ],
  "auto_lines": [
    "Ahh, Deus, estou sendo comida por uma planta… porra, e eu amo cada segundo. ♥︎",

    "Porra… meus sucos estão escorrendo por toda parte — Deus, continue metendo mais fundo! ♥︎"
  ]
}
