{
  "options": [
    {
      "optionText": "Sua filha me pediu para coletar suor de saco de Deathclaw. Para o projeto de jardim dela.",
      "onlyShowIfProgressionEventPlayed": "daughter_asked_for_deathclaw_nut",
      "dontDisplayIfObjectiveComplete": "Extract Deathclaw ball sweat",
      "responseText": "CALE A PORRA DA SUA BOCA DE PUTA IRRADIADA AGORA MESMO! EU NÃO SEI DE QUE TIPO DE SONHO FEBRIL PÓS-GOZADA VOCÊ SAIU, MAS MINHA FILHA NUNCA TOCARIA NA COISA DE UM LAGARTO MUTANTE! OUVIU?! SEU MENTIROSO, DOENTE, GOBLIN DE PORRA!",
      "followUpOptions": [
        {
          "optionText": "Ela disse que 'aumentava a fertilidade do solo'. Me mostrou um gráfico. Com estatísticas.",
          "responseText": "GRÁFICO O MEU CU! VOCÊ ESPERA QUE EU ACREDITE QUE MINHA BEBÊ FEZ A PORRA DE UM POWERPOINT SOBRE A SECREÇÃO DO PAU DE UM LAGARTO DO INFERNO E CHAMOU ISSO DE CIÊNCIA?! VOCÊ ACHA QUE VOU CONCORDAR ENQUANTO VOCÊ FICA AÍ PARADO COM CARA SÉRIA E DIZ, 'NOSSA, SUPERVISOR, ACONTECE QUE SUOR MUTANTE É O SEGREDO PARA UMA COLHEITA MELHOR'? EU VOU ENFIAR SEUS GRÁFICOS NO SEU CU ATÉ VOCÊ ESTAR CULTIVANDO RABANETES PELAS SUAS MALDITAS NARINAS, SEU DOENTE DO CARALHO!"
        },
        {
          "optionText": "Ela chamou de 'Poção do Amor' e perguntou se eu queria provar.",
          "exitLine": true,
          "responseText": "AAHHH!!! EU VOU VOMITAR SANGUE, CAGAR UM PUNHO E ASCENDER A UM PLANO DE PURA RAIVA INFODÍVEL. SEU NOJENTO, IMUNDO, HUMANO DE MERDA MANCHADO DE SÊMEN—SAIA! SAIA ANTES QUE EU FAÇA UMA PRIVADA DA SUA CAIXA TORÁCICA PARA DESPEJAR TODO O LIXO DO REFÚGIO NELA POR UM ANO INTEIRO!"
        }
      ]
    },
    {
      "optionText": "Vi sua filha sendo comida por três Deathclaws. Ela estava totalmente dentro.",
      "onlyShowIfProgressionEventPlayed": "daughter_railed_by_deathclaw",
      "responseText": "O QUE CARALHOS VOCÊ ACABOU DE DIZER, SEU DEGENERADO DO CARALHO? MINHA FILHA É UM ANJO PURO DA CELIBADIA! VOU ARRANCAR SUA LÍNGUA PELO SEU CU POR DIZER ALGO TÃO VIL SOBRE MEU SANGUE!",
      "followUpOptions": [
        {
          "optionText": "Confie em mim, ela está cheia de porra de Deathclaw agora.",
          "responseText": "SEU DESGRAÇADO VIL E DE CÉREBRO PORNÔ! VOU ARRANCAR SEU PAU E TE ESTRANGULAR COM ELE! MINHA FILHA NÃO TOCARIA NUM PAU MUTANTE NEM QUE A VIDA DELA DEPENDESSE DISSO!"
        },
        {
          "optionText": "Três lagartos gigantes, uma garota. Faça as contas.",
          "responseText": "CHEGA! VOU TE ESFOLAR VIVO E PENDURAR SEU COURO DEGENERADO SOBRE MEU ESCRITÓRIO COMO UM AVISO PARA OUTROS VICIADOS EM PUNHETA!"
        },
        {
          "optionText": "Ela mesma os invocou. A poção funcionou.",
          "responseText": "UMA POÇÃO?! VOCÊ ENLOUQUECEU DE TANTO COMBATE MÃO-NO-PAU! VOU TE TRANCAR NUMA CELA ATÉ SEU SACO EXPLODIR COMO UMA PORRA DE UMA GRANADA!"
        },
        {
          "optionText": "Acho que seu culto de abstinência deixou a xoxota dela louca por pau de mutante.",
          "playSound": "punch",
          "specialEffects": ["Blackout", "Blur"],
          "addWillpowerTokens": -9999,
          "advanceDayWithStatusMessage": "Você acorda de cara num balde de esfregão cheio de alvejante industrial e sangue de alguém. Sua mandíbula estala quando você respira e seus dentes parecem estar flutuando.",
          "responseText": "VOU TE MOSTRAR O LOUCO, SEU MERDA NOJENTO!!"
        }
      ]
    },
    {
      "optionText": "Quem é você?",
      "responseText": "QUEM CARALHOS SOU EU?! Escuta aqui, seu degenerado de queixo caído! Eu sou o bastião da pureza, o protetor da disciplina, o homem que impede este refúgio de se transformar numa fossa de depravação. EU SOU O SUPERVISOR SACO AZUL! Eu imponho a sagrada POLÍTICA DE NÃO-PUNHETA, NÃO-FODA para que vocês, degenerados de vontade fraca, não se afoguerm em seus próprios pensamentos imundos. Agora, fique ereto quando estiver falando comigo! Só os fortes sobrevivem, e só os celibatários prosperam!",
      "followUpOptions": [
        {
          "optionText": "Você é louco. Acho que prefiro os Ermos.",
          "responseText": "LOUCO?! PODE APOSTAR QUE SOU LOUCO! LOUCO PELO PODER BRUTO DA TESTOSTERONA INDOMADA! Você acha que sobreviverá cinco minutos nos Ermos com sua mente focada em pensamentos depravados? ELES VÃO TE DESPEDAÇAR LÁ FORA!"
        },
        {
          "optionText": "O que acontece se alguém bater uma aqui?",
          "responseText": "Nós o executamos. Sem julgamento. Sem hesitação. Eu pessoalmente arranco seu pau imundo e te sufoco até a morte com ele! Uma bombeada neste lugar é um ato de TERRORISMO. Cada gozada drena a energia. Você bate uma, a enfermaria inteira perde energia — bebês morrem nas incubadoras e vidas ACABAM. Sua palma gordurosa vale uma montanha de cadáveres de bebês, Soldado? VOCÊ QUER BEBÊS MORTOS NA PORRA DAS SUAS MÃOS?"
        },
        {
          "optionText": "Pode me inscrever, Supervisor! Mostre-me o caminho para a ascensão!",
          "responseText": "AGORA É DISSO QUE EU GOSTO DE OUVIR! Abrace a agonia! Sinta seus impulsos patéticos gritarem e implorarem por liberação — mas NEGUE-OS a cada passo! Logo suas veias não bombearão sangue, mas PODER PURO! Logo você será uma força imparável como eu — UM DEUS ENTRE OS HOMENS! Bem-vindo, recruta, à LEGIÃO DA ABSTINÊNCIA!"
        },
        {
          "optionText": "Isso é alguma piada doentia?",
          "responseText": "UMA PIADA?! Este corpo parece uma porra de uma piada para você? Isso não é uma piada, fracote — é a cruzada sagrada contra os impulsos imundos que escravizam a humanidade! Vê estes músculos? Eles irromperam do meu corpo no momento em que joguei a tentação no lixo! Isso não é apenas um estilo de vida — é uma RELIGIÃO, verme! Sua libido patética será esmagada voluntariamente, OU EU A ESMAGAREI EU MESMO!"
        },
        {
          "optionText": "Como diabos vocês fazem bebês neste refúgio?",
          "responseText": "Nós fazemos do jeito *correto*, soldado. Cada macho viável é ordenhado uma vez por trimestre fiscal — sob sedação, na Cadeira de Extração — por um braço mecanizado chamado *Mãe*. Sem clímax. Apenas um cateter frio e uma seringa de 30cc.",
          "followUpOptions": [
            {
              "optionText": "Essa é a coisa mais distópica que já ouvi.",
              "responseText": "Bom. A distopia constrói DISCIPLINA. Quero que meus filhos nasçam em um mundo onde o contato visual durante a concepção seja um mito. É por isso que nossos filhos não choram — ELES EMERGEM DE CARA FECHADA E SILENCIOSOS!"
            },
            {
              "optionText": "Por que as pessoas não podem simplesmente fazer sexo normal?",
              "responseText": "SEXO NORMAL?! Você está louco?! Sexo normal leva ao prazer — prazer leva à fraqueza — fraqueza DESTRÓI a disciplina! Além disso, temos cotas populacionais para controlar. Um deslize, e o refúgio se transforma numa porra de uma orgia! NÃO SOB MINHA VIGILÂNCIA!",
              "followUpOptions": [
                {
                  "optionText": "Controle populacional? O que isso tem a ver?",
                  "responseText": "TUDO, seu idiota! Cada nascimento é estritamente regulado. Muitas bocas, poucas rações, e logo estaremos nos canibalizando como uns malditos saqueadores!"
                },
                {
                  "optionText": "Você parece ter problemas pessoais.",
                  "responseText": "PROBLEMAS PESSOAIS?! Meu único problema é com degenerados indisciplinados! Eu sou a pureza personificada, soldado! O único problema aqui é a sua falta de visão para um futuro livre de impulsos animalescos!"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Jesus Cristo, o que aconteceu com suas bolas?",
      "responseText": "Minhas bolas? Elas são o resultado de anos de dedicação e contenção! Um símbolo da minha resolução inabalável e autocontrole. Tenho mais testosterona no meu testículo esquerdo do que o resto de vocês tem em seus corpos inteiros! CURVE-SE DIANTE DO MEU SACO DE ETERNA PUREZA, VERME!"
    },
    {
      "optionText": "O que você quer de mim?",
      "icon": "GUI/quest mark",
      "responseText": "Há uma praga lá fora — um demônio de saltos altos — chamada *Mistress Domina*. Ela é a razão pela qual quebrei minha sequência de 16 anos de abstinência duas décadas atrás. Ela usou seus... seus *encantos femininos* para me colocar de joelhos, literalmente. E agora, ela está liderando um bando de gados e transformando homens em escravos choramingas e de olhos arregalados! Preciso que você a derrube antes que ela envenene os Ermos com seu exército de gados!",
      "followUpOptions": [
        {
          "optionText": "Mistress Domina? O que ela fez com você?",
          "responseText": "O que ela fez? O QUE ELA FEZ?! Ela me seduziu com suas curvas diabólicas e sussurrou mentiras em meus ouvidos virgens! Um momento de fraqueza, e eu estava desfeito! Meu recorde perfeito, estilhaçado! Ela me fez *sentir coisas*! Ela usou minha própria disciplina contra mim e me deixou um homem quebrado. Mas eu renasci das cinzas como uma fênix! E agora, ela deve pagar pelo que fez!",
          "followUpOptions": [
            {
              "optionText": "Parece pessoal, mano...",
              "responseText": "Claro que é pessoal! Você sabe como é quebrar uma sequência de 16 anos de pureza? Minha vida inteira foi construída em torno de ser o guerreiro celibatário supremo, e ela a estilhaçou com uma piscadela! Uma piscadela, droga! Ela me seduziu como uma vadia de sarjeta de duas tampinhas! Esperei 20 longos anos de saco azul por vingança. Treinei, meditei e jurei ver sua queda. E você, forasteiro, é minha arma de escolha."
            }
          ]
        },
        {
          "optionText": "Por que ela é uma ameaça tão grande, afinal?",
          "responseText": "Ela está construindo um império de gados, é isso! Ela se aproveita de homens de vontade fraca e os transforma em gados covardes que fazem ioga, puxa-sacos que imploram para ela pisar em suas bolas patéticas! Se ela não for parada, os Ermos se tornarão um pesadelo femdom distópico, uma matriarcado governado por saltos agulha pisoteando os rostos de betas covardes! Devemos aniquilá-la antes que ela afogue a civilização em estrogênio e humilhação!"
        },
        {
          "optionText": "O que eu ganho com isso?",
          "responseText": "O que você ganha? Glória, honra e a satisfação de ser um verdadeiro guerreiro! Mas tudo bem, se você precisa de *motivação material*, tenho um saco gordo de tampinhas de garrafa esperando por você. Traga-me a cabeça da Domina, e elas são suas. Além disso, você ganhará o respeito do homem mais disciplinado que existe. Isso é uma recompensa que o dinheiro não pode comprar!"
        },
        {
          "optionText": "Você quer que eu a mate de vez?",
          "icon": "GUI/quest mark",
          "dontDisplayIfHasObjective": "Bring down Mistress Domina",
          "dontDisplayIfObjectiveComplete": "Bring down Mistress Domina",
          "responseText": "Exatamente! Ela está escondida nas ruínas de uma igreja antiga. Seu trabalho é simples: infiltrar-se, massacrar seus gados e, em seguida, estripar aquela vadia súcubo. Não, sob nenhuma circunstância, deixe-a entrar na sua cabeça. É assim que ela age! Em um momento você está apontando uma arma para ela, e no outro, está lavando a roupa dela e a chamando de 'mamãe'. Estamos entendidos, soldado?!",
          "followUpOptions": [
            {
              "optionText": "Tudo bem, vou cuidar da sua dominatrix psicopata.",
              "icon": "GUI/quest mark",
              "markObjectiveComplete": "Talk to the Overseer",
              "addObjective": "Bring down Mistress Domina",
              "showChoiceStats": "down_with_the_devil",
              "exitLine": true,
              "responseText": "É disso que eu gosto de ouvir, soldado! Eu sabia que havia um vislumbre de potencial nesse seu exterior desgastado pelos Ermos. Agora escute: isso não é apenas uma missão — é uma cruzada contra a SUPREMACIA DAS VADIAS! Lembre-se, você não está lutando apenas por si mesmo; está lutando pela honra do Refúgio 6969! Agora, equipe-se, saia — DESTRUA AQUELA VADIA ANTES QUE ELA DESTRUA O MUNDO!"
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Bom! Saia da minha frente antes que eu sinta cheiro de fraqueza em você!",
        "Apenas lembre-se, cada passo que você dá para longe de mim é um passo mais perto da tentação!",
        "Sim, é melhor continuar andando. E lembre-se, a disciplina é um trabalho 24/7! Agora suma, soldado!"
      ],
      "exitLine": true
    }
  ],
  "random_auto_line": [
    "Você acha que isso é um salão? NÃO! Isso é um campo de batalha! Cada gozada não gasta é uma bala na sua câmara mental! TRAVAR E CARREGAR, SOLDADO!",
    "Você sente esse cheiro, soldado? É o fedor da fraqueza vazando de suas calças! Tampe isso antes que eu te tampe com um Cassetete de 'Bonk'!",
    "Eu não gozo desde a Grande Guerra, e eu poderia levantar um Deathclaw no supino! Qual é a sua desculpa para ser mole, pau-mole?!",
    "Você acha que está tenso agora? Espere até ter 40 anos com um saco tão cheio que tem seu próprio campo gravitacional! Isso é DISCIPLINA DE VERDADE!",
    "Não tenho uma liberação há tanto tempo que minhas bolas estão planejando sua própria rebelião no Refúgio. Você acha que aguenta esse tipo de guerra interna, soldado?!",
    "Estou te vendo olhar para aquela parede. Se aquela parede te der alguma ideia engraçada, eu a derrubo eu mesmo!",
    "Uma vez eu flexionei com tanta força resistindo à vontade de bater uma que minhas veias soletraram a palavra 'disciplina'. Agora volte ao trabalho, antes que eu as faça soletrar 'decepção!'"
  ]
}
