{
  "options": [
    {
      "optionText": "Uau. Isso foi... inesperado. De um jeito bom.",
      "onlyShowIfProgressionEventPlayed": "listen_to_paul_song",
      "responseText": "Ha! Eu ouço muito isso. A maioria das pessoas vê o macacão engordurado e assume que sou apenas mais um esquisito do refúgio. Mas a música? A música mantém as coisas unidas quando todo o resto desmorona."
    },
    {
      "optionText": "Não esperava encontrar música ao vivo neste refúgio.",
      "icon": "GUI/song icon",
      "responseText": "Oh! Ei, heh. Sim, não há muito mais o que fazer por aqui quando a energia está estável e ninguém está gritando sobre radroaches. Pensei em pegar as velhas cordas de novo.",
      "followUpOptions": [
        {
          "optionText": "Você é bom? Se importa de tocar algo?",
          "icon": "GUI/song icon",
          "responseText": "Sério? Bem, tudo bem então. Não tenho um público há um tempo... Esta se chama *“Lar no Vazio.”* Escrevi quando as portas do refúgio ainda rangiam.",
          "followUpOptions": [
            {
              "optionText": "[Ouvir em silêncio.]",
              "icon": "GUI/song icon",
              "progressionEventPlayed": "listen_to_paul_song",
              "playMusic": "Songs/Vault Dweller's Blues",
              "exitLine": true,
              "responseText": "*Paul começa a dedilhar uma melodia lenta e calorosa*"
            }
          ]
        },
        {
          "optionText": "Hobby interessante. Qual seu nome?",
          "responseText": "O nome é Paul. As pessoas me chamam de Paul o Espião agora, eu acho. Melhor do que me chamavam antes... mas isso é outra história."
        }
      ]
    },
    {
      "optionText": "Você é daqui?",
      "responseText": "Nasci dois refúgios para lá. Refúgio 472. Mudei para cá depois que o reciclador de água de casa deixou metade das colheitas azuis. O Refúgio 6969 tem suas esquisitices, mas é quieto... na maior parte do tempo."
    },
    {
      "optionText": "Desculpe, não quis interromper.",
      "responseText": "Sem problemas. A música é sempre melhor com alguém para ouvir. Talvez da próxima vez você fique para uma canção.",
      "exitLine": true
    }
  ],
  "auto_lines": ["Vamos ver se eu lembro dos acordes desta aqui…"],
  "showShadowFigures": "Diner Paul"
}
