{
    "options": [
        {
            "optionText": "Wow. That was... unexpected. In a good way.",
            "onlyShowIfProgressionEventPlayed": "listen_to_paul_song",
            "responseText": "Ha! I get that a lot. Most folks see the greasy jumpsuit and assume I’m just another vault weirdo. But music? Music keeps things together when everything else falls apart."
        },
        {
            "optionText": "Didn't expect to find live music in this vault.",
            "icon": "GUI/song icon",
            "responseText": "Oh! Hey, heh. Yeah, not much else to do around here when the power’s stable and no one’s screaming about radroaches. Thought I’d pick up the ol’ strings again.",
            "followUpOptions": [
                {
                    "optionText": "You any good? Mind playing something?",
                    "icon": "GUI/song icon",
                    "responseText": "You serious? Well, alright then. Haven’t had an audience in a while... This one’s called *“Home in the Hollow.”* Wrote it back when the vault doors still creaked.",
                    "followUpOptions": [
                        {
                            "optionText": "[Listen quietly.]",
                            "icon": "GUI/song icon",
                            "progressionEventPlayed": "listen_to_paul_song",
                            "playMusic": "Songs/Vault Dweller's Blues",
                            "exitLine": true,
                            "responseText": "*Paul starts strumming a slow, warm melody*"
                        } 
                    ]
                },
                {
                    "optionText": "Interesting hobby. What's your name?",
                    "responseText": "Name’s Paul. Folks just call me Peeping Paul now, I guess. Better than what they used to call me... but that’s another story."
                }
            ]
        },
        {
            "optionText": "You from around here?",
            "responseText": "Born two vaults over. Vault 472. Moved here after the water recycler back home turned half the crops blue. Vault 6969’s got its quirks, but it’s quiet... mostly."
        },
        {
            "optionText": "Sorry, didn't mean to interrupt.",
            "responseText": "No worries. Music’s always better with someone to hear it. Maybe next time stick around for a song.",
            "exitLine": true
        }
    ],
    "auto_lines": ["Let’s see if I remember the chords to this one…"],
    "showShadowFigures": "Diner Paul"
}
