{
  "options": [
    {
      "optionText": "Caramba. Não sabia que você conseguia manusear uma arma de destruição de bundas!",
      "emotion": "Characters/Female Purity Police/emotions/scared",
      "specialEffects": ["removeVignette"],
      "showChoiceStats": "pp_dildo_busted",
      "responseText": "OH MERDA! NÃO ESPERA—PORRA! Oh Deus oh Deus, NÃO É—Eu não estou—PORRA! Há quanto tempo você está aí?! Por favor, POR FAVOR, não conte a ninguém sobre isso!",
      "followUpOptions": [
        {
          "optionText": "Relaxe, oficial. Só fazendo um teste de controle de qualidade, certo?",
          "responseText": "SIM—espera, NÃO! Quer dizer, porra, foi puramente para... investigação... MERDA. Por favor, não arruíne minha vida por causa disso. Eu te dou o que você quiser, só cala a boca!",
          "followUpOptions": [
            {
              "optionText": "Me dê uma revista confiscada. E lave as mãos primeiro.",
              "responseText": "Porra, tudo bem! Pegue! Mas, por favor, pelo amor de Deus, não diga a ninguém que fui pega com um mega-dildo!",
              "giveItem": "Loose Housewives vol. 2",
              "progressionEventPlayed": "pp_officer_blackmailed",
              "fadeOutCharacter": true,
              "markEventAsPlayed": true,
              "exitLine": true
            },
            {
              "optionText": "Ei, sem julgamentos. Todo mundo precisa se explodir de vez em quando.",
              "fadeOutCharacter": true,
              "markEventAsPlayed": true,
              "progressionEventPlayed": "pp_officer_busted_but_let_free",
              "responseText": "Deus, você é horrível—espera, você está falando sério? Você realmente não vai me dedurar? Oh, graças a Deus, por favor, finja que não viu nada. Eu te dou um 'bonk' mais tarde—quero dizer, porra, quero dizer—SÓ VAI!",
              "exitLine": true
            }
          ]
        },
        {
          "optionText": "Precisa de ajuda com esse monstro ou devo deixar vocês dois a sós?",
          "emotion": "Characters/Female Purity Police/emotions/scared",
          "responseText": "Foda-se! Quer dizer—espera, não! Por favor, eu juro que geralmente sou pura pra caralho—isso foi só... pesquisa... PORRA!",
          "followUpOptions": [
            {
              "optionText": "Sim, pesquisando seu colo do útero com um dildo do tamanho de um mutante, entendi.",
              "responseText": "CALA A BOCA! Oh meu Deus, estou arruinada! Por favor, só vai embora, porra! Ficarei te devendo muito se você nunca mais mencionar isso!",
              "fadeOutCharacter": true,
              "progressionEventPlayed": "pp_officer_busted_but_let_free",
              "markEventAsPlayed": true,
              "exitLine": true
            }
          ]
        }
      ]
    }
  ],
  "auto_lines": [
    "Isso não é violação, é um treinamento de campo... tenho que garantir que essa xoxota aguente interrogatórios de alta pressão... pela Vault-Tec... pela CIÊNCIA...",
    "Pooorra, sim... arromba essa xoxota puritana apertadinha... invade meu refúgio como se fosse um crime... oh porra, vou tão fundo no meu buraco regulamentar...",
    "Mmm—vou sobrepor meus protocolos de vergonha com esse dildo gordo... ughh, sim, encha minha câmara disciplinar com uploads de dados não autorizados... sim, sim, SIM—"
  ]
}
