{
  "options": [
    {
      "optionText": "Que porra é essa?! Por que você está debaixo da minha cama?!",
      "responseText": "VOCÊ SABE MUITO BEM O PORQUÊ, SEU PEQUENO GREMLIN PECADOR E DESLEIXADO. Você acha que eu не rastrearia isso até o seu *centro de comando manchado de porra*?! Este refúgio tem ficado *pegajoso* e todos os vestígios levam a VOCÊ.",
      "followUpOptions": [
        {
          "optionText": "CARA, EU SÓ ESTAVA DORMINDO.",
          "responseText": "DORMINDO? DORMINDO?! ENTÃO EXPLIQUE AS *VIBRAÇÕES DE PUNHETA*, AMIGO! EU SINTO O CHEIRO DA TENSÃO NO AR! É GROSSO, é *almiscarado*. VOCÊ ESTÁ ESCONDENDO ALGO, E EU VOU ARRANCAR ISSO DE VOCÊ COMO UMA TAMPINHA DE GARRAFA DO CU DE UM CRACUDO."
        },
        {
          "optionText": "Há quanto tempo você está aí embaixo?",
          "responseText": "TEMPO SUFICIENTE PARA OUVIR SUA *RESPIRAÇÃO* DEPRAVADA, SEU GOBLIN IMUNDO. Tempo suficiente para testemunhar você rolar, agarrar seu travesseiro como se fosse alguma *waifu*. Quer explicar ISSO, ou devo registrar a acusação de *Punheteiro do Refúgio* na sua ficha agora mesmo?",
          "followUpOptions": [
            {
              "optionText": "Espera. ESPERA. Você estava debaixo da minha cama me ouvindo RESPIRAR? Quem é o verdadeiro pervertido aqui?!",
              "responseText": "OH, NÃO TENTE USAR A *CARTA DE REVERSÃO DO UNO* COMIGO, SEU MAGO DA ROLA! EU SOU UM *OPERATIVO DA PUREZA* TREINADO. EU *sofro* para que este refúgio permaneça *imaculado* por gente como *você*."
            }
          ]
        },
        {
          "optionText": "Você realmente acha que estou contrabandeando *contrabando de punheta*?!",
          "responseText": "OH, EU *SEI* QUE VOCÊ ESTÁ, SEU PEQUENO *GOBLIN DA GOZADA* SORRATEIRO. Encontramos uma revista 'Donas de Casa Safadas' no Bloco C. E *ALGUÉM* tem circulado mais delas. ESTE. REFÚGIO. ESTÁ. DESMORONANDO. E EU SEI QUE VOCÊ É O CABEÇA!",
          "followUpOptions": [
            {
              "optionText": "NÃO SOU EU, EU JURO!",
              "responseText": "AH, POR FAVOR. Você espera que eu acredite que há OUTRO TRAFICANTE DE PECADO neste refúgio? Não, NÃO. Eu vejo através de você, *seu mercador de imundície!*"
            },
            {
              "optionText": "Defina 'cabeça'.",
              "responseText": "Um *cabeça*, substantivo: Uma mente mestra desviante, um chefão da pornografia, um fornecedor miserável de degenerescência destruidora de pulsos. VOCÊ, em outras palavras."
            },
            {
              "optionText": "E daí se EU FOR? O que você pode fazer comigo?",
              "responseText": "OH, QUER FICAR *ARROGANTE*, HEIN? ACHA QUE PODE SIMPLESMENTE ADMITIR SEUS CRIMES E IR EMBORA?! BEM, ADIVINHA SÓ?! *EU respeito a honestidade.* Mas também, você está sob prisão do refúgio, seu absoluto *SENHOR DA IMUNDÍCIE*.",
              "followUpOptions": [
                {
                  "optionText": "Tudo bem. Eu me rendo.",
                  "addWillpowerTokens": -9999,
                  "removeAllPlayerItems": true,
                  "advanceDayWithStatusMessage": "A Câmara da Vergonha é pior do que você jamais imaginou. 50 dias de tormento psicológico. Você sai de lá uma casca quebrada de homem, bolsos vazios, alma estilhaçada, sua libido outrora orgulhosa reduzida a um fantasma atrofiado de si mesma.",
                  "exitLine": true,
                  "responseText": "BOM. JÁ ERA HORA DE VOCÊ VER A LUZ. Agora entregue cada token e prepare-se para 50 dias *cheios de diversão* na CÂMARA DA VERGONHA."
                },
                {
                  "optionText": "Nem fudendo. Você terá que me derrubar primeiro!",
                  "addWillpowerTokens": -9999,
                  "removeAllPlayerItems": true,
                  "advanceDayWithStatusMessage": "Você luta bravamente, mas ele luta como um demônio incel com um PhD em técnicas de combate corpo a corpo do NoFap. Você perdeu. A Polícia da Pureza levou todos os seus tokens, itens, sua dignidade e provavelmente um pequeno pedaço de sua alma.",
                  "exitLine": true,
                  "responseText": "OH, UM REBELDE, HEIN?! BEM, ADIVINHA SÓ, ESCÓRIA DO PECADO — VOCÊ ESTÁ PRESTES A SENTIR A IRA DE UM HOMEM QUE NÃO GOZA HÁ 15 ANOS! PREPARE-SE PARA A RETRIBUIÇÃO DIVINA!"
                }
              ]
            }
          ]
        },
        {
          "optionText": "O que acontece se eu *estivesse* contrabandeando o *estoque de punheta*? Hipoteticamente.",
          "responseText": "OH, QUER FALAR *HIPOTETICAMENTE*, HEIN? TUDO BEM, VAMOS *INTERPRETAR*. *Digamos que* você estivesse administrando um *mercado de punheta clandestino*, fornecendo aos moradores desesperados do refúgio *erotismo premium pré-guerra* — *estou falando de PÁGINAS DUPLAS COM PEITINHO DE LADO, SEU MONSTRO.* Se fosse o caso, eu teria que te trancar no *DOMO DA GOZADA*. E ACREDITE EM MIM, NINGUÉM SOBREVIVE LÁ.",
          "followUpOptions": [
            {
              "optionText": "O DOMO DA GOZADA?",
              "responseText": "É uma cela de vidro dentro do 'centro de entretenimento' do refúgio. Todo residente é permitido e encorajado a bater uma bem na sua frente como se você fosse uma exibição de zoológico. De vez em quando, um morador do refúgio se aproxima e pergunta se você quer participar, antes que o policial da pureza te dê um tapa e diga 'NÃO. NUNCA.'"
            }
          ]
        }
      ]
    }
  ]
}
