{
  "options": [
    {
      "optionText": "O que você quer?",
      "responseText": "Ah, você sabe por que estou aqui. Ouvi uns... barulhos interessantes vindo deste quarto na noite passada. Desembucha, estava lutando com o bispo careca de novo?",
      "followUpOptions": [
        {
          "optionText": "Mano, era eu lutando com uma Radroach.",
          "responseText": "Lutando com uma Radroach? É assim que vocês jovens chamam hoje em dia? Eu vi o jeito que você segurou aquele cano... coisa intensa, cidadão. Intensa... e suspeita.",
          "followUpOptions": [
            {
              "optionText": "Cara, qual é o seu problema?",
              "responseText": "Nenhum, ao contrário de você, seu bandido de mão imundo! Não pense que não notei que seu estoque de loção diminuiu 3%! Eu tenho gráficos!",
              "followUpOptions": [
                {
                  "optionText": "Espera, você realmente monitora o uso de loção?",
                  "responseText": "Ah, nós monitoramos tudo, querido. Loção, lenços de papel, pausas estranhas na sua fala. Temos até seu batimento cardíaco arquivado. E agora, está um pouco rápido, não está? Tem algo a esconder?",
                  "followUpOptions": [
                    {
                      "optionText": "Está rápido porque você me acordou com suas acusações malucas!",
                      "responseText": "Sei, sei. Aposto que você estava sonhando com... coisas impuras. Vá em frente, me diga com o que estava sonhando, pecador. Era com... pés?"
                    },
                    {
                      "optionText": "Você monitora meu batimento cardíaco? Isso é loucura!",
                      "responseText": "Loucura? Nah, garoto. O que é loucura é a quantidade de pinups de garrafas de Nuka-Cola que encontrei atrás do dispensador de comida na semana passada. Sabe no que isso resulta? Tecido arruinado e uma mente fraca."
                    },
                    {
                      "optionText": "Você não vai encontrar nada, cara. Sou 100% puro.",
                      "responseText": "É mesmo? Diga isso para o botão de liberação de emergência. Aposto que você tem sonhado com ele, não é? Imaginando toda aquela sujeira pré-guerra. Deixa eu adivinhar, você tem um plano, não tem?",
                      "followUpOptions": [
                        {
                          "optionText": "Eu nem sei onde fica, cara! Calma!",
                          "responseText": "Não se faça de idiota comigo. Você acha que isso é um jogo? A Liberação de Emergência é matéria de lendas e você está me dizendo que nunca sentiu a atração? A... coceira?",
                          "followUpOptions": [
                            {
                              "optionText": "Que coceira? Parece que você é o obcecado por isso!",
                              "responseText": "Obcecado?! EU?! Não projete seus desejos sujos em mim, cidadão! Tenho a força de vontade de um Deathclaw sob efeito de Nuka-roides! Mas você? Consigo ver nos seus olhos — palmas suadas, aquele tique estranho que você está fazendo. Sim, você tem a coceira... a coceira de *emergência*. E acredite em mim, quando ela começa, você estará arranhando as paredes como uma radroach.",
                              "followUpOptions": [
                                {
                                  "optionText": "Você está delirando! É só um botão!",
                                  "responseText": "SÓ UM BOTÃO?! Sua doce criança de verão... Aquele botão é o Santo Graal da roupa suja, a mãe de todas as tetas pixeladas, a fronteira final dos *prazeres proibidos*! Um toque, e você está nadando em tanta pornografia pré-guerra que poderia derrubar toda a rede elétrica do Refúgio. Você não duraria 5 segundos, amigo. Cinco. Malditos. Segundos."
                                },
                                {
                                  "optionText": "Essa conversa está me dando uma coceira... de ir embora.",
                                  "exitLine": true,
                                  "responseText": "Vá em frente, corra, covarde! Mas você não pode fugir do destino! E quando você encontrar aquele botão — E VOCÊ VAI ENCONTRAR — você se lembrará deste momento. E ouvirá minha voz na sua cabeça dizendo: “Eu te avisei, seu noob imundo!”"
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "optionText": "Sim, e quando eu encontrar, vou garantir que VOCÊ seja o primeiro a ver a mercadoria.",
                          "responseText": "Ah, você quer compartilhar a riqueza? Vou garantir que você tenha um lugar VIP na Câmara da Vergonha. Primeira fila para 12 horas de Família Pato Feliz. Aproveite."
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "optionText": "Eu só estava coçando as costas! Já ouviu falar de higiene?",
          "responseText": "Higiene? Essa é sua desculpa? É como dizer que está assistindo a fitas pré-guerra pelo enredo! Agora abaixe as calças — espera, isso soou errado…",
          "followUpOptions": [
            {
              "optionText": "Não vou abaixar nada para você!",
              "responseText": "É o que todos dizem. Então, BAM! Encontro um estoque escondido de pornografia debaixo da cama. Sabe como é: onde há uma meia, há uma carga.",
              "followUpOptions": [
                {
                  "optionText": "Estou te dizendo, não fiz nada! Você está paranoico.",
                  "responseText": "Paranoico?! Você acha que eu queria este trabalho? Você acha que eu GOSTO de perseguir punheteiros degenerados o dia todo? Eu era um armeiro, agora sou o rei do 'bonk' da cidade dos moles!",
                  "followUpOptions": [
                    {
                      "optionText": "É, parece que você está tendo um colapso mental.",
                      "responseText": "Colapso mental? Isso é apenas seu cérebro encharcado de pornografia falando. Logo você estará vendo coisas, como peitos em radscorpions!"
                    },
                    {
                      "optionText": "Parece que você precisa de uma 'liberação', oficial.",
                      "responseText": "Não se atreva, garoto. Sou o que chamam de 'iluminado'. Sem distrações, sem impulsos, sem pilhas de meias nojentas. Puro. Como. Um. Deus."
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Ah, você не vai se livrar tão fácil. Nos encontraremos de novo, e da próxima vez… estarei carregando um cassetete de 'bonk' maior.",
      "exitLine": true
    }
  ]
}
