{
  "options": [
    {
      "optionText": "Tenho uma nova moradora, Grace. Ela precisa de um macacão do refúgio.",
      "onlyDisplayIfHasObjective": "Get a vault suit for Grace.",
      "icon": "GUI/quest mark",
      "giveItem": "Vault suit",
      "exitLine": true,
      "dontShowIfProgressionEventPlayed": "get_suit_for_grace",
      "progressionEventPlayed": "get_suit_for_grace",
      "responseText": "Uma nova moradora? Tudo bem, pegue um macacão para ela. Mas certifique-se de que ela saiba que é o modelo padrão. A última coisa que precisamos é de alguém enfeitando o logotipo da Vault-Tec."
    },
    {
      "optionText": "Estou aqui pelo livro de receitas da Gina...",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Retrieve Recipe Book for Gina",
      "responseText": "Ah, o infame livro de 'receitas'. Cheio de 'Donuts Recheados com Creme' e 'Surpresas de Linguiça Grossa', certo? Aquele livro é uma ameaça à decência. Por que você o quer?",
      "followUpOptions": [
        {
          "optionText": "É só um livro de receitas. Não pode deixar passar?",
          "responseText": "É, e eu sou apenas uma humilde guardiã da pureza que não precisa dar 'bonks' em pervertidos o dia todo. Você pode tentar me bajular o quanto quiser, mas preciso de algo *suculento* se espera que eu o entregue.",
          "followUpOptions": [
            {
              "optionText": "Eu tenho mantido as coisas puras, não tenho? Me dá um desconto.",
              "responseText": "Bem, bem, bem... parece que você manteve as mãos limpas — por enquanto. Tudo bem, pegue o livro. Mas se eu vir algum 'Pãozinho do Pecado' saindo daquela cozinha, você e eu teremos uma conversa... e todas as palavras começarão com 'bonk'.",
              "relationshipRequired": 10,
              "giveItem": "Gina's Recipe Book",
              "exitLine": true
            },
            {
              "optionText": "E se eu te oferecer outra coisa?",
              "responseText": "Oh-ho-ho! Nuka-Cola XXX, querido! Agora, este é o tipo de 'refresco puro' que eu aprovo. Considere aquele livro de receitas imundo seu — *aproveite seus pãezinhos do pecado, seu demônio!*",
              "failedCheckResponse": "Agora estamos conversando! Tem algo... *estimulante*? Oh! Já sei — que tal uma garrafa de Nuka-Cola XXX? Aquilo é proibido, e estou morrendo de vontade de ver qual é o alvoroço. Traga-me uma, e talvez eu 'acidentalmente' deixe o livrinho pecaminoso da Gina voltar a circular.",
              "giveItemToCharacter": "Nuka-Cola XXX",
              "itemRequired": "Nuka-Cola XXX",
              "giveItem": "Gina's Recipe Book",
              "exitLine": true
            },
            {
              "optionText": "Deixa pra lá, vou arranjar outra coisa.",
              "exitLine": true,
              "responseText": "Como quiser, mas aquele livro não vai sair desta sala a menos que você me dê um *bom* motivo."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Ouvi dizer que você confiscou a holofita do robô. Eu preciso dela.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Fix the Vault Sexbot",
      "dontShowIfProgressionEventPlayed": "got_sexbot_holotape",
      "responseText": "Oh, você quer dizer a IMUNDÍCIE? Aquela imundície nojenta e imoral? Aquilo NÃO TEM LUGAR no Refúgio 6969? Sim, eu confisquei. Seleia-a tão bem que nem o Liberty Prime conseguiria libertá-la. Por que você a quer?",
      "followUpOptions": [
        {
          "optionText": "É para o Supervisor...",
          "responseText": "O Supervisor?! Oh, minha nossa alma purificada! Por que não disse antes? Se é para ele, precisarei de aprovação por escrito. Com três assinaturas. E autenticada. Você não tem isso, tem? Ha, imaginei."
        },
        {
          "optionText": "Eu troco por este... *cassetete de bonk*.",
          "itemRequired": "Monster Dildo",
          "giveItem": "Sexbot holotape",
          "progressionEventPlayed": "got_sexbot_holotape",
          "giveItemToCharacter": "Monster Dildo",
          "exitLine": true,
          "responseText": "*Seus olhos se arregalam, e ela cora furiosamente* Um... cassetete de bonk? Eu... uh... talvez confisque isso... para fins de segurança, claro! Entregue, pecador. Aqui está sua holofita imunda. Agora... saia daqui antes que eu mude de ideia!"
        }
      ]
    },
    {
      "optionText": "Você não está mais seguindo as regras, está?",
      "responseText": "Regras? Pfft. Eu sou a última pessoa que ainda finge se importar. Olhe ao redor, é uma orgia completa com um lugar na primeira fila. A Polícia da Pureza desistiu horas atrás. Agora estamos aqui apenas pelo show."
    },
    {
      "optionText": "Isso faz parte da sua estratégia para pegar infratores?",
      "responseText": "Oh, totalmente. Digamos que, ficar aqui nua tornou *todos* culpados de 'crimes de pensamento'. É como atirar em peixes num barril. Ou... outra coisa num barril.",
      "followUpOptions": [
        {
          "optionText": "Então, o que acontece se alguém tocar?",
          "responseText": "Tocar? Docinho, estamos *muito* além de tocar. Eu costumava dar 'bonks' nos infratores com o cassetete, agora é uma festa liberada. Você pensaria que eu estaria lá prendendo pessoas, mas estou muito ocupada desviando de roupas íntimas voadoras. Se alguém tocar, eu provavelmente apenas daria um 'toca aqui' e perguntaria se precisam de lubrificante.",
          "followUpOptions": [
            {
              "optionText": "Você vai entrar na festa também?",
              "responseText": "Tenho pessoas na fila implorando para ver se a xoxota da 'Polícia da Pureza' faz jus à fama. Spoiler: Faz."
            },
            {
              "optionText": "E a parte masculina da Polícia da Pureza? Eles estão enlouquecendo?",
              "responseText": "Enlouquecendo? Querido, eles estão perdendo mais do que isso. Os paus estão à solta — alguns deles provavelmente já esqueceram como é usar calças. Estou te dizendo, o chão está escorregadio de porra. É como um tobogã."
            },
            {
              "optionText": "Então... o que vem a seguir?",
              "responseText": "A seguir? Quero dizer, este refúgio basicamente se transformou em um buffet de foda à vontade. Estou surpresa que ainda não nos afogamos em porra. Acho que a única coisa que resta é mergulhar de cabeça. Trouxe seu traje de banho?"
            }
          ]
        }
      ]
    },
    {
      "optionText": "Por que você não se junta ao resto do refúgio logo?",
      "icon": "GUI/heart4",
      "responseText": "Oh, o quê, você acha que eu não fantasiei em ser comida contra a mesa de hidroponia enquanto algum pervertido bate uma na Câmara da Vergonha? Por favor. Tenho me segurado no trabalho desde o primeiro dia.",
      "followUpOptions": [
        {
          "optionText": "Então, o que caralhos você está esperando?",
          "icon": "GUI/heart4",
          "responseText": "Tudo bem, foda-se. O cassetete vai para a caixa de brinquedos. Esta xoxota é *utilidade pública*. Diga ao refúgio que estou fora de patrulha e de quatro, com a cara enfiada em uma pilha de carne do refúgio, tendo minhas entranhas rearranjadas por cada pau que quiser uma vez. A Vault-Tec pode enfiar suas regras bem no fundo de seus cus corporativos apertados. Esta xoxota está aberta para negócios!",
          "progressionEventPlayed": "purity_officer_joins_orgy",
          "followUpOptions": [
            {
              "optionText": "Agora estamos conversando.",
              "changeSprite": "Characters/Female Purity Police/bukkake",
              "newSpriteXPos": 0.67,
              "newSpriteYPos": 0.11,
              "icon": "GUI/heart4",
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "changeSpriteColor": "#E7E7E7",
              "setBGcolor": "#CCCCCC",
              "showChoiceStats": "pp_bukkake",
              "progressionEventPlayed": "purity_police_bukkake",
              "emotionsDuringHevent": [
                "none",
                "Characters/Female Purity Police/emotions/bukkake/1",
                "Characters/Female Purity Police/emotions/bukkake/2"
              ],
              "specialEffects": ["Blackout"],
              "endingEffects": ["Flashes"],
              "lineAfterHevent": "M-minhas mãos—porra, não consigo nem sentir meus dedos—muito p-pau, muita p-porra—ohhh, e eles ainda estão latejando...",
              "hEventName": "purity_police_lounge_bukkake",
              "spriteAtTheEndOfHscene": "Characters/Female Purity Police/naked ending",
              "spriteAtTheEndOfHscenePosition": [-0.79, -1.41],
              "auto_lines": [
                "Porra, não sinto meus pulsos. Quantos paus são? Doze? Quinze? Quem está contando. Me dê mais.",
                "Mmmporra, tenho porra debaixo das unhas e nem passei da primeira fileira de bolas.",
                "Jesus Cristo, quem caralhos trouxe o lubrificante de mirelurk? Isso é incrível, continue batendo, não pare!",
                "É isso, querido, jorra essa porra quente em todas as minhas tetas regulamentares. Eu limpo com disciplina mais tarde.",
                "Estou batendo mais rápido que um auto-doc com mod de velocidade—porra, me dê mais duas mãos!",
                "Oh meu Deus, sim, alinhem esses paus como se fosse um pelotão de fuzilamento. Quero ser executada por gozo.",
                "Porra, as bolas desse cara são maiores que minhas tetas. Me dê essa carga, papai.",
                "Não espere sua vez—use minhas mãos, minhas tetas, inferno, foda minha axila se estiver desesperado, sou serviço público agora.",
                "Eu costumava distribuir violações de pureza. Agora eu só distribuo punhetas e exames de próstata.",
                "Sim, SIM—goze na minha cara como se fosse o Hino Nacional. Me encharque com sua liberdade, soldado!",
                "Docinho, se seu pau não está vazando, você não está se esforçando o suficiente. Me dê essa pré-gozada como se fosse um pacote de rações.",
                "Tenho três paus nos meus punhos e um na minha garganta, e ainda tenho um joelho livre. Quem quer?",
                "Deus, sinto o cheiro do pecado nesta sala e isso está fazendo minha xoxota latejar como um contador Geiger em uma tempestade de porra.",
                "Apressem-se, seus merdas! Tenho vinte paus na lista de espera e meu queixo ainda não travou.",
                "Bata suas bolas na minha cara como se estivesse tocando um sino de jantar—me alimentem, seus garotos tarados!",
                "Mmm, seu pau é tão veiado que parece que estou acariciando o antebraço de um deathclaw. Estou obcecada.",
                "Bata! Cospe nele! Quero ver esses canos explodirem como não explodiam desde que as bombas caíram.",
                "Se você não está gemendo como uma alma penada, não estou me esforçando o suficiente—gozem em estéreo, seus degenerados do caralho.",
                "Esta mão é para bater, esta é para ordenhar, e esta boca? É para o exame oral da Vault-Tec.",
                "Não seja gentil. Soque minha cara como se fosse um formulário de reclamação—quero hematomas e gozadas.",
                "Eu costumava dar 'bonks' em pervertidos. Agora eu bato uma neles com precisão e orgulho. Refúgio 6969 para sempre!",
                "Enfie esse pau entre minhas tetas. Faça-as tremer como se eu estivesse fazendo uma purga de moralidade.",
                "Alguém comece a cronometrar—estou indo para um recorde. Cinquenta bombeadas por pau, sem engasgar, sem luvas.",
                "Porra, o ar está tão denso de porra que preciso de um snorkel. Alguém tem um sobrando?",
                "Sim! Mais paus! Empilhem-nos como tampinhas! Deixem-me servir este refúgio!",
                "Quero sua gozada escorrendo das minhas orelhas como brincos. Me enfeitem, seus animais imundos.",
                "Bata como se estivesse com raiva de mim. Puna esta boca por cada multa de pureza que eu escrevi!",
                "Me dê um pau no cotovelo—quero sentir a resistência da justiça se quebrando.",
                "Isso não é uma orgia, é uma avaliação de desempenho—e estou superando as expectativas.",
                "Quem precisa de armas? Tenho cinco dedos e zero reflexo de vômito. Venham ser abençoados.",
                "Sim, encham minhas mãos, minha garganta, minha alma—quero ficar encharcada de porra como uma esponja do refúgio.",
                "Esta xoxota costumava ditar regras. Agora ela só recebe proteína.",
                "Continuem vindo, garotos. Não vamos parar até que este refúgio se transforme em uma câmara de porra inundada. Dê um 'bonk' nisso.",

                "Ah—hahhh, porra—tanta porra—está nos meus ouvidos, por que está nos meus ouvidos—mmghf—oh Deus, não pare—",
                "Q-quem acabou de gozar no meu distintivo? QUEM CARALHOS—ahhhhhh, foda-se, é seu agora—",
                "E-eu ia impor regras—hahhh—mas agora só estou batendo uma em estranhos no corredor—",
                "Oh Deus, as bolas desse cara são tão pesadas—parece que estou ordenhando uma Brahmin—porra por todo lado—",
                "Ughhh—pooorra—não consigo nem fechar a boca sem sentir o gosto da gozada de alguém—delicioso—",
                "N-não pare de meter—posso trabalhar mais dois com meus cotovelos—só continue gozando em mim—",
                "OHHH porra! São cinco cargas em um minuto—alguém pega a porra de um balde—estou me afogando—",
                "Minha xoxota está intocada e ainda vou gozar só com isso—porra—olha minhas mãos—",
                "Eu disse 'não goze na minha cara' e depois abri a boca—sou uma mentirosa—ahhh—",
                "Puta merda, por que todo pau tem gosto de Nuka-Cola e arrependimento—bate mais forte—",
                "A-AHHH porra, eu amo isso—corredor de bukkake do caralho—sou um alvo de porra vivo—",
                "Não sei se estou lubrificando eles ou se eles estão me lubrificando—tanta gosma—tanto pau—",
                "Hahhhh! P-porra—tem porra no meu olho mas ainda vejo outro pau—traga aqui—",
                "Não pergunte se estou bem—gozei quatro vezes só com punhetas—as mãos estão dormentes—",
                "Por que vocês estão todos tão acumulados? Não sou um banco de porra! ...na verdade, espera, sim, eu sou—",
                "E-eu não consigo parar de gemer—cada som faz outra pessoa gozar—porra, isso é um ciclo—",
                "Eu toquei no pau de um cara e outros três gozaram—gozo telepático confirmado—",
                "Oh porra—de quem foi essa?! Acabei de levar um tiro de espingarda nas costas com a alma de alguém—",
                "Minhas unhas estão pegajosas—MINHAS UNHAS—você tem noção de quanta porra é isso?!",
                "Sim—SIM—me dê todo o seu pecado—vou polir com a minha língua—hahahapooorra—",
                "Por que o chão está fazendo barulho de esguicho—quem derrubou um galão nos azulejos da enfermaria?!",
                "OHHHHH—estou enfiando o punho em dois caras enquanto bato uma em um sintético e AINDA não estou satisfeita—",
                "Haaaahh—hahhh—meu pulso está travando—foda-se, vou usar meu rosto—traga pra cá—",
                "Não geme assim—vou gozar de novo—porra—estou gozando nas minhas próprias palmas—",
                "Quem precisa de luvas quando está enfiando o punho em pecadores com as próprias mãos como uma sacerdotisa do refúgio—",
                "Cada gemido é outra carga—cada respiração está cheia de névoa de pau—estou prosperando—",
                "Isso não é mais um refúgio—é um gerador movido a porra e eu sou a porra do interruptor—",
                "E-eu esqueci quem eu era—só conheço paus e porra agora—minha vida inteira são punhetas—",
                "Eu achava que meu trabalho era dar 'bonks' em pervertidos—agora só estou espremendo semente de cada um de vocês—",
                "Não consigo piscar sem levar outra porra de facial—só goza logo—porra—",
                "Olha a porra dos meus braços—sou mais lubrificante do que músculo—alguém me jogue um balde d'água—",
                "OH PORRA—punho duplo de novo—alguém marca na parede, estou quebrando recordes aqui—",
                "V-você ainda está duro? Te esgotei três vezes—O QUE TEM NAS SUAS BOLAS?!",
                "Ahhhhh—não pare—minhas mãos foram feitas para isso—nasci para bater uma—",
                "Porra—alguém acabou de gozar nos meus pés—agora estou escorregando como uma bailarina imunda—",
                "Acabei de pegar porra no meu umbigo—nem sei como isso aconteceu—",
                "Meus braços estão com cãibra—alguém me foda antes que eu desmaie com um pau em cada punho—",
                "D-Deus, eu amo isso—sou o ralo de pecados oficial do refúgio—tragam suas cargas, me alimentem—",
                "Ahhh! Sim—SIM—gozem para mim, seus nojentos do caralho—vou bater uma para este refúgio até o fim dos tempos!"
              ]
            }
          ]
        },
        {
          "optionText": "Pensei que você gostasse de assistir. Com medo de ficar viciada?",
          "responseText": "Viciada? Docinho, minha xoxota tem tremido como um Protectron com defeito toda vez que alguém geme. Já estou *viciada*. Só estou tentando não explodir no caminho."
        },
        {
          "optionText": "Deixa pra lá. Não sabia que a 'Xoxota da Polícia da Pureza' era só conversa.",
          "responseText": "Sua puta, diga isso de novo e eu subo na sua cara com tanta força que as câmeras de segurança vão começar a soltar fumaça. Você quer a 'Xoxota da Polícia da Pureza'? É melhor se preparar para o impacto."
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Já vai? Não se preocupe. Ficarei de olho em você. Literalmente. Todas as câmeras estão quebradas, então agora fico do lado de fora do seu quarto.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Bem-vindo à central de orgias do refúgio. Não aja como se estivesse chocado."
  ],
  "showShadowFigures": "Lounge ending orgy"
}
