{
  "options": [
    {
      "optionText": "Que porra é essa de exilar a Diana?",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Help Diana Avoid Exile",
      "responseText": "Regras são regras. A impureza dela é uma ameaça à moralidade do refúgio. Não temos escolha — ela vai embora. Além disso, não se atreva a se aproximar de mim com essa linguagem chula.",
      "followUpOptions": [
        {
          "optionText": "Ela vai ficar. Fim de discussão.",
          "responseText": "Você desafia a doutrina de pureza do refúgio? Explique-se antes que nós te exilemos também.",
          "followUpOptions": [
            {
              "optionText": "Exile-a, e eu juro que vou engravidar cada uma de suas vadias da pureza até que este refúgio pareça uma maternidade.",
              "responseText": "Sua arrogância não conhece limites... e suas ameaças não têm peso. Você não se atreveria a nos tocar.",
              "followUpOptions": [
                {
                  "optionText": "Tente a sorte. Você acha que vocês, putas da pureza, conseguem resistir ao meu pau? Vão implorar pela minha porra dentro de vocês.",
                  "responseText": "Chega. Sua imundície me enoja. Ninguém ousaria desafiar a polícia da pureza de forma tão descarada!",
                  "followUpOptions": [
                    {
                      "optionText": "Olhe nos meus olhos. Pareço estar blefando?",
                      "responseText": "...Você está falando sério. T-Tudo bem. A garota fica — por enquanto. Mas saiba de uma coisa: você fez inimigos perigosos hoje. Não podemos arcar com um escândalo de gravidez em massa entre as aplicadoras da lei. Vamos vigiar vocês dois. Um passo em falso, e o refúgio se afogará no seu sangue em vez da sua semente!",
                      "markObjectiveComplete": "Help Diana Avoid Exile",
                      "followUpOptions": [
                        {
                          "optionText": "Lembre-se: toque nela, e eu começo esta noite.",
                          "responseText": "Entendido. Pelo bem do refúgio, vamos deixá-la em paz — por enquanto.",
                          "exitLine": true
                        },
                        {
                          "optionText": "Decisão inteligente. Agora suma da minha vista.",
                          "responseText": "Cuidado. A polícia da pureza não esquece ameaças.",
                          "exitLine": true
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "optionText": "Tudo bem, leve-a. Veja se eu me importo.",
          "responseText": "Fico feliz que você entenda. A pureza deve ser mantida.",
          "exitLine": true
        }
      ]
    },
    {
      "optionText": "Tenho uma nova moradora, Grace. Ela precisa de um macacão do refúgio.",
      "onlyDisplayIfHasObjective": "Get a vault suit for Grace.",
      "icon": "GUI/quest mark",
      "giveItem": "Vault suit",
      "exitLine": true,
      "dontShowIfProgressionEventPlayed": "get_suit_for_grace",
      "progressionEventPlayed": "get_suit_for_grace",
      "responseText": "Uma nova moradora? Tudo bem, pegue um macacão para ela. Mas certifique-se de que ela saiba que é o modelo padrão. A última coisa que precisamos é de alguém enfeitando o logotipo da Vault-Tec."
    },
    {
      "optionText": "Estou aqui pelo livro de receitas da Gina...",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Retrieve Recipe Book for Gina",
      "responseText": "Ah, o infame livro de 'receitas'. Cheio de 'Donuts Recheados com Creme' e 'Surpresas de Linguiça Grossa', certo? Aquele livro é uma ameaça à decência. Por que você o quer?",
      "followUpOptions": [
        {
          "optionText": "É só um livro de receitas. Não pode deixar passar?",
          "responseText": "É, e eu sou apenas uma humilde guardiã da pureza que não precisa dar 'bonks' em pervertidos o dia todo. Você pode tentar me bajular o quanto quiser, mas preciso de algo *suculento* se espera que eu o entregue.",
          "followUpOptions": [
            {
              "optionText": "Eu tenho mantido as coisas puras, não tenho? Me dá um desconto.",
              "responseText": "Bem, bem, bem... parece que você manteve as mãos limpas — por enquanto. Tudo bem, pegue o livro. Mas se eu vir algum 'Pãozinho do Pecado' saindo daquela cozinha, você e eu teremos uma conversa... e todas as palavras começarão com 'bonk'.",
              "relationshipRequired": 10,
              "giveItem": "Gina's Recipe Book",
              "exitLine": true
            },
            {
              "optionText": "E se eu te oferecer outra coisa?",
              "responseText": "Oh-ho-ho! Nuka-Cola XXX, querido! Agora, este é o tipo de 'refresco puro' que eu aprovo. Considere aquele livro de receitas imundo seu — *aproveite seus pãezinhos do pecado, seu demônio!*",
              "failedCheckResponse": "Agora estamos conversando! Tem algo... *estimulante*? Oh! Já sei — que tal uma garrafa de Nuka-Cola XXX? Aquilo é proibido, e estou morrendo de vontade de ver qual é o alvoroço. Traga-me uma, e talvez eu 'acidentalmente' deixe o livrinho pecaminoso da Gina voltar a circular.",
              "giveItemToCharacter": "Nuka-Cola XXX",
              "itemRequired": "Nuka-Cola XXX",
              "giveItem": "Gina's Recipe Book",
              "exitLine": true
            },
            {
              "optionText": "Deixa pra lá, vou arranjar outra coisa.",
              "exitLine": true,
              "responseText": "Como quiser, mas aquele livro não vai sair desta sala a menos que você me dê um *bom* motivo."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Ouvi dizer que você confiscou a holofita do robô. Eu preciso dela.",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Fix the Vault Sexbot",
      "dontShowIfProgressionEventPlayed": "got_sexbot_holotape",
      "responseText": "Oh, você quer dizer a IMUNDÍCIE? Aquela imundície nojenta e imoral? Aquilo NÃO TEM LUGAR no Refúgio 6969? Sim, eu confisquei. Seleia-a tão bem que nem o Liberty Prime conseguiria libertá-la. Por que você a quer?",
      "followUpOptions": [
        {
          "optionText": "É para o Supervisor...",
          "responseText": "O Supervisor?! Oh, minha nossa alma purificada! Por que não disse antes? Se é para ele, precisarei de aprovação por escrito. Com três assinaturas. E autenticada. Você não tem isso, tem? Ha, imaginei."
        },
        {
          "optionText": "Eu troco por este... *cassetete de bonk*.",
          "itemRequired": "Monster Dildo",
          "giveItem": "Sexbot holotape",
          "progressionEventPlayed": "got_sexbot_holotape",
          "giveItemToCharacter": "Monster Dildo",
          "exitLine": true,
          "responseText": "*Seus olhos se arregalam, e ela cora furiosamente* Um... cassetete de bonk? Eu... uh... talvez confisque isso... para fins de segurança, claro! Entregue, pecador. Aqui está sua holofita imunda. Agora... saia daqui antes que eu mude de ideia!"
        }
      ]
    },
    {
      "optionText": "O que é este lugar?",
      "responseText": "Bem-vindo ao Refúgio 6969, também conhecido como o Refúgio da Abstinência. Por aqui, nós transformamos a frustração sexual em arma. Então, prepare-se, docinho, porque seus dias de prazer acabaram. Você está prestes a canalizar cada impulso de tesão que já teve em cultivar agressivamente batatas mutantes e tricotar suéteres que ninguém quer.",
      "followUpOptions": [
        {
          "optionText": "Isso é alguma piada?",
          "responseText": "Não é piada, querido. Agora, é melhor se acostumar, ou a Câmara da Vergonha vai se tornar sua nova melhor amiga.",
          "followUpOptions": [
            {
              "optionText": "O que é a Câmara da Vergonha?",
              "responseText": "Ah, a Câmara da Vergonha! É nosso cantinho aconchegante de humildade e arrependimento. É basicamente como uma sala de spa, mas em vez de relaxamento, você sente uma sensação avassaladora de vergonha e a vontade de repensar suas escolhas de vida. Divertido, né?"
            }
          ]
        },
        {
          "optionText": "Acho que cheguei aqui por engano. Pode, sei lá, me deixar sair?",
          "responseText": "Oh, querido, ninguém acaba no Refúgio 6969 por engano. O único erro aqui é você pensar que pode simplesmente sair daqui sem aprender o verdadeiro poder do autocontrole. Agora, você vai se comportar, ou preciso te apresentar ao meu Cassetete de Bonk?"
        },
        {
          "optionText": "Sou profissional em resistir a impulsos. Aposto que você não consegue me tentar!",
          "icon": "GUI/quest mark",
          "dontDisplayIfObjectiveComplete": "Bonk 10 violators.",
          "responseText": "Oh, não estamos no negócio de tentar. Estamos no negócio de policiar. Mas se você quer desafiar o sistema, estarei de olho em você. Na verdade, que tal você nos *ajudar* em vez disso?",
          "followUpOptions": [
            {
              "optionText": "Ajudar você? Como assim?",
              "responseText": "Oh, agora você está interessado. O negócio é o seguinte: temos uma infestação de merdas acontecendo pelo refúgio. Você dá um 'bonk' em 10 infratores, e eu garanto que você será *recompensado*. O que me diz?",
              "followUpOptions": [
                {
                  "optionText": "De que tipo de violações estamos falando?",
                  "responseText": "Sabe, o de sempre. Punheta, 'tempo a sós' não autorizado, holofitas ilícitas, conversas sugestivas — basicamente qualquer coisa que faça a Polícia da Pureza se contorcer. Você nos ajuda, e eu te dou algumas recompensas oficiais."
                },
                {
                  "optionText": "Tudo bem.",
                  "addObjective": "Bonk 10 violators.",
                  "exitLine": true,
                  "responseText": "Bom saber que você está do lado certo. Fique de olhos abertos e quando tiver dado uns 'bonks' em alguns degenerados, venha me encontrar."
                }
              ]
            }
          ]
        },
        {
          "optionText": "Então, pode fazer sexo, pelo menos?",
          "responseText": "Sexo? Aqui? É como perguntar se pode ter uma suruba na igreja. A resposta é um grande e gordo não. O último casal que tentou acabou esfregando o chão da Câmara da Vergonha com escovas de dente."
        }
      ]
    },
    {
      "optionText": "Fale-me sobre você. Quer dizer, além de ser uma estraga-prazeres profissional.",
      "responseText": "Sobre mim? Bem, sou uma Oficial da Polícia da Pureza, e meus hobbies incluem dar 'bonks' em pervertidos como você e lembrar aos moradores do refúgio que o autocontrole é mais importante que seus impulsos patéticos. Mais alguma coisa que precise saber, ou isso é apenas mais uma tentativa triste de cantada?",
      "followUpOptions": [
        {
          "optionText": "Então, este é o seu emprego dos sonhos, ou você apenas perdeu uma aposta?",
          "responseText": "Emprego dos sonhos? Não passei por quatro anos miseráveis na Academia de Prevenção de Punheta para ouvir um andarilho dos Ermos sem autocontrole.",
          "followUpOptions": [
            {
              "optionText": "Sério, quem te machucou? Por que você odeia diversão?",
              "responseText": "Diversão? Você acha que punheta é diversão? Saiba que eu encontro alegria na disciplina, ordem e na aplicação das regras. E acredite, me divirto muito colocando pervertidos na linha. Agora, é só isso, ou você está só procurando por um 'bonk'?"
            }
          ]
        },
        {
          "optionText": "Como vocês sabem que alguém está batendo uma? Existe, tipo, um radar de punheta?",
          "responseText": "Ah, nós sabemos. Acredite, nós sabemos. Temos sensores, câmeras e um sexto sentido para o desespero. Então, cuidado."
        }
      ]
    },
    {
      "optionText": "Tchau.",
      "responseText": "Mantenha as mãos onde eu possa ver. E lembre-se, ninguém está acima das regras.",
      "exitLine": true
    }
  ]
}
