{
    "options": [
    {
      "optionText": "What the fuck is this bullshit about exiling Diana?",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Help Diana Avoid Exile",
      "responseText": "Rules are rules. Her impurity is a threat to vault morality. We have no choice—she goes. Also, don't dear approaching me with such foul tongue.",
      "followUpOptions": [
        {
          "optionText": "She's staying. End of discussion.",
          "responseText": "You defy vault purity doctrine? Explain yourself before we exile you too.",
          "followUpOptions": [
            {
              "optionText": "Exile her, and I swear I’ll breed every last one of your purity bitches until this vault looks like a maternity ward.",
              "responseText": "Your arrogance knows no bounds… and your threats hold no weight. You wouldn’t dare to even touch us.",
              "followUpOptions": [
                {
                "optionText": "Try me. You think you purity cunts can resist my cock? You'll beg for my cum inside you.",
                "responseText": "Enough. Your filth disgusts me. No one would dare challenge the purity police that brazenly!"
                ,"followUpOptions": [ 
                    {
                    "optionText": "Look me in the eye. Do I look like I'm bluffing?",
                    "responseText": "...You're serious. F-Fine. The girl stays—for now. But know this: you've made dangerous enemies today. We cannot afford mass pregnancy scandal among the enforcers. We will watch both of you. One misstep, and the vault will drown in your blood instead of your seed!",
                    "markObjectiveComplete": "Help Diana Avoid Exile",
                    "followUpOptions": [
                        {
                        "optionText": "Remember: touch her, and I'll start tonight.",
                        "responseText": "Understood. For the vault's sake, we'll let her be—for now.",
                        "exitLine": true
                        },
                        {
                        "optionText": "Smart decision. Now get out of my sight.",
                        "responseText": "Watch yourself. The purity police don't forget threats.",
                        "exitLine": true
                        }
                    ]
                    } 
                ]
                }
              ]
            } 
          ]
        },
        {
        "optionText": "Fine, take her. See if I care.",
        "responseText": "Glad you see reason. Purity must be maintained.",
        "exitLine": true
        }
      ]
    },
    {
        "optionText": "I’ve got a new resident, Grace. She needs a vault suit.",
        "onlyDisplayIfHasObjective": "Get a vault suit for Grace.",
        "icon": "GUI/quest mark",
        "giveItem": "Vault suit",
        "exitLine": true,
        "dontShowIfProgressionEventPlayed": "get_suit_for_grace",
        "progressionEventPlayed": "get_suit_for_grace",
        "responseText": "A new resident? Fine, get her a vault suit. But make sure she knows it’s standard issue. The last thing we need is someone bedazzling the Vault-Tec logo."
    },
    {
        "optionText": "I'm here about Gina’s recipe book...",
        "icon": "GUI/quest mark",
        "onlyDisplayIfHasObjective": "Retrieve Recipe Book for Gina",
        "responseText": "Ah, the infamous 'recipe' book. Full of 'Cream-Filled Donuts' and 'Thick Sausage Surprises,' right? That book is a menace to decency. Why would you want it?",
        "followUpOptions": [
            {
                "optionText": "It’s just a cookbook. Can’t you let it slide?",
                "responseText": "Yeah, and I’m just a humble guardian of purity who doesn’t have to bonk pervs on the daily. You can try to sweet talk me all you want, but I need something *juicy* if you expect me to hand it over.",
                "followUpOptions": [
                    {
                        "optionText": "I’ve been keeping things pure, haven’t I? Cut me some slack.",
                        "responseText": "Well, well, well... looks like you’ve kept those hands clean—for now. Alright, fine, take the book. But if I see any 'Buns of Sin' coming out of that kitchen, you and me are gonna have words... and they’re all gonna start with 'bonk.'",
                        "relationshipRequired": 10,
                        "giveItem": "Gina's Recipe Book", 
                        "exitLine": true
                    },
                    {
                        "optionText": "What if I offered you something else?",
                        "responseText": "Oh-ho-ho! Nuka-Cola XXX, baby! Now this is the kind of 'pure refreshment' I can get behind. Consider that filthy cookbook yours—*enjoy your buns of sin, you devil!*",
                        "failedCheckResponse": "Now we’re talking! Got anything... *stimulating*? Oh! I know—how about a bottle of Nuka-Cola XXX? That stuff's banned, and I’ve been dying to see what all the fizz is about. Bring me one, and I might just 'accidentally' drop Gina’s sinful little recipe book back into circulation.",
                        "giveItemToCharacter": "Nuka-Cola XXX",
                        "itemRequired": "Nuka-Cola XXX",
                        "giveItem": "Gina's Recipe Book",
                        "exitLine": true
                    },
                    {
                        "optionText": "Never mind, I’ll figure something else out.",
                        "exitLine": true,
                        "responseText": "Suit yourself, but that book’s not leaving this room unless you give me a *good* reason."
                    }
                ]
            } 
        ]
    },
    {
        "optionText": "I heard you confiscated the robot's holotape. I need it.",
        "icon": "GUI/quest mark",
        "onlyDisplayIfHasObjective": "Fix the Vault Sexbot",
        "dontShowIfProgressionEventPlayed": "got_sexbot_holotape",
        "responseText": "Oh, you mean the FILTH? That revolting, immoral filth? That has NO PLACE in Vault 6969? Yeah, I confiscated it. Sealed it so tight even Liberty Prime couldn’t liberate it. Why do you want it?",
        "followUpOptions": [ 
            {
                "optionText": "It’s for the Overseer...",
                "responseText": "The Overseer?! Oh, my goodness gracious purified soul! Why didn’t you say so? If it’s for him, I’ll need written approval. Triple signed. And notarized. You don’t have that, do you? Hah, thought so."
            }, 
            {
                "optionText": "I’ll trade it for this... *bonk baton*.",
                "itemRequired": "Monster Dildo",
                "giveItem": "Sexbot holotape",
                "progressionEventPlayed": "got_sexbot_holotape",
                "giveItemToCharacter": "Monster Dildo",
                "exitLine": true,
                "responseText": "*Her eyes widen, and she blushes furiously* A... bonk baton? I... uh... might confiscate this... for safety purposes, of course! Hand it over, sinner. Here's your filthy holotape. Now... get out of here before I change my mind!"
            }
        ]
    },
    {
        "optionText": "What’s this place?",
        "responseText": "Welcome to Vault 6969, also known as the No-Fap Vault. Around here, we weaponize sexual frustration. So strap in, sweatie, because your days of pleasure are over. You're about to channel every horny impulse you've ever had into aggressively farming mutated potatoes and knitting sweaters nobody wants.",
        "followUpOptions": [
            {
                "optionText": "Is this some joke?",
                "responseText": "No joke, sweetheart. Now, you better get used to it, or the Shame Chamber's going to become your new best friend.",
                "followUpOptions": [
                    {
                        "optionText": "What is the Shame Chamber?",
                        "responseText": "Ah, the Shame Chamber! It's our cozy little corner of humility and regret. It's basically like a spa room, but instead of relaxation, you get an overwhelming sense of shame and the urge to rethink your life choices. Fun, right?"
                    }
                    
                ]
            },
            {
                "optionText": "I think I got here by mistake. Can you just, I dunno, let me out?",
                "responseText": "Oh, honey, nobody ends up in Vault 6969 by mistake. The only mistake here is you thinking you can just waltz out of here without learning the true power of self-restraint. Now, are you going to behave, or do I need to introduce you to my Bonk Baton?"
            },
            {
                "optionText": "I’m a pro at resisting urges. Bet you can’t tempt me!",
                "icon": "GUI/quest mark",
                "dontDisplayIfObjectiveComplete": "Bonk 10 violators.",
                "responseText": "Oh, we’re not in the business of tempting. We’re in the business of policing. But if you want to challenge the system, I’ll have my eye on you. Actually, how about you *help* us instead?",
                "followUpOptions": [
                    {
                        "optionText": "Help you? What do you mean?",
                        "responseText": "Oh, so now you're interested. Here’s the deal: we’ve got an infestation of fuck-ups happening around the vault. You bonk 10 violators, and I’ll make sure you're *rewarded*. What do you say?",
                        "followUpOptions": [
                            {
                                "optionText": "What kind of violations are we talking about?",
                                "responseText": "You know, the usual. Fapping, unauthorized 'alone time,' illicit holotapes, suggestive conversations—basically anything that makes the Purity Police cringe. You help us out, and I’ll throw in some official rewards."
                            },
                            {
                                "optionText": "Alright.",
                                "addObjective": "Bonk 10 violators.",
                                "exitLine": true,
                                "responseText": "Good to know you're on the right side of things. Keep your eyes peeled and when you have bonked some degenerates, come find me."
                            }
                        ]
                    } 
                ]
            },
            {
                "optionText": "So, is it okay to have sex, at least?",
                "responseText": "Sex? Here? That’s like asking if you can have a gangbang at a church. The answer is a big, fat no. The last couple who tried to get it on ended up scrubbing the Shame Chamber floors with toothbrushes."
            }            
            
        ]
    },
    {
        "optionText": "Tell me about yourself. I mean, besides being a professional mood killer.",
        "responseText": "About me? Well, I’m a Purity Police Officer, and my hobbies include bonking pervs like you and reminding vault dwellers that self-restraint is more important than their pathetic urges. Anything else you need to know, or is this just another sad attempt at a pick-up line?",
        "followUpOptions":[
            {
                "optionText": "So, is this your dream job, or did you just lose a bet?",
                "responseText": "Dream job? I didn’t go through four miserable years of Fap Prevention Academy to listen to some wastelander with no self-control.",
                "followUpOptions":[
                    {
                        "optionText": "Seriously, though, who hurt you? Why do you hate fun?",
                        "responseText": "Fun? You think fapping is fun? I’ll have you know I find joy in discipline, order, and enforcing the rules. And believe me, I have plenty of fun knocking pervs back into line. Now, is that all, or are you just fishing for a bonking?"
                    }
                ]
            },
            {
                "optionText": "How do you guys even know someone’s fapping? Is there, like, a fap radar?",
                "responseText": "Oh, we know. Trust me, we know. We’ve got sensors, cameras, and a sixth sense for desperation. So watch yourself."
            }
        ]
    },
    {
        "optionText": "Bye.",
        "responseText": "Just keep your hands where I can see them. And remember, no one’s above the rules.",
        "exitLine": true
    }
    ]
}
