{
  "options": [
    {
      "optionText": "Ei... você está bem?",
      "responseText": "Depende do que você quer dizer com 'bem'.",
      "followUpOptions": [
        {
          "optionText": "O que aconteceu com você?",
          "responseText": "Fui pega por uns desgraçados a oeste. Me trocaram por um punhado de tampinhas. Isso foi... semanas atrás, talvez."
        },
        {
          "optionText": "Você precisa de ajuda para sair daqui?",
          "responseText": "Você acha que alguém sai daqui? Eu nem saberia para onde ir."
        }
      ]
    },
    {
      "optionText": "*Chuta a cadeira.* Acorda, acorda, sua puta.",
      "responseText": "Quem diabos—? Ah... outro cuzão veio brincar. Me mate de uma vez ou some daqui, porra, não me importo mais.",
      "followUpOptions": [
        {
          "optionText": "Já está quebrada, hein? Patético.",
          "responseText": "Quebrada? Estou pulverizada, seu cuzão. Quer um pedaço? Vá em frente, veja se sobrou alguma coisa."
        },
        {
          "optionText": "Qual é o seu preço, vadia?",
          "responseText": "Algumas tampinhas, uma dose de Jet, uma bala na minha cabeça. Escolha."
        },
        {
          "optionText": "Cuidado com a língua ou eu a arranco.",
          "responseText": "*Ela cospe saliva manchada de sangue em seus pés* Faça isso, covarde. Você só vai me excitar."
        }
      ]
    },
    {
      "optionText": "Qual é a história dela? *aponta para a garota no chão.*",
      "responseText": "Carne nova. Os saqueadores a arrastaram gritando ontem. Ainda está chorando. Dê uma semana, ela vai implorar para você acabar com o sofrimento dela."
    },
    {
      "optionText": "Gostando da vida de saqueadora?",
      "responseText": "Sou o brinquedo favorito deles — usada, abusada, quebrada. A única coisa que me mantém respirando é o rancor. E tenho de sobra para você se chegar muito perto."
    },
    {
      "optionText": "Tchau.",
      "responseText": "É. Some daqui.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Disseram que eu tive sorte. Disseram que a última garota não durou nem um dia.",
    "Ele disse que se eu chorar de novo, ele vai cortar minhas orelhas.",
    "*tosse úmida no quarto ao lado... seguida por soluços baixos e guturais*"
  ],
  "showShadowFigures": "Raider Slut Hall"
}
