{
    "options": [ 
        {
            "optionText": "You don’t seem too worried I just kicked your boss’s ass.",
            "responseText": "Meh. Tina’s tough. She’ll bounce back—or not. Either way, I’m still be here. Ain’t my first raid gone sideways, you know?",
            "followUpOptions": [
                {
                    "optionText": "You’re awfully chill for someone who might be out of a job.",
                    "responseText": "Oh no, what will I do without my prestigious career in raider whoring? Guess I’ll have to freelance."
                },
                {
                    "optionText": "Sounds like you’re not a big fan of Tina.",
                    "responseText": "Eh, she’s fine. Bossy, but at least she doesn’t hog all the caps. Or the chems."
                }
            ]
        },
        {
            "optionText": "How’d you end up in this life?",
            "responseText": "What, you mean the glamorous career path of raiding and slutting? Same way everyone else does—shitty upbringing and a healthy lack of self-respect. Got any other dumb questions?",
            "followUpOptions": [ 
                {
                    "optionText": "You ever think about quitting this life?",
                    "responseText": "Quitting? Ha! What for? So I can go be some farmer’s 'rad-tato wife'? No thanks. I’ll take my chances out here. At least the booze is free."
                },
                {
                    "optionText": "Maybe think about doing something else?",
                    "responseText": "What, like farming? Starting a family? Nah, I think I’ll stick with 'smoking and not dying today.' It’s working out so far."
                }
            ]
        }, 
        {
            "optionText": "How’s business here anyway? You guys raking in the caps or what?",
            "responseText": "Depends on how horny the caravan crowd is that week. Sometimes it’s great, sometimes you get stuck with cheapskates who think two bottle caps is a 'big tip.' Prostitution’s a real rollercoaster, y’know?"
        },
        {
            "optionText": "How much for your services?",
            "icon": "GUI/heart4",
            "responseText": "Oh, interested, are we? Alright, big spender. What’ll it be?",
            "followUpOptions": [
                {
                    "optionText": "Let’s keep it simple.",
                    "capsRequired": 220,
                    "failedCheckResponse": "Basic bitch, huh? Alright, 220 caps, step into the back and let’s get this over with. Don’t forget, no refunds.",
                    "responseText": "Basic bitch, huh? Alright, 220 caps, step into the back and let’s get this over with. Don’t forget, no refunds.",
                    "followUpOptions": [
                        {
                            "optionText": "Here are the caps.",  
                            "changeSprite": "Characters/Raider Slut/raider slut sex",
                            "newSpriteXPos": -0.22,
                            "newSpriteYPos": -0.61,
                            "closeDialogueOptions": true,
                            "isHEventStarted": true,  
                            "specialEffects": ["Blackout"],
                            "endingEffects": ["Flashes"],
                            "setBGcolor": "#D4D4D4",
                            "changeSpriteColor": "#FFFFFF",
                            "addPerk": "aids",
                            "progressionEventPlayed": "raider_slut_sex",
                            "spriteAtTheEndOfHscene": "Characters/Raider Slut/raider slut resized",
                            "spriteAtTheEndOfHscenePosition": [ -5.35, -2.22 ],
                            "emotionsDuringHevent": [ "Characters/Raider Slut/emotions/1", "Characters/Raider Slut/emotions/2", "Characters/Raider Slut/emotions/3", "Characters/Raider Slut/emotions/4", "Characters/Raider Slut/emotions/5", "Characters/Raider Slut/emotions/6" ],
                            "lineAfterHevent": "Mmm, ♥︎, show’s over, sugar. Now get dressed and scram. You’ve had your fun.", 
                            "hEventName": "PlayerSex_raider_slut",
                            "auto_lines": ["Oh, there it is. Not bad, not bad. I’ve seen bigger, but I’ve definitely seen worse. ♥︎",
                                            "Mmm, that’s the spirit. Just relax, honey, and let Smokey do her thing.",
                                            "Ahh, don’t get all handsy on me. You paid for this, not a personal cuddle session.",
                                            "Oh, yeah, right there. You like that, don’t you? ♥︎ Thought so.",
                                            "Mmm, you’ve got that 'I haven’t cumed in weeks' look. Let’s fix that, huh?",
                                            "Ahh, slow down, cowboy. We’ve got a whole... ten minutes to kill.",
                                            "Don’t take this the wrong way, but you’re like the tenth guy today. It’s a numbers game, y’know?",
                                            "Mmm, yeah, just like that. You’re not half-bad when you shut up.",
                                            "Ahh, you’re making me work for it, huh? Good thing I’ve got plenty of practice.",
                                            "Mmm, there we go. Bet you’ve been dreaming about this all week, haven’t you?",
                                            "This is officially the highlight of your week, isn’t it? Pathetic, but cute. ♥︎",
                                            "Oh, don’t start moaning too loud. I don’t need an audience out here.",
                                            "You owe me a cigarette after this. House rules.",
                                            "Mmm, yeah, take it slow, sweetheart. We’ve got... okay, not a lot of time, but still.",
                                            "Ahh, there’s the face I was waiting for. You’re welcome, by the way. ♥︎",
                                            "Hey, eyes up here. Just kidding—don’t care where you look.",
                                            "Alright, speed it up, cowboy. Time’s money, and you’re burning both.",
                                            "Oh, yeah, I feel that twitch. Come on, don’t be shy—let it out. ♥︎",
                                            "Next time, maybe throw in a tip, huh? Gotta fund my chem stash somehow.",
                                            "Mmm, there you go. Looks like someone needed this more than they let on.",
                                            "Ahh, don’t get too comfy, sugar. We’re not playing house after this.",
                                            "Mmm, ♥︎, you better be paying extra if you’re planning to go for round two.",
                                            "Ahh, ♥︎, that’s it, baby. You’re all talk until you’re not, huh?",
                                            "Mmm, ♥︎, I’ll give you a solid 7/10. Not bad, considering the competition.",
                                            "Oh, yeah, that’s nice. But let’s not forget—I’ve got better things to do than hold your hand.",
                                            "Mmm, ♥︎, you’re lucky I’m in a good mood. Usually, I charge more for this kind of energy.",
                                            "Ahh, ♥︎, don’t start getting all sentimental on me. We’re not writing a love story here.",
                                            "Mmm, ♥︎, alright, cowboy, time to wrap it up. Can’t keep the others waiting.",
                                            "Oh, ♥︎, there it is. Bet that felt good, huh? You’re welcome." ]
                        }
                    ]
                },
                {
                    "optionText": "How about a... blowjob?",
                    "capsRequired": 155,
                    "failedCheckResponse": "Blowjob, huh? 155 caps for that. I’d say it’s worth it—got plenty of practice.",
                    "responseText": "Blowjob, huh? 155 caps for that. I’d say it’s worth it—got plenty of practice.",
                    "followUpOptions": [
                        {
                            "optionText": "Here are the caps.",  
                            "changeSprite": "Characters/Raider Slut/blowjob_resized",
                            "newSpriteXPos": 0.86,
                            "newSpriteYPos": 0,
                            "closeDialogueOptions": true,
                            "isHEventStarted": true,  
                            "specialEffects": ["Blackout"],
                            "setBGcolor": "#D4D4D4",
                            "endingEffects": ["Flashes"],
                            "progressionEventPlayed": "raider_slut_blowjob", 
                            "spriteAtTheEndOfHscene": "Characters/Raider Slut/raider slut resized",
                            "spriteAtTheEndOfHscenePosition": [ -5.35, -2.22 ],
                            "emotionsDuringHevent": [ "none", "Characters/Raider Slut/emotions/blowjob/1", "Characters/Raider Slut/emotions/blowjob/2", "Characters/Raider Slut/emotions/blowjob/3" ],
                            "lineAfterHevent": "Ahh, ♥︎, there it is. Mmm, ♥︎, nice and warm. Bet that felt good, huh?", 
                            "hEventName": "blowjob_raider_slut",
                            "auto_lines": ["Mmm, ♥︎, let me see what I’m working with here. Hope you cleaned it first.",
                                            "Slurp Ahh, ♥︎, I can already tell this’ll be worth my time... and your caps.",
                                            "Mmm, ♥︎, don’t worry, I’m a professional. Got more practice than your average brahmin herder.",
                                            "Slurp Oh, ♥︎, that’s not bad at all. Guess today’s my lucky day.",
                                            "Mmm, ♥︎, just sit back and let Smokey Jo handle things. You’re in good hands... or mouth.",
                                            "Slurp Mmm, yeah, that’s the stuff. You’re already twitching, aren’t you?",
                                            "Ahh, ♥︎, you’re not gonna last long, are you? Don’t worry, happens to the best of ‘em.",
                                            "Slurp Mmm, ♥︎, you taste better than most caravaners. Not saying much, but still.",
                                            "Slurp Mmm, ♥︎, easy there, cowboy. You’re not running a sprint here—pace yourself.",
                                            "Oh, ♥︎, you’ve got that stupid grin already. I’m just getting started, sugar.",
                                            "Slurp Mmm, ♥︎, bet you thought this was gonna be quick, huh? Too bad, I like to savor my work.",
                                            "Ahh, ♥︎, relax. You’re paying me to take care of this, not make you do the heavy lifting.",
                                            "Mmm, ♥︎, that’s it, sugar. Don’t hold back. I’ve heard it all before.",
                                            "Slurp Oh, ♥︎, that’s cute. Trying to hold it in? Good luck with that.",
                                            "Mmm, ♥︎, you’re already shaking. What, hasn’t anyone taken care of you before?",
                                            "Slurp Mmm, ♥︎, slow down, big guy. We’ve got... well, not a lot of time, but still.",
                                            "Slurp Oh, ♥︎, you’re making this too easy. Not that I’m complaining.",
                                            "Mmm, ♥︎, there we go. Bet you’re loving every second of this, aren’t you?",
                                            "Mmm, ♥︎, you better not pop early. I hate when clients can’t keep up.",
                                            "Slurp Oh, ♥︎, there’s the face I was waiting for. You’re so predictable.",
                                            "Mmm, ♥︎, good thing you’re paying, because this ain’t a freebie, sweetheart.",
                                            "Slurp Ahh, ♥︎, yeah, you’re starting to squirm now. Just how I like it.",
                                            "Oh, ♥︎, don’t even think about tapping out yet. We’ve still got time.",
                                            "Slurp Mmm, ♥︎, you’re lucky I’m patient. Most guys fold like paper by now.",
                                            "Slurp Mmm, ♥︎, keep going, sugar. You’re making me work for it today.",
                                            "Ahh, ♥︎, there’s that twitch. Come on, don’t be shy—let it all out.",
                                            "Slurp Mmm, ♥︎, oh, you’re close, aren’t you? That face says it all.",
                                            "Mmm, ♥︎, yeah, just like that, sugar. Let me finish the job.",
                                            "Slurp Mmm, ♥︎, that’s it. Don’t hold back now—you’re paying for this, remember?" ]
                        }
                    ]
                }, 
                {
                    "optionText": "Actually, never mind.", 
                    "exitLine": true,
                    "responseText": "Pfft, tease. Get outta here before I charge you for wasting my time."
                }
            ]
        },
        {
            "optionText": "Bye.",
            "responseText": "Yeah, later. Don’t get eaten by a deathclaw or something.",
            "exitLine": true
        }
    ]
} 