{
  "options": [
    {
      "optionText": "Você não parece muito preocupada por eu ter acabado de chutar o traseiro da sua chefe.",
      "responseText": "Meh. A Tina é durona. Ela vai se recuperar — ou não. De qualquer forma, ainda estarei aqui. Não é meu primeiro ataque que dá errado, sabe?",
      "followUpOptions": [
        {
          "optionText": "Você está bem tranquila para alguém que pode ficar sem emprego.",
          "responseText": "Oh não, o que farei sem minha prestigiosa carreira de prostituta saqueadora? Acho que terei que ser freelancer."
        },
        {
          "optionText": "Parece que você não é muito fã da Tina.",
          "responseText": "Eh, ela é ok. Mandona, mas pelo menos não fica com todas as tampinhas. Ou as drogas."
        }
      ]
    },
    {
      "optionText": "Como você acabou nesta vida?",
      "responseText": "O quê, você quer dizer a glamorosa carreira de saquear e ser puta? Do mesmo jeito que todo mundo — criação de merda e uma saudável falta de amor-próprio. Tem mais alguma pergunta idiota?",
      "followUpOptions": [
        {
          "optionText": "Você já pensou em largar essa vida?",
          "responseText": "Largar? Ha! Para quê? Para eu virar a 'esposa rad-tato' de algum fazendeiro? Não, obrigada. Prefiro arriscar aqui. Pelo menos a bebida é de graça."
        },
        {
          "optionText": "Talvez pensar em fazer outra coisa?",
          "responseText": "O quê, tipo agricultura? Começar uma família? Nah, acho que vou ficar com 'fumar e não morrer hoje'. Está funcionando até agora."
        }
      ]
    },
    {
      "optionText": "Como estão os negócios por aqui? Vocês estão ganhando muitas tampinhas ou o quê?",
      "responseText": "Depende do quão tarada a galera da caravana está naquela semana. Às vezes é ótimo, às vezes você pega uns pão-duros que acham que duas tampinhas é uma 'gorjeta grande'. A prostituição é uma montanha-russa, sabe?"
    },
    {
      "optionText": "Quanto pelos seus serviços?",
      "icon": "GUI/heart4",
      "responseText": "Oh, interessado, é? Certo, ricaço. O que vai ser?",
      "followUpOptions": [
        {
          "optionText": "Vamos manter simples.",
          "capsRequired": 220,
          "failedCheckResponse": "Básica, hein? Certo, 220 tampinhas, entre nos fundos e vamos acabar logo com isso. Não esqueça, sem reembolsos.",
          "responseText": "Básica, hein? Certo, 220 tampinhas, entre nos fundos e vamos acabar logo com isso. Não esqueça, sem reembolsos.",
          "followUpOptions": [
            {
              "optionText": "Aqui estão as tampinhas.",
              "changeSprite": "Characters/Raider Slut/raider slut sex",
              "newSpriteXPos": -0.22,
              "newSpriteYPos": -0.61,
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "specialEffects": ["Blackout"],
              "endingEffects": ["Flashes"],
              "setBGcolor": "#D4D4D4",
              "changeSpriteColor": "#FFFFFF",
              "addPerk": "aids",
              "progressionEventPlayed": "raider_slut_sex",
              "spriteAtTheEndOfHscene": "Characters/Raider Slut/raider slut resized",
              "spriteAtTheEndOfHscenePosition": [-5.35, -2.22],
              "emotionsDuringHevent": [
                "Characters/Raider Slut/emotions/1",
                "Characters/Raider Slut/emotions/2",
                "Characters/Raider Slut/emotions/3",
                "Characters/Raider Slut/emotions/4",
                "Characters/Raider Slut/emotions/5",
                "Characters/Raider Slut/emotions/6"
              ],
              "lineAfterHevent": "Mmm, ♥︎, o show acabou, docinho. Agora se vista e vaza. Você já se divertiu.",
              "hEventName": "PlayerSex_raider_slut",
              "auto_lines": [
                "Oh, aí está. Nada mal, nada mal. Já vi maiores, mas com certeza já vi piores. ♥︎",
                "Mmm, esse é o espírito. Apenas relaxe, querido, e deixe a Smokey fazer o trabalho dela.",
                "Ahh, não venha com mão boba pra cima de mim. Você pagou por isso, não por uma sessão de carinho pessoal.",
                "Oh, sim, bem aí. Você gosta disso, não gosta? ♥︎ Imaginei.",
                "Mmm, você tem aquela cara de 'não gozo há semanas'. Vamos consertar isso, hein?",
                "Ahh, vá com calma, cowboy. Temos uns... dez minutos inteiros para matar.",
                "Não leve para o lado pessoal, mas você é tipo o décimo cara hoje. É um jogo de números, sabe?",
                "Mmm, sim, desse jeito. Você não é tão ruim quando cala a boca.",
                "Ahh, você está me fazendo trabalhar por isso, hein? Ainda bem que tenho muita prática.",
                "Mmm, aí vamos nós. Aposto que você sonhou com isso a semana toda, não foi?",
                "Este é oficialmente o ponto alto da sua semana, não é? Patético, mas fofo. ♥︎",
                "Oh, não comece a gemer muito alto. Não preciso de uma plateia aqui.",
                "Você me deve um cigarro depois disso. Regras da casa.",
                "Mmm, sim, vá com calma, docinho. Temos... ok, não muito tempo, mas ainda assim.",
                "Ahh, aí está a cara que eu estava esperando. De nada, a propósito. ♥︎",
                "Ei, olhos aqui em cima. Brincadeira — não me importo para onde você olha.",
                "Certo, acelera aí, cowboy. Tempo é dinheiro, e você está queimando ambos.",
                "Oh, sim, sinto essa contração. Vamos, não seja tímido — solte tudo. ♥︎",
                "Da próxima vez, talvez jogue uma gorjeta, hein? Tenho que financiar meu estoque de drogas de alguma forma.",
                "Mmm, aí está. Parece que alguém precisava disso mais do que admitia.",
                "Ahh, não fique muito à vontade, docinho. Não vamos brincar de casinha depois disso.",
                "Mmm, ♥︎, é melhor você pagar extra se estiver planejando ir para o segundo round.",
                "Ahh, ♥︎, é isso, querido. Você é só conversa até não ser mais, hein?",
                "Mmm, ♥︎, vou te dar um sólido 7/10. Nada mal, considerando a concorrência.",
                "Oh, sim, isso é bom. Mas não vamos esquecer — tenho coisas melhores para fazer do que segurar sua mão.",
                "Mmm, ♥︎, você tem sorte de eu estar de bom humor. Normalmente, cobro mais por esse tipo de energia.",
                "Ahh, ♥︎, não comece a ficar sentimental comigo. Não estamos escrevendo uma história de amor aqui.",
                "Mmm, ♥︎, certo, cowboy, hora de terminar. Não posso deixar os outros esperando.",
                "Oh, ♥︎, aí está. Aposto que foi bom, hein? De nada."
              ]
            }
          ]
        },
        {
          "optionText": "Que tal um... boquete?",
          "capsRequired": 155,
          "failedCheckResponse": "Boquete, hein? 155 tampinhas por isso. Eu diria que vale a pena — tenho muita prática.",
          "responseText": "Boquete, hein? 155 tampinhas por isso. Eu diria que vale a pena — tenho muita prática.",
          "followUpOptions": [
            {
              "optionText": "Aqui estão as tampinhas.",
              "changeSprite": "Characters/Raider Slut/blowjob_resized",
              "newSpriteXPos": 0.86,
              "newSpriteYPos": 0,
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "specialEffects": ["Blackout"],
              "setBGcolor": "#D4D4D4",
              "endingEffects": ["Flashes"],
              "progressionEventPlayed": "raider_slut_blowjob",
              "spriteAtTheEndOfHscene": "Characters/Raider Slut/raider slut resized",
              "spriteAtTheEndOfHscenePosition": [-5.35, -2.22],
              "emotionsDuringHevent": [
                "none",
                "Characters/Raider Slut/emotions/blowjob/1",
                "Characters/Raider Slut/emotions/blowjob/2",
                "Characters/Raider Slut/emotions/blowjob/3"
              ],
              "lineAfterHevent": "Ahh, ♥︎, aí está. Mmm, ♥︎, bom e quentinho. Aposto que foi bom, hein?",
              "hEventName": "blowjob_raider_slut",
              "auto_lines": [
                "Mmm, ♥︎, deixa eu ver com o que estou trabalhando aqui. Espero que você tenha limpado primeiro.",
                "Chup Ahh, ♥︎, já posso dizer que vai valer meu tempo... e suas tampinhas.",
                "Mmm, ♥︎, não se preocupe, sou profissional. Tenho mais prática que o seu criador de brahmin médio.",
                "Chup Oh, ♥︎, nada mal. Acho que hoje é meu dia de sorte.",
                "Mmm, ♥︎, apenas sente-se e deixe a Smokey Jo cuidar das coisas. Você está em boas mãos... ou boca.",
                "Chup Mmm, sim, é disso que eu gosto. Você já está se contorcendo, não está?",
                "Ahh, ♥︎, você não vai durar muito, vai? Não se preocupe, acontece com os melhores.",
                "Chup Mmm, ♥︎, você tem um gosto melhor que a maioria dos caravaneiros. Não quer dizer muito, mas ainda assim.",
                "Chup Mmm, ♥︎, calma aí, cowboy. Você não está correndo uma maratona aqui — vá com calma.",
                "Oh, ♥︎, você já está com aquele sorrisinho estúpido. Estou apenas começando, docinho.",
                "Chup Mmm, ♥︎, aposto que você pensou que ia ser rápido, hein? Pena, gosto de saborear meu trabalho.",
                "Ahh, ♥︎, relaxe. Você está me pagando para cuidar disso, não para fazer o trabalho pesado.",
                "Mmm, ♥︎, é isso, docinho. Não se segure. Já ouvi de tudo.",
                "Chup Oh, ♥︎, que fofo. Tentando segurar? Boa sorte com isso.",
                "Mmm, ♥︎, você já está tremendo. O quê, ninguém nunca cuidou de você antes?",
                "Chup Mmm, ♥︎, vá com calma, grandão. Temos... bem, não muito tempo, mas ainda assim.",
                "Chup Oh, ♥︎, você está tornando isso fácil demais. Não que eu esteja reclamando.",
                "Mmm, ♥︎, aí vamos nós. Aposto que você está amando cada segundo disso, não está?",
                "Mmm, ♥︎, é melhor você não gozar cedo. Odeio quando os clientes não conseguem acompanhar.",
                "Chup Oh, ♥︎, aí está a cara que eu estava esperando. Você é tão previsível.",
                "Mmm, ♥︎, ainda bem que você está pagando, porque isso não é de graça, docinho.",
                "Chup Ahh, ♥︎, sim, você está começando a se contorcer agora. Do jeito que eu gosto.",
                "Oh, ♥︎, nem pense em desistir ainda. Ainda temos tempo.",
                "Chup Mmm, ♥︎, você tem sorte de eu ser paciente. A maioria dos caras desiste como papel a essa altura.",
                "Chup Mmm, ♥︎, continue, docinho. Você está me fazendo trabalhar hoje.",
                "Ahh, ♥︎, aí está aquela contração. Vamos, não seja tímido — solte tudo.",
                "Chup Mmm, ♥︎, oh, você está perto, não está? Essa cara diz tudo.",
                "Mmm, ♥︎, sim, desse jeito, docinho. Deixa eu terminar o trabalho.",
                "Chup Mmm, ♥︎, é isso. Não se segure agora — você está pagando por isso, lembra?"
              ]
            }
          ]
        },
        {
          "optionText": "Na verdade, deixa pra lá.",
          "exitLine": true,
          "responseText": "Pfft, provocador. Dá o fora daqui antes que eu te cobre por desperdiçar meu tempo."
        }
      ]
    },
    {
      "optionText": "Tchau.",
      "responseText": "Sim, até mais. Não seja comido por um Deathclaw ou algo assim.",
      "exitLine": true
    }
  ]
}
