{
  "options": [
    {
      "optionText": "Uh... quem é você?",
      "responseText": "Mmm... Ah, eu? Sou apenas mais uma vítima do seu pequeno... 'programa de alívio de tensão'. O quê, não esperava que suas revistas funcionassem tão bem? ♥︎",
      "followUpOptions": [
        {
          "optionText": "Espera, *eu* fiz isso? Você está aqui por causa do contrabando?",
          "responseText": "Oh, docinho, você incendiou o refúgio inteiro com essa merda! Agora, todo mundo está escondido em seus quartos ou fazendo... *isso* onde quer que possam. ♥︎"
        },
        {
          "optionText": "Uh, não era *exatamente* isso que eu tinha em mente...",
          "responseText": "Oh, confie em mim, está funcionando perfeitamente. A tensão está alta, querido, e esta xoxota precisa aliviar um pouco a pressão."
        }
      ]
    },
    {
      "optionText": "Você está falando sério, batendo uma bem ao lado do bicho-papão?",
      "responseText": "Mmm... Você acha que ele se importa? Ele já viu coisa pior. Além disso, nunca se sabe o que ele tem nas calças...",
      "followUpOptions": [
        {
          "optionText": "Você percebe que ele provavelmente tem um pau cheio de doenças, certo?",
          "responseText": "Ah, por favor, um pouco de risco torna tudo mais... emocionante."
        }
      ]
    },
    {
      "optionText": "Precisa de uma mão? Parece que você está com dificuldade para... terminar.",
      "responseText": "Mmm, você é fofo. Mas não. Esta é uma missão solo. Não preciso de um copiloto para pousar esta nave.",
      "followUpOptions": [
        {
          "optionText": "Tem certeza? Você parece que vai desistir.",
          "responseText": "Mmm, confie em mim, estou bem. ♥︎"
        },
        {
          "optionText": "Vamos lá, todo mundo precisa de um pouco de ajuda às vezes.",
          "responseText": "Docinho, esta xoxota é uma operação de uma mulher só. Sou mais do que capaz de lidar com minha própria... tensão. ♥︎"
        }
      ]
    }
  ],
  "auto_lines": [
    "Ahh, sim... dedos fundos na minha xoxota, que delícia...",
    "Porra, sim... faz muito tempo... sucos escorrendo pelas minhas coxas, do jeito que eu gosto...",
    "Sim, sim... continue... dedos trabalhando nesse clitóris... Deus, estou tão molhada...",
    "Vou gozar, vou gozar... aqui mesmo neste refúgio estúpido, e não há nada que eles possam fazer para me impedir...",
    "Mmm, queria poder encontrar alguém com um pau de verdade, mas isso vai ter que servir...",
    "Ugh, tão perto... porra, vou gritar quando gozar, não me importo com quem ouça...",
    "Quase lá... Deus, vou encharcar a cama...",
    "Mmm, minha xoxota está com tanta fome disso... queria poder encontrar alguém para me encher...",
    "Ahh, porra, tão perto... vou gozar, vou gozar, não posso parar agora...",
    "Sim, sim, sim... oh, porra, está vindo... vou gozar tanto...",
    "Quase lá... oh Deus, sim... lá vem, vou encharcar esses lençóis...",
    "Porra, porra, PORRA... gozando, oh Deus, gozando... ahhhh ♥♥♥..."
  ]
}
