{
  "options": [
    {
      "optionText": "Você está bem? As cordas parecem apertadas.",
      "responseText": "V-você acha que é a minha primeira vez aqui? Eles me penduraram duas vezes esta semana já. Desde que encontrei uma daquelas revistas pornô, minha xoxota tem doído sem parar. Eu ainda gozei pra caralho quando ela me açoitou agora mesmo...",
      "followUpOptions": [
        {
          "optionText": "Você realmente gozou? Com a chicotada?",
          "responseText": "Eu tentei não... mas quando ela me chamou de vadia e me bateu bem no clitóris — eu explodi. Minhas pernas tremeram tanto que eu mijei nas minhas coxas. Sou uma cadela doente por amar isso?",
          "followUpOptions": [
            {
              "optionText": "Você ainda está pingando.",
              "responseText": "Não consigo parar. Minha xoxota está latejando. Toda vez que eu contraio, sinto a ardência das chibatadas. Me dá vontade de esfregar meu clitóris no ar. Você já esteve tão desesperado?"
            },
            {
              "optionText": "Você quer que eu te ajude a terminar?",
              "responseText": "Não me provoque. Não posso gozar de novo até meu próximo julgamento. Mas se você me tocasse agora, mesmo que só com a ponta do dedo... eu jorraria na sua mão."
            }
          ]
        },
        {
          "optionText": "Aquela oficial realmente te maltratou.",
          "responseText": "Ela sabe exatamente onde bater. E quando ela se inclinou para sussurrar, 'Gema para mim, puta faminta por porra', eu não consegui me segurar. Meu corpo me traiu na frente de todo mundo. Mas foi tão bom."
        },
        {
          "optionText": "Eles te deixam pendurada aqui a noite toda?",
          "responseText": "Às vezes. Da última vez, me deixaram aqui até o sino do café da manhã. As pessoas passavam com bandejas, fingindo não olhar. Eu estava vazando pelas pernas o tempo todo, implorando para alguém me tocar. Eles não tocaram. Um cara apenas sussurrou 'vadia' e sorriu.",
          "followUpOptions": [
            {
              "optionText": "E você amou cada segundo.",
              "responseText": "Gozei três vezes antes do meio-dia. Ninguém nem notou a poça debaixo de mim. Ou talvez notaram, e ninguém se importou. E honestamente? Isso só tornou tudo mais quente."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Foi você que estava fazendo aquilo nos chuveiros? Você sabia que eles te pegariam.",
      "responseText": "Eu não aguentava mais. Não gozava há semanas. Meus mamilos doíam de tão sensíveis. Então eu enfiei meus dedos na minha xoxota e fui com tudo. Nem ouvi as câmeras de pureza ligarem... estava ocupada demais me masturbando como um animal do caralho.",
      "followUpOptions": [
        {
          "optionText": "E quando te pegaram?",
          "responseText": "Eles me fizeram terminar antes de me arrastar para fora. Disseram que era 'coleta de provas'. Um deles lambeu meus dedos e me disse que eu tinha gosto de puta. Agora estou aqui, pingando na frente de todo mundo como uma porca de criação defeituosa."
        },
        {
          "optionText": "Você realmente não podia esperar, hein?",
          "responseText": "Eu não me importava. Queria gozar tanto que teria feito isso na mesa do Supervisor. Deixem todos assistirem eu gritar entre dentes cerrados e encharcar o chão. Eu queria ser arruinada por um pau."
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Não vá. Por favor. Fique só mais um pouco. Estou tão perto... não quero ficar sozinha com essa dor de novo.",
      "exitLine": true
    }
  ],
  "showShadowFigures": "Watching crowd"
}
