{
  "options": [
    {
      "optionText": "Você vai conseguir olhar para ursos da mesma forma de novo?",
      "onlyShowIfProgressionEventPlayed": "rescuedBearFuckedWastelander",
      "exitLine": true,
      "fadeOutCharacter": true,
      "responseText": "Olha, cara… eu costumava colecionar ursinhos de pelúcia quando era criança. Tinha uma prateleira inteira daquelas porras. Agora? Toda vez que vejo um, eu me contraio instintivamente. A infância acabou, ok?"
    },
    {
      "optionText": "Puta merda... Que porra é essa?!",
      "dontShowIfProgressionEventPlayed": "rescuedBearFuckedWastelander",
      "responseText": "ARGH! ESTE YAO GUAI DO CARALHO ESTÁ TRANSFORMANDO MEU CU NA SUA CAVERNA PESSOAL! ATIRE NELE! TIRE ELE DE MIM!!",
      "followUpOptions": [
        {
          "optionText": "Como é ser fodido por um Yao Guai?",
          "responseText": "HA HA. HILÁRIO. MEU CU ESTÁ SENDO ALARGADO ATÉ NEW VEGAS E DE VOLTA. PARE DE FAZER PERGUNTAS ESTÚPIDAS E ATIRE NESSE DESGRAÇADO TARADO!"
        },
        {
          "optionText": "[Atirar no Yao Guai]",
          "responseText": "OH MERDA, OBRIGADO. OBRIGADO. Ugh… oh Deus… consigo sentir a porra dele vazando… foda-se a minha vida. Só… não conte a ninguém que você viu isso.",
          "progressionEventPlayed": "rescuedBearFuckedWastelander",
          "changeSprite": "Characters/Other characters/rape victim",
          "newSpriteXPos": -6.46,
          "newSpriteYPos": -1.5,
          "playSound": "Sounds/combat/monsters/bear shot",
          "specialEffects": ["Punch"],
          "followUpOptions": [
            {
              "optionText": "Você vai ficar bem?",
              "responseText": "Bem? Minhas entranhas estão como ovos mexidos agora. Pegue essas tampinhas antes que eu comece a chorar.",
              "followUpOptions": [
                {
                  "optionText": "Obrigado. Tente não ser estuprado pela vida selvagem de novo.",
                  "responseText": "Sim, obrigado pelo conselho de vida. Agora, se me dá licença, vou pegar uma cerveja.",
                  "addCaps": 40,
                  "fadeOutCharacter": true,
                  "exitLine": true
                },
                {
                  "optionText": "Fique com suas tampinhas. Compre uma cueca nova.",
                  "responseText": "...Sério? Caramba… você é uma pessoa melhor do que eu pensava. Ou só está com nojo. De qualquer forma, obrigado.",
                  "exitLine": true,
                  "fadeOutCharacter": true
                }
              ]
            }
          ]
        },
        {
          "optionText": "Eu poderia simplesmente te deixar aqui, sabe.",
          "responseText": "POR FAVOR, NÃO! NÃO QUERO MORRER COM UM PAU DE URSO NO MEU CÓLON! POR FAVOR, EU FAÇO QUALQUER COISA. SÓ ME AJUDE!"
        }
      ]
    }
  ],
  "auto_lines": [
    "AHHHH MERDA, ESTÁ DENTRO DE MIM! DEUS ME AJUDE! EU NÃO ME INSCREVI PARA ESSA PORRA DE PUTARIA FURRY!",
    "OH DEUS, ESTÁ GOZANDO. POR FAVOR, ALGUÉM ME DÊ UM TIRO OU NELE!",
    "AHHHH—É TÃO GRANDE, ESTÁ REARRANJANDO MEUS ÓRGÃOS! AJUDA! AJUDA!!!"
  ]
}
