{
    "options": [
        {
            "optionText": "[Report her to the Purity Police]",
            "responseText": "Whoa, seriously?!" 
        }
    ],
    "auto_lines_ending__special_effects": ["Flashes"],
    "showShadowFigures": "Lounge ending orgy",
    "dontShowCharacters": true,
    "auto_lines": ["Oh, look at all those hard dicks just waiting to get a taste of this tight pussy. Who's first? ♥",
    "Mmm, don't be shy, boys. Let's see if you can make me cum. Aghh!",
    "Ahhh, that's it... right there. You know how to use that cock, don't you? Hmmm.",
    "Oh, fuck yes! I’ve never felt so wet. Keep going, don’t stop now!",
    "Hmmm, one in the pussy, one in the butthole, and still room for more. Who's next?",
    "Let those juices flow, boys. Let's see how long you can last in this!",
    "Hmmm, harder! Show me what that big dick can do, make me scream!",
    "Ahh, I’m dripping... can you all see this? This is what a real woman looks like.",
    "Oh, fuck, yes! Fill me up, I want to feel every drop of that sweet cum!",
    "Mmm, so many dicks, so little time. You’ll all get your turn, don’t worry.",
    "Yes! Keep fucking me like that, make me forget where I am... Aghh!",
    "Hmmm, this pussy is hungry for more... who’s ready to feed it next?",
    "Ohh, so tight... so wet... I’m loving every second of this!",
    "Come on, show me what those muscles can do... I want to feel you deep inside.",
    "Mmm, dripping wet, and it's all for you, boys... who’s going to make me scream next?",
    "Ahh, don’t hold back! I want to hear those grunts as you fill me with cum!",
    "Fuck, yes! This is what the vault needs... a little more fun, a little less bullshit!",
    "Oh, hmmm... every inch of me is yours, just take it, take it all!",
    "Let’s see if you can make me squirt all over the place... come on, harder!",
    "Ahhh, I want every hole filled, every inch of me covered in your cum!", 
    "Ahhh, don’t stop now! I want every inch of that dick in my pussy, all the way, oh yes!",
    "This is what real pleasure looks like!", 
    "Oh, fuck, yes! My juices are flowing like a damn river—who wants a swim?",
    "Come on, give me that thick cum!",
    "Ohhh, yeah, right there! Do it like it’s your last chance before they bonk you!",
    "Mmm, that’s it, fill me up! Ohh, yes!",
    "I’m so close, just like every guy in here watching! Don’t worry, I’ll make sure you get there with me ♥",
    "Ohhh, your butthole looks so tight—wanna see how good I am at multitasking?",
    "Mmmm, you think they’ll install more Shame Chambers after this? 'Cause I think we’re gonna need them!",
    "Hmmm, maybe the Purity Police should join in? They’ve been watching for so long, might as well participate!",
    "Aghh, fuck, you feel that? That’s what they call ‘teamwork’ in Vault 6969!",
    "Ohhh, let’s make a splash—literally! I want to be soaking in your cum!",  
    "Hmmm, why don’t we invite everyone watching to join? Let’s make this a vault-wide event!",
    "Ohhh, keep going! We’re gonna set a new productivity record with this one!",
    "Aghhh, don’t stop until the whole vault is as wet as I am!", 
    "So much cum... hmmm, I could make a smoothie out of it! You boys have been saving up, haven’t you? *slurp*",
    "Ahh, it feels like I’m swimming in a sea of dicks! And you know what? I’m not complaining one bit! ♥",
    "Oh, god! Keep fucking me, I want to pass out from pleasure! Make my eyes roll back and my toes curl, oh yes!",
    "I’m your vault goddess! Worship me with your cocks! Fill me up until I’m dripping with your love. Ahh!"]
}
