{
    "options": [
      {
        "optionText": "You okay? The ropes look tight.",
        "responseText": "Y-you think this is my first time here? They've strung me up twice this week already. Ever since I found one of those porn magazines, my cunt’s been aching nonstop. I still fucking came when she whipped me just now...",
        "followUpOptions": [
          {
            "optionText": "You actually came? From the whipping?",
            "responseText": "I tried not to... but when she called me a slut and hit me right on the clit—I fucking exploded. My legs shook so hard I pissed down my thighs. Am I a sick bitch for loving it?",
            "followUpOptions": [
              {
                "optionText": "You're still dripping.",
                "responseText": "I can’t stop. My pussy’s throbbing. Every time I clench, I feel the sting of the lashes. It makes me wanna rub my clit against the air. You ever been this desperate?"
              },
              {
                "optionText": "You want me to help you finish?",
                "responseText": "Don’t tease me. I'm not allowed to cum again until my next trial. But if you touched me right now, even just a fingertip… I'd gush all over your hand."
              }
            ]
          },
          {
            "optionText": "That officer really worked you over.",
            "responseText": "She knows exactly where to hit. And when she leaned in to whisper, 'Moan for me, cum-hungry whore,' I couldn't hold back. My body betrayed me in front of everyone. But it felt so fucking good."
          },
          {
            "optionText": "They leave you hanging here overnight?",
            "responseText": "Sometimes. Last time they left me up until the breakfast bell. People walked by with trays, pretending not to stare. I was leaking down my legs the whole time, begging for someone to touch me. They didn’t. One guy just whispered 'slut' and smiled.",
            "followUpOptions": [
              {
                "optionText": "And you loved every second of it.",
                "responseText": "I came three times before noon. No one even noticed the puddle under me. Or maybe they did, and no one cared. And honestly? That just made it hotter."
              }
            ]
          }
        ]
      },
      {
        "optionText": "You were the one doing it in the showers? You knew they'd catch you.",
        "responseText": "I couldn’t take it anymore. I hadn’t cum in weeks. My nipples hurt from how sensitive they were. So I slipped my fingers in my pussy and went full on. I didn’t even hear the purity cams click on... I was too busy fingering like a goddamn animal.",
        "followUpOptions": [
          {
            "optionText": "And when they caught you?",
            "responseText": "They made me finish before dragging me out. Said it was 'evidence collection.' One of them licked my fingers and told me I tasted like whore. Now I’m up here, dripping in front of everyone like a defective breeding sow."
          },
          {
            "optionText": "You really couldn’t wait, huh?",
            "responseText": "I didn’t care. I wanted to cum so bad I’d have done it on the Overseer’s desk. Let them all watch me scream through clenched teeth and soak the tiles. I wanted to be ruined by a dick."
          }
        ]
      },
      {
        "optionText": "Bye",
        "responseText": "Don’t go. Please. Just stay a little longer. I’m so fucking close… I don’t want to be alone with this ache again.",
        "exitLine": true
      }
    ],
    "showShadowFigures": "Watching crowd"
}  