{
  "options": [
    {
      "optionText": "Eu convenci os oficiais a te exilar.",
      "onlyShowIfProgressionEventPlayed": "chose_to_exile_pregnant_vault_dweller",
      "responseText": "Claro que convenceu. Você me olhou nos olhos, viu esta barriga, e ainda me jogou fora como lixo. Espero que as tempestades de radiação me comam mais rápido do que sua culpa. Some da minha frente.",
      "exitLine": true
    },
    {
      "optionText": "Eu convenci os oficiais a deixar você ficar.",
      "onlyShowIfProgressionEventPlayed": "chose_to_spare_pregnant_vault_dweller",
      "responseText": "Espera... você fez? Mesmo? Achei que estava acabada. Obrigada. Sério. Isso significa mais do que você provavelmente imagina.",
      "followUpOptions": [
        {
          "optionText": "Sim. Talvez você mereça uma segunda chance.",
          "responseText": "Não sei como será o amanhã, mas hoje... sinto que posso respirar de novo. Obrigada por isso."
        },
        {
          "optionText": "Não fique muito grata. Você ainda está sob vigilância.",
          "responseText": "Eu entendo. Regras são regras. Mas vou provar que ainda posso fazer parte deste lugar. Não vou desistir."
        }
      ]
    },
    {
      "optionText": "Eles estão me perguntando se acho que você deveria ser exilada.",
      "onlyShowIfProgressionEventPlayed": "chose_to_interrogate_pregnant_vault_dweller",
      "responseText": "Sim. Parece plausível. É mais fácil transformar as pessoas em problemas do que realmente entendê-las. Então... o que você acha?",
      "followUpOptions": [
        {
          "optionText": "Eles dizem que você deixou alguém gozar em você. É verdade?",
          "responseText": "Sim. Aconteceu. E não, não foi estupro. Eu quis. Eu queria sentir algo. Só uma vez. Não esperava que levasse a isso... mas não tenho vergonha de ser humana."
        },
        {
          "optionText": "Eu poderia dizer a eles que você merece ficar. Talvez você crie a criança em paz.",
          "responseText": "Isso parece um sonho. Não espero caridade — mas se você realmente acredita em dar uma chance às pessoas, obrigada."
        },
        {
          "optionText": "Eu poderia dizer a eles que você é uma ofensa ambulante. Você estaria fora ao pôr do sol.",
          "responseText": "Então pelo menos eu saberia. Pelo menos eu pararia de esperar que alguém aqui ainda tivesse um coração. Se vou ser julgada, apenas diga na minha cara. Não vou fugir do que fiz."
        }
      ]
    },
    {
      "optionText": "Você está bem?",
      "responseText": "Eu pareço bem? Eles me arrastaram para fora do meu beliche, me fizeram tirar a roupa e me marcharam para cá como gado. Todo mundo olha como se eu tivesse feito algo imperdoável. Só estou tentando me manter firme.",
      "followUpOptions": [
        {
          "optionText": "Quem foi? O pai.",
          "responseText": "Você não adoraria saber? Talvez tenha sido alguém como você — fingindo ser limpo, batendo uma nos chuveiros. Ou talvez tenha sido um dos oficiais.",
          "followUpOptions": [
            {
              "optionText": "Você não vai contar a ninguém?",
              "responseText": "Não a menos que alguém realmente me pergunte sem um cassetete de choque na mão. Não a menos que alguém me trate como uma pessoa. Prefiro apodrecer a dar o nome dele enquanto estou presa nesta cadeira como uma porca."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Sim. Apenas vá embora. Como todo mundo fez quando começou a aparecer. Só... não se esqueça que ainda sou uma de vocês. Não deixei de ser uma pessoa quando engravidei.",
      "exitLine": true
    }
  ]
}
