{
  "options": [
    {
      "optionText": "[Denunciá-la para a Polícia da Pureza]",
      "responseText": "Opa, sério?!"
    }
  ],
  "auto_lines_ending__special_effects": ["Flashes"],
  "showShadowFigures": "Lounge ending orgy",
  "dontShowCharacters": true,
  "auto_lines": [
    "Oh, olhem todos esses paus duros só esperando para provar esta xoxota apertada. Quem é o primeiro? ♥",
    "Mmm, não sejam tímidos, rapazes. Vamos ver se conseguem me fazer gozar. Aghh!",
    "Ahhh, é isso... bem aí. Você sabe usar esse pau, não sabe? Hmmm.",
    "Oh, porra, sim! Nunca me senti tão molhada. Continue, não pare agora!",
    "Hmmm, um na xoxota, um no cu, e ainda tem espaço para mais. Quem é o próximo?",
    "Deixem esses sucos fluírem, rapazes. Vamos ver quanto tempo vocês aguentam nisso!",
    "Hmmm, mais forte! Mostre-me o que esse pau grande pode fazer, me faça gritar!",
    "Ahh, estou pingando... vocês todos podem ver isso? É assim que uma mulher de verdade se parece.",
    "Oh, porra, sim! Me encha, quero sentir cada gota dessa doce porra!",
    "Mmm, tantos paus, tão pouco tempo. Todos vocês terão sua vez, não se preocupem.",
    "Sim! Continue me fodendo assim, me faça esquecer onde estou... Aghh!",
    "Hmmm, esta xoxota está com fome de mais... quem está pronto para alimentá-la a seguir?",
    "Ohh, tão apertado... tão molhado... estou amando cada segundo disso!",
    "Vamos, mostre-me o que esses músculos podem fazer... quero te sentir bem fundo.",
    "Mmm, pingando de molhada, e é tudo para vocês, rapazes... quem vai me fazer gritar a seguir?",
    "Ahh, não se segure! Quero ouvir esses grunhidos enquanto você me enche de porra!",
    "Porra, sim! É disso que o refúgio precisa... um pouco mais de diversão, um pouco menos de besteira!",
    "Oh, hmmm... cada centímetro de mim é seu, apenas pegue, pegue tudo!",
    "Vamos ver se você consegue me fazer esguichar por todo o lugar... vamos, mais forte!",
    "Ahhh, quero todos os buracos preenchidos, cada centímetro de mim coberto pela sua porra!",
    "Ahhh, não pare agora! Quero cada centímetro desse pau na minha xoxota, até o fundo, oh sim!",
    "Isto é o que o prazer de verdade parece!",
    "Oh, porra, sim! Meus sucos estão fluindo como um rio — quem quer um mergulho?",
    "Vamos, me dê essa porra grossa!",
    "Ohhh, sim, bem aí! Faça como se fosse sua última chance antes que te deem um 'bonk'!",
    "Mmm, é isso, me encha! Ohh, sim!",
    "Estou quase lá, assim como todo cara aqui assistindo! Não se preocupem, vou garantir que vocês cheguem lá comigo ♥",
    "Ohhh, seu cuzinho parece tão apertado — quer ver como sou boa em multitarefa?",
    "Mmmm, vocês acham que eles vão instalar mais Câmaras da Vergonha depois disso? Porque acho que vamos precisar!",
    "Hmmm, talvez a Polícia da Pureza devesse participar? Eles estão observando há tanto tempo, podiam muito bem participar!",
    "Aghh, porra, sentiu isso? É o que eles chamam de 'trabalho em equipe' no Refúgio 6969!",
    "Ohhh, vamos fazer barulho — literalmente! Quero ficar encharcada na sua porra!",
    "Hmmm, por que não convidamos todos que estão assistindo para se juntar? Vamos fazer disso um evento de todo o refúgio!",
    "Ohhh, continue! Vamos estabelecer um novo recorde de produtividade com esta!",
    "Aghhh, não pare até que todo o refúgio esteja tão molhado quanto eu!",
    "Tanta porra... hmmm, eu poderia fazer um smoothie com isso! Vocês guardaram bastante, não é? *chup*",
    "Ahh, parece que estou nadando em um mar de paus! E sabe de uma coisa? Não estou reclamando nem um pouco! ♥",
    "Oh, Deus! Continue me fodendo, quero desmaiar de prazer! Faça meus olhos revirarem e meus dedos dos pés se curvarem, oh sim!",
    "Eu sou sua deusa do refúgio! Me adorem com seus paus! Me encham até eu ficar pingando com seu amor. Ahh!"
  ]
}
