{
    "options": [
        {
            "optionText": "Is this the final push?",
            "responseText": "Final push? This is the climax, bro! The vault’s wound up tighter than a pre-war vault jumpsuit after Thanksgiving. One more nudge, and the Purity Cops will be the ones begging for a release. Just be ready for the fireworks."
        },
        {
            "optionText": "How do we avoid the lockdown?",
            "responseText": "Avoid it? Bro, we lean into it. We’ve hidden contraband in every corner. When they go searching, they’re gonna find more holotapes than an adult convention. It’s like tossing grenades into a toddler's birthday party—total chaos. They’ll be crying for their moms by the time we're done."
        },
        {
            "optionText": "I ran out of the mags. Do you have more?",
            "dontShowIfProgressionEventPlayed": "mags_vol5_handed",
            "giveItem": "Loose Housewives Vol.5",
            "numOfCopiesToGive": 4,
            "progressionEventPlayed": "mags_vol5_handed",
            "exitLine": true,
            "icon": "GUI/magazine",
            "responseText": "Magazines? Oh, you mean ‘historical documents.’ Of course, citizen. Take these and preserve our ‘cultural heritage.’"
        },
        {
            "optionText": "Bye.",
            "responseTexts": ["Remember, when your hand gets lonely tonight, you know where to find me. Viva la fap-olution!",
                            "When the potato farming and purity lectures get too much, just know there’s a stash of contraband and some loyal right hands waiting for you. Fap well, my friend.",
                            "Later, dude. I’ll be in the usual place... right behind you, lurking in the shadows. No pressure, though."],
            "exitLine": true
        }
    ],
    "auto_lines":[ "My dude, this place is a pressure cooker! The Overseer’s ordering a full lockdown, and the Purity Police are walking around like they’ve got bowling pins shoved up their ass. We’re *this* close to total meltdown!" ]
}
