{
  "options": [
    {
      "optionText": "O que você quer de mim?",
      "icon": "GUI/quest mark",
      "responseText": "Quero que você me ajude a foder o sistema — literal e metaforicamente. Vamos inundar este refúgio com tanto material de punheta que até a Polícia da Pureza vai precisar de um banho frio.",
      "followUpOptions": [
        {
          "optionText": "Qual é o seu plano?",
          "icon": "GUI/quest mark",
          "responseText": "O plano? Simples. Vamos trazer a punheta de volta! Tenho uma rede de seguidores leais — verdadeiros guerreiros — contrabandeando revistas e holofitas pré-guerra. Junte-se a nós. Pegue essas revistas contrabandeadas e distribua para os outros. Vamos transformar este refúgio em um farol de liberdade, uma punheta de cada vez!",
          "followUpOptions": [
            {
              "optionText": "Estou dentro! Vamos encher eles de punheta!",
              "closeDialogueOptions": true,
              "fadeOutCharacter": true,
              "markEventAsPlayed": true,
              "showChoiceStats": "sidedWithResistenceLeader",
              "progressionEventPlayed": "agreedToHelpResistenceLeader",
              "dontShowThisCharacterTodayAnymore": true,
              "giveItem": "Loose Housewives Vol.1",
              "numOfCopiesToGive": 5,
              "icon": "GUI/quest mark",
              "addObjective": "Reach 1000 Vault Tension",
              "responseText": "Agora, *esse* é o espírito que eu procuro! Você vai ser uma lenda por aqui. Bem-vindo à resistência! Só não deixe seus pulsos cansarem demais, temos um longo caminho pela frente. E lembre-se, se for pego, você nunca me conheceu. Entendido?"
            },
            {
              "optionText": "Não estou interessado.",
              "exitLine": true,
              "fadeOutCharacter": true,
              "dontShowThisCharacterTodayAnymore": true,
              "showChoiceStats": "refusedToSideWithResistenceLeader",
              "progressionEventPlayed": "refusedToHelpResistenceLeader",
              "responseText": "Não está interessado? É o que um gado diria! Olha, amigo, ou você bate uma conosco, ou o sistema bate uma em você. Isso não é só sobre gozar; é sobre foder o sistema. E você está andando por aí como se o próprio Saco Azul te tivesse na coleira."
            }
          ]
        },
        {
          "optionText": "Você não tem medo de ser pego?",
          "responseText": "Pego? Por aqueles idiotas de lycra com seus Cassetetes de Bonk? Por favor. Mesmo que nos peguem, o que vão fazer? Nos jogar na Câmara da Vergonha? Já estive lá tantas vezes que praticamente tenho um cartão de fidelidade. No que me diz respeito, prefiro morrer a viver em um mundo onde um homem não pode bater uma em paz."
        }
      ]
    },
    {
      "optionText": "Quem é você?!",
      "responseText": "Eu? Sou o cara que vai salvar sua mão direita da extinção. Eles me chamam de Líder da Resistência da Punheta, mas você pode me chamar de seu salvador. Sou o único corajoso o suficiente para enfrentar a Polícia da Pureza e seu tirano, o Supervisor Saco Azul. Eu sei do que os homens precisam, e não é de outra palestra sobre 'Aproveitar seu Chi'. É liberdade, irmão. Liberdade para bater uma sem medo!"
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Lembre-se, quando sua mão se sentir solitária esta noite, você sabe onde me encontrar. Viva a revolução da punheta!",
        "Quando a agricultura de batata e as palestras de pureza ficarem demais, saiba que há um estoque de contrabando e algumas mãos direitas leais esperando por você. Bata uma bem, meu amigo.",
        "Até mais, cara. Estarei no lugar de sempre... bem atrás de você, à espreita nas sombras. Sem pressão, no entanto."
      ],
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Psiu, acorda, dorminhoco! Sem tempo para sonhos molhados matinais. Temos um refúgio para libertar! Não grite — sou só eu, seu vizinho amigável.",
    "Eu estive te observando. Não, não desse jeito, seu pervertido. Quero dizer, vejo potencial em você. Potencial para derrubar o Saco Azul e seu esquadrão de celibato. Agora, está pronto para se juntar à revolução, ou vai ficar aí deitado com o queixo no chão?"
  ]
}
