{
  "options": [
    {
      "optionText": "Nós conseguimos?!",
      "addPerk": "new_overseer",
      "responseText": "Claro que conseguimos! Há tanta pornografia pesada circulando que metade dos moradores já está trancada, se masturbando até a desidratação. Somos lendas agora! Hora de comemorar com uma dança da vitória 'sem as mãos'."
    },
    {
      "optionText": "Qual é o próximo passo?",
      "addPerk": "new_overseer",
      "responseText": "O próximo passo? MANO. Vamos transformar o refúgio no estúdio pornô mais lendário dos Ermos! Vamos filmar tudo que acontecer aqui — a operação 'Tempestade Pornô' começa agora, e nossos filmes serão a mercadoria mais quente dos Ermos. As tampinhas entram, as calças caem — vamos comandar um império pornô do caralho!",
      "followUpOptions": [
        {
          "optionText": "Operação Tempestade Pornô? Explique.",
          "responseText": "Fácil, mano. Imagine só: formamos uma *caravana da sacanagem*, viajando pelos Ermos com mochilas cheias de material pesado. Entramos em outros refúgios vestidos de 'comerciantes inocentes'. Vamos atacá-los com força, rápido. Entrar, sair, deixar algo para eles se aliviarem. Antes que percebam, estarão ocupados demais se masturbando para nos impedir."
        },
        {
          "optionText": "Você realmente acha que vamos dominar os Ermos com pornografia?",
          "responseText": "Mano, pornografia é nossa arma de distração em massa! Vamos fazer a Legião de César parecer um bando de coroinhas. Imagine: enquanto todo saqueador, colono, etc. está ocupado lutando com seus paus, estaremos vivendo como reis em nosso pequeno império da punheta. Quando escreverem os livros de história, chamarão isso de O Grande Punhetaço, e NÓS seremos os *Pais Fundadores da Punheta*."
        }
      ]
    },
    {
      "optionText": "O que aconteceu com o Supervisor?",
      "addPerk": "new_overseer",
      "responseText": "Mano, ele se FOI. Totalmente frito. Algum pobre coitado colocou uma de nossas fitas no terminal dele. Ninguém pensou que ele realmente assistiria, mas *oh-ho, como assistiu*. Logo em seguida —*BOOM!* As bolas dele explodiram com a força de uma mini-nuke. O cara literalmente se *afogou* na própria porra. O corpo dele estava flutuando como uma carcaça de Brahmin inchada, olhos bem abertos, mas ele partiu com um sorriso, mano. Descanse em paz, Saco Azul, seu desgraçado glorioso.",
      "followUpOptions": [
        {
          "optionText": "E a Polícia da Pureza?",
          "responseText": "HA! A Polícia da Pureza? Cara, aqueles perdedores estão em colapso total. Metade deles desertou, jogando seus Cassetetes de Bonk de lado para se juntar à nossa causa degenerada. O resto está soluçando nos cantos, lamentando a virgindade. O refúgio é nosso, calças para baixo!"
        }
      ]
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Lembre-se, quando sua mão se sentir solitária esta noite, você sabe onde me encontrar. Viva a revolução da punheta!"
      ],
      "exitLine": true
    }
  ],
  "auto_lines": [
    "VITÓRIA! O refúgio explodiu sua carga metafórica, meu amigo! A Polícia da Pureza já era. Vi um deles chorando em seu Cassetete de Bonk como se fosse a carta de sua ex-namorada. NÓS SOMOS OS DONOS deste refúgio agora!"
  ]
}
