{
  "options": [
    {
      "optionText": "Como vai o movimento?",
      "responseText": "Mano, estamos nos espalhando mais rápido que um caso de micose de virilha em todo o refúgio. Tenho toda a equipe de agricultura contrabandeando holofitas disfarçadas de pacotes de sementes. Em breve, eles estarão plantando algo muito mais picante que batatas, se é que você me entende!"
    },
    {
      "optionText": "A Polícia da Pureza está na nossa cola?",
      "responseText": "Na nossa cola? Esses palhaços de lycra não conseguem nem amarrar os sapatos sem entalar a cueca! Um deles ficou tão paranoico que se trancou na Câmara da Vergonha e jogou a chave fora. Estamos vivendo de aluguel na cabeça deles, meu amigo."
    },
    {
      "optionText": "Há mais alguma coisa que eu possa fazer?",
      "icon": "GUI/quest mark",
      "dontDisplayIfHasObjective": "Fix the Vault Sexbot",
      "responseText": "Na verdade, agora que você mencionou, há sim. Sabe aquele robô sexual todo capenga que anda por aí? O Supervisor o reprogramou para espalhar sua propaganda, mas aposto que se o consertarmos, poderíamos transformá-lo no maior impulsionador de moral para a resistência!",
      "followUpOptions": [
        {
          "optionText": "Como o reprogramamos?",
          "responseText": "Boa pergunta. Primeiro, precisaremos encontrar uma holofita com sua programação original. Ouvi dizer que um dos Policiais da Pureza a confiscou и a trancou em seus aposentos."
        },
        {
          "optionText": "O que o robô fará quando for reprogramado?",
          "responseText": "O que ele não fará? Será um farol de esperança, espalhando 'educação alternativa'. Além disso, ver a cabeça do Supervisor explodir quando ele começar a citar poesia erótica pré-guerra? Não tem preço."
        },
        {
          "optionText": "Eu farei isso.",
          "icon": "GUI/quest mark",
          "addObjective": "Fix the Vault Sexbot",
          "dontDisplayIfHasObjective": "Fix the Vault Sexbot",
          "exitLine": true,
          "responseText": "Esse é o espírito! Você, eu e um robô sexual com defeito contra o mundo. Pegue essa fita, e vamos fazer o Supervisor se arrepender de ter nascido com ouvidos!"
        },
        {
          "optionText": "De jeito nenhum, não vou tocar naquela coisa.",
          "responseText": "Tudo bem, covarde. Volte a acumular holofitas então."
        }
      ]
    },
    {
      "optionText": "Acabaram as minhas revistas. Você tem mais?",
      "dontShowIfProgressionEventPlayed": "mags_vol2_handed",
      "giveItem": "Loose Housewives Vol.2",
      "numOfCopiesToGive": 4,
      "progressionEventPlayed": "mags_vol2_handed",
      "exitLine": true,
      "icon": "GUI/magazine",
      "responseText": "Já acabaram? Caramba, você esteve mais ocupado do que eu pensava! Aqui, pegue estas — recém-saídas da prensa do mercado negro. As cadeias de suprimentos estão apertadas, mas eu mexi uns pauzinhos."
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Lembre-se, quando sua mão se sentir solitária esta noite, você sabe onde me encontrar. Viva a revolução da punheta!",
        "Quando a agricultura de batata e as palestras de pureza ficarem demais, saiba que há um estoque de contrabando e algumas mãos direitas leais esperando por você. Bata uma bem, meu amigo.",
        "Até mais, cara. Estarei no lugar de sempre... bem atrás de você, à espreita nas sombras. Sem pressão, no entanto."
      ],
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Mano... você transformou este lugar num barril de pólvora! Acabei de passar por um Policial da Pureza e ele estava suando tanto que pensei que ia se afogar na própria lycra. Agora nós os pegamos pelas bolas azuis!"
  ]
}
