{
  "options": [
    {
      "optionText": "Você acha que vamos vencer?",
      "responseText": "Vencer? Já vencemos, campeão. Todo homem, mulher e tolo de lycra aqui está a dois segundos de perder a compostura. O refúgio está mais tenso que uma radroach num macacão embalado a vácuo. Mais um empurrão, e BOOM! É o caos da punheta!"
    },
    {
      "optionText": "Estamos em perigo?",
      "responseText": "Em perigo? Pfft, o único perigo é meu pulso quebrar de tanto que estou aplaudindo esses Policiais da Pureza se atrapalhando. Eles instalaram câmeras de segurança nos banheiros... como se isso fosse parar o combate corpo a corpo que rola lá dentro!"
    },
    {
      "optionText": "Acabaram as minhas revistas. Você tem mais?",
      "dontShowIfProgressionEventPlayed": "mags_vol3_handed",
      "giveItem": "Loose Housewives Vol.3",
      "numOfCopiesToGive": 5,
      "progressionEventPlayed": "mags_vol3_handed",
      "exitLine": true,
      "icon": "GUI/magazine",
      "responseText": "Caramba, cara, você está distribuindo isso como um Papai Noel dos Ermos. Tudo bem, tudo bem — pegue um lote novo, mas vá com calma. Até os lutadores da liberdade precisam de pausas para o pulso."
    },
    {
      "optionText": "Tchau.",
      "responseTexts": [
        "Lembre-se, quando sua mão se sentir solitária esta noite, você sabe onde me encontrar. Viva a revolução da punheta!",
        "Quando a agricultura de batata e as palestras de pureza ficarem demais, saiba que há um estoque de contrabando e algumas mãos direitas leais esperando por você. Bata uma bem, meu amigo.",
        "Até mais, cara. Estarei no lugar de sempre... bem atrás de você, à espreita nas sombras. Sem pressão, no entanto."
      ],
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Puta cãibra na mão! Você deixou o refúgio tão tenso que os Policiais da Pureza estão literalmente tropeçando nos próprios Cassetetes de Bonk. Estamos tão fundo na cabeça deles que poderíamos começar a cobrar aluguel!"
  ]
}
