{
    "options": [
        {
            "optionText": "Nice ass. Mind turning around so I can match a face to it?",
            "icon": "GUI/quest mark",
            "changeSprite": "Characters/Scarlett/Scarlett front 2", 
            "responseText": "Cute. Most visitors take a minute before reminding me they're desperate pieces of shit. Congrats on the new record, jackass. Good news though—you're awake, alive, and haven't stained my sheets yet. Keep it that way.",
            "followUpOptions": [ 
                {
                    "optionText": "Where the hell am I?",
                    "icon": "GUI/quest mark", 
                    "emotion": "Characters/Scarlett/emotions/5",
                    "responseText": "Vault 6969. The wasteland's most productive prison where everyone’s horny and nobody gets off. Ever. And before you ask, no, it’s not a sex dungeon. Quite the opposite.",
                    "followUpOptions": [
                        {
                            "optionText": "So, why'd you drag my ass here?",
                            "icon": "GUI/quest mark",
                            "emotion": "Characters/Scarlett/emotions/3",
                            "addObjective": "Talk to the Overseer",
                            "dontDisplayIfHasObjective": "Bring down Mistress Domina",
                            "responseText": "Because watching radroaches fuck your corpse felt morally questionable—even by my standards. Plus, the Overseer said something about needing an outsider for ‘an important job.’ Honestly thought you were bait set up by raiders until I realized even raiders aren't stupid enough to try that trick twice.",
                            "followUpOptions": [
                                {
                                    "optionText": "What kind of job?",
                                    "emotion": "Characters/Scarlett/emotions/5",
                                    "responseText": "How should I know? Probably involves getting shot, irradiated, or cleaning someone's dried-up fluids off the reactor. Either way, you’d better go see him. The Overseer’s not exactly the patient type."
                                },
                                {
                                    "optionText": "Wait, what happened to me outside?",
                                    "emotion": "none",
                                    "responseText": "You were face-down in dirt, passed out like some cheap whore after a jet bender, breathing shallow, and a radroach was sizing up your ass for a snack. Figured you either needed help or were dead—either way, dragging you back here meant my scouting shift was done early.",
                                    "followUpOptions": [
                                        {
                                            "optionText": "Do you know who I am?",
                                            "responseText": "Not a clue. You didn’t exactly have ID stapled to your forehead. But hey, you’re awake now, so maybe you can fill me in.",
                                            "followUpOptions": [
                                                {
                                                    "optionText": "I can't remember a damn thing. Not even my name.",
                                                    "emotion": "Characters/Scarlett/emotions/5",
                                                    "responseText": "Fucking amnesia. Just my luck. Any second now, you’ll tell me you’re the Chosen One or some bullshit. Alright, hero, pick yourself a cool name and pretend you're somebody important. No one here gives a shit anyway.",
                                                    "followUpOptions": [
                                                        {
                                                            "optionText": "What if I'm a wasteland warlord?",
                                                            "emotion": "Characters/Scarlett/emotions/3",
                                                            "responseText": "Oh no, a mighty warlord! I’m quaking in my boots. Right. If you're a warlord, then I'm the Overseer’s dominatrix. No. You’re just another schmuck who got face-planted by the wasteland. Relax."
                                                        }, 
                                                        {
                                                            "optionText": "Maybe I'm a pre-war billionaire?",
                                                            "emotion": "Characters/Scarlett/emotions/6",
                                                            "responseText": "Yeah, right. And I'm a pre-war pornstar. Dream big, hotshot."
                                                        } 
                                                    ]
                                                } 
                                            ]
                                        },
                                        {
                                            "optionText": "Do you know why I was passed out?",
                                            "emotion": "Characters/Scarlett/emotions/6",
                                            "responseText": "Beats me. Could’ve been radiation, booze, chems, boredom—I don't fucking know. If you're looking for answers, try asking your own shitty brain."
                                        },
                                        {
                                            "optionText": "Nobody asked you to save me, you know.",
                                            "emotion": "Characters/Scarlett/emotions/5",
                                            "responseText": "Oh, my bad. Next time I'll let the radroaches use your face as a breeding ground. Gratitude noted."
                                        }
                                    ]
                                },
                                {
                                    "optionText": "Any rules I should know about before I fuck something up?",
                                    "emotion": "Characters/Scarlett/emotions/4",
                                    "responseText": "Yeah. Don't fuck, don't jerk off, don't try to get laid, and especially don't talk about getting laid. Break any of these rules, and you'll end up like Gary—dead and decomposing."
                                } 
                            ]
                        }
                    ]
                },
                {
                    "optionText": "Who are you?",
                    "emotion": "none",
                    "responseText": "Scarlett. Vault scout, professional wasteland ass-kicker, and apparently the woman responsible for hauling your sorry unconscious ass around today. Try not to make me regret it.",
                    "followUpOptions": [
                        {
                            "optionText": "So, how’d you end up in this depressing hellhole?",
                            "emotion": "Characters/Scarlett/emotions/2",
                            "responseText": "Born here. Grew up sexually frustrated, pissed off, and too damn stubborn to die. Now I scout the wastes looking for something less shitty. Haven’t found it yet, obviously."
                        }
                    ]
                },
                {
                    "optionText": "This room smells like cum-stained socks. Why?",
                    "emotion": "Characters/Scarlett/emotions/3",
                    "responseText": "That'd be Gary. Previous occupant. Poor bastard jerked himself into madness—claimed the walls whispering to him. Now he's fertilizing carrots in the hydroponics lab. Circle of life, you know.",
                    "followUpOptions": [
                        {
                            "optionText": "Who is Gary?",
                            "emotion": "Characters/Scarlett/emotions/5",
                            "responseText": "Vault engineer gone crazy from sexual repression. Kept muttering about walls seducing him. Eventually tried to fuck a power conduit. He fried his dick—and the rest of him too."
                        },
                        {
                            "optionText": "You couldn't clean this place up first?",
                            "emotion": "Characters/Scarlett/emotions/3",
                            "responseText": "Not my job, princess. You want cleanliness, grab a mop and start scrubbing."
                        }
                    ]
                } 
            ]
        }
    ],
    "reset_to_default_sprite_after_closure": true
}
