{
  "options": [
    {
      "optionText": "Bela bunda. Se importa de virar para eu combinar um rosto com ela?",
      "icon": "GUI/quest mark",
      "changeSprite": "Characters/Scarlett/Scarlett front 2",
      "responseText": "Fofo. A maioria dos visitantes leva um minuto antes de me lembrar que são uns merdas desesperados. Parabéns pelo novo recorde, otário. A boa notícia é que você está acordado, vivo e ainda não manchou meus lençóis. Mantenha assim.",
      "followUpOptions": [
        {
          "optionText": "Onde diabos eu estou?",
          "icon": "GUI/quest mark",
          "emotion": "Characters/Scarlett/emotions/5",
          "responseText": "Refúgio 6969. A prisão mais produtiva dos Ermos, onde todo mundo tem tesão e ninguém goza. Nunca. E antes que você pergunte, não, não é uma masmorra de sexo. Muito pelo contrário.",
          "followUpOptions": [
            {
              "optionText": "Então, por que você me arrastou até aqui?",
              "icon": "GUI/quest mark",
              "emotion": "Characters/Scarlett/emotions/3",
              "addObjective": "Talk to the Overseer",
              "dontDisplayIfHasObjective": "Bring down Mistress Domina",
              "responseText": "Porque assistir radroaches foderem seu cadáver pareceu moralmente questionável — até para os meus padrões. Além disso, o Supervisor disse algo sobre precisar de um forasteiro para 'um trabalho importante'. Sinceramente, pensei que você fosse uma isca armada por saqueadores até perceber que nem os saqueadores são estúpidos o suficiente para tentar esse truque duas vezes.",
              "followUpOptions": [
                {
                  "optionText": "Que tipo de trabalho?",
                  "emotion": "Characters/Scarlett/emotions/5",
                  "responseText": "Como eu deveria saber? Provavelmente envolve levar um tiro, ser irradiado ou limpar os fluidos secos de alguém do reator. De qualquer forma, é melhor você ir vê-lo. O Supervisor не é exatamente do tipo paciente."
                },
                {
                  "optionText": "Espera, o que aconteceu comigo lá fora?",
                  "emotion": "none",
                  "responseText": "Você estava de cara na terra, desmaiado como uma puta barata depois de uma maratona de jet, respirando superficialmente, e uma radroach estava medindo sua bunda para um lanche. Pensei que você precisava de ajuda ou estava morto — de qualquer forma, te arrastar para cá significava que meu turno de patrulha terminaria mais cedo.",
                  "followUpOptions": [
                    {
                      "optionText": "Você sabe quem eu sou?",
                      "responseText": "Nenhuma ideia. Você não tinha exatamente uma identidade grampeada na testa. Mas ei, você está acordado agora, então talvez possa me contar.",
                      "followUpOptions": [
                        {
                          "optionText": "Não consigo me lembrar de porra nenhuma. Nem meu nome.",
                          "emotion": "Characters/Scarlett/emotions/5",
                          "responseText": "Amnésia do caralho. Que sorte a minha. A qualquer segundo, você vai me dizer que é o Escolhido ou alguma merda assim. Certo, herói, escolha um nome legal e finja que é alguém importante. Ninguém aqui dá a mínima de qualquer maneira.",
                          "followUpOptions": [
                            {
                              "optionText": "E se eu for um senhor da guerra dos Ermos?",
                              "emotion": "Characters/Scarlett/emotions/3",
                              "responseText": "Oh não, um poderoso senhor da guerra! Estou tremendo nas bases. Certo. Se você é um senhor da guerra, então eu sou a dominatrix do Supervisor. Não. Você é só mais um otário que levou uma surra dos Ermos. Relaxa."
                            },
                            {
                              "optionText": "Talvez eu seja um bilionário pré-guerra?",
                              "emotion": "Characters/Scarlett/emotions/6",
                              "responseText": "Sim, claro. E eu sou uma estrela pornô pré-guerra. Sonhe alto, bonitão."
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "optionText": "Você sabe por que eu estava desmaiado?",
                      "emotion": "Characters/Scarlett/emotions/6",
                      "responseText": "Sei lá. Podia ser radiação, bebida, drogas, tédio — eu não sei, porra. Se está procurando respostas, tente perguntar ao seu próprio cérebro de merda."
                    },
                    {
                      "optionText": "Ninguém te pediu para me salvar, sabe.",
                      "emotion": "Characters/Scarlett/emotions/5",
                      "responseText": "Ah, foi mal. Da próxima vez, deixo as radroaches usarem seu rosto como criadouro. Gratidão anotada."
                    }
                  ]
                },
                {
                  "optionText": "Alguma regra que eu deva saber antes de foder tudo?",
                  "emotion": "Characters/Scarlett/emotions/4",
                  "responseText": "Sim. Não foda, не bata uma, não tente transar, e especialmente não fale sobre transar. Quebre qualquer uma dessas regras, e você acabará como o Gary — morto e em decomposição."
                }
              ]
            }
          ]
        },
        {
          "optionText": "Quem é você?",
          "emotion": "none",
          "responseText": "Scarlett. Batedora do refúgio, chutadora de bundas profissional dos Ermos, e aparentemente a mulher responsável por carregar sua bunda inconsciente por aí hoje. Tente não me fazer arrepender.",
          "followUpOptions": [
            {
              "optionText": "Então, como você acabou neste buraco infernal deprimente?",
              "emotion": "Characters/Scarlett/emotions/2",
              "responseText": "Nasci aqui. Cresci sexualmente frustrada, puta da vida e teimosa demais para morrer. Agora eu exploro os Ermos procurando por algo menos merda. Não encontrei ainda, obviamente."
            }
          ]
        },
        {
          "optionText": "Este quarto cheira a meias manchadas de porra. Por quê?",
          "emotion": "Characters/Scarlett/emotions/3",
          "responseText": "Isso seria o Gary. Ocupante anterior. Pobre coitado se masturbou até a loucura — afirmava que as paredes sussurravam para ele. Agora ele está fertilizando cenouras no laboratório de hidroponia. Círculo da vida, sabe.",
          "followUpOptions": [
            {
              "optionText": "Quem é Gary?",
              "emotion": "Characters/Scarlett/emotions/5",
              "responseText": "Engenheiro do refúgio que enlouqueceu de repressão sexual. Ficava resmungando sobre as paredes o seduzindo. No fim, tentou foder um conduíte de energia. Ele fritou o pau — e o resto dele também."
            },
            {
              "optionText": "Você não podia limpar este lugar antes?",
              "emotion": "Characters/Scarlett/emotions/3",
              "responseText": "Não é meu trabalho, princesa. Se quer limpeza, pegue um esfregão e comece a esfregar."
            }
          ]
        }
      ]
    }
  ],
  "reset_to_default_sprite_after_closure": true
}
