{
  "options": [
    {
      "optionText": "[Inserir a nova holofita]",
      "icon": "GUI/quest mark",
      "onlyDisplayIfHasObjective": "Fix the Vault Sexbot",
      "itemRequired": "Sexbot holotape",
      "swapAnotherCharacterDialogue": [
        "Vault Sexbot",
        "Characters/Vault Sexbot/after_being_restored"
      ],
      "exitLine": true,
      "giveItemToCharacter": "Sexbot holotape",
      "addGripGaugePoints": 350,
      "progressionEventPlayed": "sexbot fixed",
      "markObjectiveComplete": "Fix the Vault Sexbot",
      "showChoiceStats": "sexbot_repaired",
      "addSusPoints": 10,
      "responseText": "*Você insere a holofita. As luzes do Robô Sexual piscam descontroladamente, e ele começa a emitir uma música de jazz sensual* INICIANDO... OH, QUERIDO, ESTAS JUNTAS NÃO ESTÃO TÃO LUBRIFICADAS DESDE A EXPO ANUAL DE ORGIAS PRÉ-GUERRA! QUEM QUER MONTAR NO TROVÃO CROMADO? AVISO: OS NÍVEIS DE PRAZER PODEM EXCEDER AS REGULAMENTAÇÕES DA OSHA!"
    },
    {
      "optionText": "[Ligar o Robô Sexual]",
      "responseTexts": [
        "Saudações, valioso morador do refúgio! Lembre-se, o autocontrole é a chave. Mas se suas mãos estiverem ociosas, posso sugerir uma leve massagem para manter o sangue circulando? Minha troca de óleo está atrasada, mas ainda estou totalmente equipada para—ERRO—promover atividades saudáveis!",
        "Permaneçam fortes, cidadãos do Refúgio 6969! Evitem a tentação a todo custo. A menos que seja dia de peito, então sintam-se à vontade para suar! Posso fornecer auxílios visuais—ERRO—apoio emocional para ajudá-los a se concentrar nesses ganhos!",
        "Lembrem-se, há mais na vida do que prazer físico. Como… uh… contar calorias e dormir. Mas se precisarem de companhia, estou sempre aqui para oferecer... apoio? Estritamente platônico, claro, mas com configurações ajustáveis—ERRO—incentivo para um estilo de vida sem punheta!",
        "O Refúgio 6969 incentiva todos os residentes a se envolverem em hobbies produtivos. Se estiverem se sentindo tensos, considerem a meditação. Ou eu poderia fornecer uma sessão relaxante de—ERRO—exercícios de respiração guiada! Confiem em mim, fui construída para proporcionar satisfação—ERRO—satisfação através da motivação!",
        "Bom dia, moradores do refúgio! A abstinência é o caminho para o sucesso. Por favor, abstenham-se de se envolver em quaisquer atividades íntimas, a menos que supervisionados por um parceiro autorizado—ERRO—Oficial da Pureza! E lembrem-se, meus sensores estão sempre disponíveis para detectar batimentos cardíacos elevados!",
        "O autocontrole é seu aliado mais forte. Mas se sentirem o desejo, pensem em mim, parada aqui em minha carcaça de titânio brilhante, pronta para ajudá-los a—ERRO—encontrar atividades alternativas como tricô ou pintura a dedo. A vida não é maravilhosa?"
      ],
      "exitLine": true
    }
  ]
}
