{
  "options": [
    {
      "optionText": "[Cobrir os olhos rapidamente]",
      "responseText": "Opa, tudo bem aí? Cobrindo os olhos como se tivesse visto um Deathclaw!",
      "followUpOptions": [
        {
          "optionText": "Eu não vi nada! Juro!",
          "responseText": "Não viu nada, huh? Você está bem assustado para alguém que 'não viu nada'. Mas ei, sem problemas."
        },
        {
          "optionText": "Estou cego! Estou totalmente cego! Não vi nada!",
          "responseText": "Ah, totalmente cego? Bem, boas notícias para você — não estou ofendida. Mas talvez você queira trabalhar nessas habilidades de furtividade!"
        }
      ]
    },
    {
      "optionText": "[Aproximar-se]",
      "gripGaugeRequired": 1800,
      "changeSprite": "Characters/ShowerGirl/ass_upclose_2",
      "newSpriteXPos": 0.51,
      "newSpriteYPos": 0.27,
      "changeSpriteColor": "#FFECD9",
      "responseText": "O que você está olhando aí atrás?",
      "resetToDefaultSpriteAfterClosingDialogues": true,
      "followUpOptions": [
        {
          "optionText": "[Dar um tapa na bunda dela]",
          "playSound": "slap2",
          "specialEffects": ["Punch"],
          "emotion": "Characters/ShowerGirl/emotions/biting_lip55",
          "responseTexts": [
            "O quê, o refúgio instalou uma máquina de espancamento e esqueceu de me avisar? ♥",
            "Bem, é melhor que seja aprovado pela Vault-Tec, porque eu odiaria pensar que você acabou de ativar o 'alarme de tapa na bunda'. O próximo vai te custar! ♥"
          ]
        },
        {
          "optionText": "[Dedilhar a xoxota dela]",
          "playSound": "Sounds/fingering2",
          "emotion": "Characters/ShowerGirl/emotions/ahegao",
          "responseTexts": [
            "Ohhh... Alguém está pulando as preliminares e indo direto para a ação. É melhor você estar pronto para terminar este trabalho. ♥︎",
            "Oh, não pensei que você faria isso... mas porra, não pare agora! Minha xoxota tem mais quilometragem do que você aguenta! ♥︎",
            "Mmm, ohhh... você tem uma puta coragem. Mas eu gosto. É melhor você trabalhar esses dedos como se sua vida dependesse disso. ♥︎",
            "*Ofegando* Oh porra, você está realmente indo fundo, hein? Não pare até minhas pernas cederem. ♥︎"
          ]
        }
      ]
    }
  ],
  "reset_to_default_sprite_after_closure": true
}
