{
  "options": [
    {
      "optionText": "Suas tetas estão incríveis...",
      "icon": "GUI/heart4",
      "responseText": "Ah, obrigada, docinho! Essas belezinhas provavelmente poderiam alimentar todo o refúgio se as conectássemos direito. Mas se fizéssemos isso, haveria um apagão com todo mundo tentando se conectar ao mesmo tempo.",
      "followUpOptions": [
        {
          "optionText": "Posso ter uma demonstração prática desta fonte de energia?",
          "icon": "GUI/heart4",
          "failedCheckResponse": "Ha! Boa tentativa, mas esta rede elétrica está fora dos limites. Você não tem nem de perto a estamina para lidar com *essas* belezas de alta voltagem. Talvez da próxima vez, quando não estiver com a bateria fraca.",
          "relationshipRequired": 40,
          "desireRequired": 35,
          "responseText": "Só se você prometer não entrar em curto-circuito. Confie em mim, eu odiaria ter que explicar à Polícia da Pureza por que você está com um sorriso no rosto e fumaça saindo das orelhas. Agora, que tal colocarmos sua fiação à prova?",
          "followUpOptions": [
            {
              "optionText": "[Aceitar]",
              "changeSprite": "Characters/Diana/Resized/titjob",
              "newSpriteXPos": 1.07,
              "newSpriteYPos": -2.18,
              "icon": "GUI/heart4",
              "closeDialogueOptions": true,
              "isHEventStarted": true,
              "hEventName": "diana_titjob_to_player",
              "addGripGaugePoints": 250,
              "endingEffects": ["Flashes"],
              "specialEffects": ["Shake"],
              "changeSpriteColor": "#CCD9D4",
              "endingSpriteColor": "#BFCBB1",
              "changeShadowFigureSprite": [
                "Showers Men",
                "man_b4732",
                "Characters/Other characters/shocked"
              ],
              "emotionsDuringHevent": [
                "none",
                "Characters/Diana/Emotions/titjob/titjob1",
                "Characters/Diana/Emotions/titjob/titjob2",
                "Characters/Diana/Emotions/titjob/titjob3",
                "Characters/Diana/Emotions/titjob/titjob4"
              ],
              "spriteAtTheEndOfHscene": "Characters/Diana/standing in cum 55",
              "spriteAtTheEndOfHscenePosition": [1.37, -0.87],
              "lineAfterHevent": "Mmm, uau... você realmente não se segurou, né? Parece que vou precisar de outro banho. ♥︎",
              "auto_lines": [
                "Oh, uau... não sabia que seu pau podia ficar ainda mais duro com toda essa água quente.",
                "Mmm, você gosta destas? Elas não são só para exibição, sabe. ♥",
                "Você vai fazer uma bela bagunça, não vai? Não se preocupe, eu gosto de ficar molhada.",
                "Ahh, seu pau deslizando entre elas é tão bom... acha que consegue aguentar?",
                "Uau, você já está latejando. Eu nem comecei direito ainda!",
                "Mmm, sua porra vai ficar tão bem em mim. ♥",
                "Sinto cada pulsação... tão sensível, não é?",
                "Ohh, você está me fazendo sentir safada... e eu adoro isso. ♥",
                "Você gosta quando eu as aperto uma contra a outra, hein? Ahh... aposto que tem sonhado com isso.",
                "Mmm, você é um bom menino... vamos ver quanto tempo você aguenta.",
                "Olha só, já está vazando. Que gracinha. ♥",
                "Você tem sorte que minha toalha caiu, hein? Agora você tem o show completo.",
                "Estou ficando tão molhada quanto você. Ou... mais molhada.",
                "Apenas se solte... sinto que você está perto. Deixe tudo sair. ♥",
                "Ahh, adoro como seu pau parece grosso agora, empurrando contra mim.",
                "Não se segure... quero que você goze em mim toda.",
                "Mmm, você está tão reprimido... consigo sentir a tensão... ♥",
                "Oh, querido, você é tão grande entre minhas tetas. Poderia ficar aqui o dia todo.",
                "Ahh, sim, deslize mais fundo... é bom, não é?",
                "Adoro como seu pau se contrai toda vez que eu te provoco um pouco... ♥",
                "Ohh, acho que você vai explodir... deixe-me sentir essa porra.",
                "Mmm, você estava esperando por isso, hein? Não se preocupe, também estou gostando.",
                "Você está perto, não está? Ahh, consigo sentir... ♥",
                "Ahh, não pare... deixe-me sentir essa rola latejante... mmm.",
                "Não vou parar até você estar completamente esgotado. Então, é melhor estar pronto. ♥",
                "Mmm, minhas tetas estão encharcadas... e não é só a água.",
                "Sua porra vai deixar estas ainda mais bonitas... não concorda? ♥",
                "Quero tudo em mim... não se atreva a se segurar.",
                "Oh, seu pau está praticamente implorando... e eu adoro isso.",
                "Mmm, sim, é isso... sinta cada centímetro deslizando entre estas... ♥",
                "Não se preocupe, querido, eu te limpo depois. Mas por enquanto... ahh, apenas se solte.",
                "Oh, você está ficando mais duro... é isso que eu adoro ver. ♥",
                "Sua porra vai estar por toda parte... e eu estou totalmente a favor.",
                "Ahh, adoro o jeito que você me olha quando eu aperto mais forte. ♥",
                "Mmm, você vai explodir em breve, consigo sentir... ♥",
                "Mal posso esperar para sentir sua porra escorrendo... vamos fazer uma bela bagunça.",
                "Você gosta quando eu falo sacanagem, não gosta? Mmm, eu sabia que gostaria.",
                "Você vai gozar tanto, querido. Não se segure agora.",
                "Ahh, sim, desse jeito... tão perto... mmm, mal posso esperar. ♥",
                "Mmm, seu pau já está se contraindo... vamos ver o quanto você tem para mim. ♥"
              ]
            }
          ]
        }
      ]
    }
  ]
}
