 
{
    "options": [
        {
            "optionText": "Who the hell are you?",
            "responseText": "They call me the Stealth Fapper. Vault security’s worst nightmare and master of covert cock operations. One-handed espionage is my specialty, and no malfunctioning camera is safe.",
            "followUpOptions": [ 
                {
                    "optionText": "What's with the trench coat, creep?",
                    "responseText": "This coat is my dick's stealth field. Sure, it might seem sketchy, but you'd never guess if I’m currently jacking it to your confused face right now, would you?"
                },
                {
                    "optionText": "And the mask?",
                    "responseText": "The mask holds back my perverse power level. You think I'm wearing this shit for style? Nah, without it, I'd unleash horrors Vault-Tec never prepared us for.",
                    "followUpOptions": [
                        {
                            "optionText": "Keep that horror show to yourself.",
                            "responseText": "Too late. The beast already saw you, liked you, and planned your honeymoon together. But don't worry—I’m still holding the leash."
                        },
                        {
                            "optionText": "You've officially lost your fucking mind.",
                            "responseText": "Wrong—I found enlightenment dangling between my thighs like a fat, radioactive pendulum. And it's ticking closer to midnight."
                        } 
                    ]
                }
            ]
        }, 
        {
            "optionText": "What's with the creepy getup? Secret cult vibes?",
            "responseText": "Cult? Fuck that noise—too much talking, not enough jerking. I’m strictly freelance. The coat's armor against judgmental eyes. Pants? They're a conspiracy against freedom. My dick needs breathing room."
        },
        {
            "optionText": "Got any dirt on this vault?",
            "responseText": "Oh, I've got dirt that'll make your Pip-Boy crash from trauma. Like how the Purity Patrol ain't so pure after curfew, or how today's cafeteria 'special sauce' is yesterday’s stealth mission. But spoiling the fun isn't my kink—I prefer to watch the drama unfold naturally."
        }, 
        {
            "optionText": "Yeah... I’m leaving before this gets worse.",
            "responseText": "Go ahead. But remember, you can run from me—but you can't run from the sound of a stranger breathing heavily in the shadows.",
            "exitLine": true
        }
    ]
} 