{
  "options": [
    {
      "optionText": "Quem diabos é você?",
      "responseText": "Eles me chamam de Punheteiro Furtivo. O pior pesadelo da segurança do refúgio e mestre de operações de rola secretas. Espionagem de uma mão é minha especialidade, e nenhuma câmera com defeito está segura.",
      "followUpOptions": [
        {
          "optionText": "Qual é a desse sobretudo, seu nojento?",
          "responseText": "Este casaco é o campo de furtividade do meu pau. Claro, pode parecer suspeito, mas você nunca adivinharia se estou atualmente batendo uma para o seu rosto confuso agora, não é?"
        },
        {
          "optionText": "E a máscara?",
          "responseText": "A máscara contém meu nível de poder pervertido. Você acha que estou usando essa merda por estilo? Nah, sem ela, eu liberaria horrores para os quais a Vault-Tec nunca nos preparou.",
          "followUpOptions": [
            {
              "optionText": "Guarde esse show de horrores para você.",
              "responseText": "Tarde demais. A besta já te viu, gostou de você e planejou sua lua de mel juntos. Mas não se preocupe — ainda estou segurando a coleira."
            },
            {
              "optionText": "Você perdeu completamente o juízo.",
              "responseText": "Errado — encontrei a iluminação balançando entre minhas coxas como um pêndulo gordo e radioativo. E está se aproximando da meia-noite."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Qual é a desse visual esquisito? Vibe de culto secreto?",
      "responseText": "Culto? Foda-se esse barulho — muita conversa, pouca punheta. Sou estritamente autônomo. O casaco é uma armadura contra olhos julgadores. As calças? São uma conspiração contra a liberdade. Meu pau precisa de espaço para respirar."
    },
    {
      "optionText": "Tem alguma sujeira sobre este refúgio?",
      "responseText": "Oh, tenho sujeira que fará seu Pip-Boy travar de trauma. Como a Patrulha da Pureza não é tão pura depois do toque de recolher, ou como o 'molho especial' do refeitório de hoje é a missão furtiva de ontem. Mas estragar a diversão não é meu fetiche — prefiro assistir ao drama se desenrolar naturalmente."
    },
    {
      "optionText": "É... estou saindo antes que isso piore.",
      "responseText": "Vá em frente. Mas lembre-se, você pode fugir de mim — mas não pode fugir do som de um estranho respirando pesadamente nas sombras.",
      "exitLine": true
    }
  ]
}
