{
  "options": [
    {
      "optionText": "Você parece bem forte. Já despedaçou alguém?",
      "responseText": "*Ele sorri largamente* Sim! Muitas vezes! Homem verde gosta do som que humanos fazem quando ossos quebram.",
      "followUpOptions": [
        {
          "optionText": "Qual sua forma favorita de matar?",
          "responseText": "*O mutante se empolga* Apertar cabeça até estourar. Sujo, barulhento. Homem verde gostar de barulho."
        },
        {
          "optionText": "Acha que pode me vencer?",
          "responseText": "Humaninho engraçado. Homem verde esmaga humano como radroach. Humano burro? Humano não pedir para morrer antes. Geralmente só grita."
        }
      ]
    },
    {
      "optionText": "De onde uma coisa como você veio?",
      "responseText": "Homem verde lembrar de tanques, gosma verde. Dor, gritos... depois forte! Matar muitos humanos, pegar fêmeas. Vida divertida!",
      "followUpOptions": [
        {
          "optionText": "Você gosta de ser uma aberração?",
          "responseText": "Aberração? Homem verde forte. Humanos fracos. Fracos morrem, fortes vivem. Simples."
        },
        {
          "optionText": "Quantos mais como você existem?",
          "responseText": "*Ele encolhe os ombros* Muitos. Tribo do homem verde grande. Pegar o que queremos. Você sortudo de ainda viver."
        },
        {
          "optionText": "Você come pessoas?",
          "responseText": "*Ele acena com entusiasmo* Carne humana borrachuda, sabor bom. Fêmeas têm gosto melhor, menos duras."
        }
      ]
    },
    {
      "optionText": "Os saqueadores te incomodam?",
      "responseText": "Saqueadores burros. Atiram armas, balas ricocheteiam no Homem verde. Depois Homem verde arranca braços de saqueador. Divertido!",
      "followUpOptions": [
        {
          "optionText": "Surpreso que ainda não tentaram te matar.",
          "responseText": "Tentaram muitas vezes. Homem verde colocou cabeças em estacas fora da caverna. Saqueadores aprendem rápido."
        },
        {
          "optionText": "Talvez você devesse se juntar a eles. Pode se divertir.",
          "responseText": "Saqueadores fracos, gritam demais. Irritam Homem verde. Melhor sozinho."
        }
      ]
    },
    {
      "optionText": "Que porra está acontecendo aqui?",
      "responseText": "Homem verde paga tampinhas, faz o que quiser. Você quer ser o próximo?",
      "followUpOptions": [
        {
          "optionText": "Seu doente do caralho. Ela mal está viva.",
          "responseText": "Ela respirando. Respirando significa viva, humano burro. Viva significa ainda divertida."
        },
        {
          "optionText": "Quanto por uma vez?",
          "icon": "GUI/heart4",
          "responseText": "*O mutante coça a cabeça, contando nos dedos* Hum... cinco tampinhas. Ou Jet. Homem verde gosta de Jet.",
          "followUpOptions": [
            {
              "optionText": "Aqui estão as cinco tampinhas.",
              "capsRequired": 5,
              "addCaps": -5,
              "icon": "GUI/heart4",
              "responseText": "*Homem verde pega as tampinhas* Boa troca. Sem reembolso se ela morder. Ela morde às vezes.",
              "followUpOptions": [
                {
                  "optionText": "[Foder a garota]",
                  "changeSprite": "Characters/Other characters/upper floor fuck",
                  "icon": "GUI/heart4",
                  "closeDialogueOptions": true,
                  "changeSpriteColor": "#D4D4D4",
                  "newSpriteYPos": -0.84,
                  "newSpriteXPos": 0.15,
                  "isHEventStarted": true,
                  "hEventName": "brothel2ndFloorPlayerSex",
                  "spriteAtTheEndOfHscene": "Characters/Super Mutant/IPAdapter_00814_(1)(1)",
                  "spriteAtTheEndOfHscenePosition": [-6.03, 0.41],
                  "specialEffects": ["Blackout"],
                  "endingEffects": ["Flashes"],
                  "emotionsDuringHevent": [
                    "none",
                    "Characters/Super Mutant/Focused/emotions/upper floor fuck/2",
                    "Characters/Super Mutant/Focused/emotions/upper floor fuck/3",
                    "Characters/Super Mutant/Focused/emotions/upper floor fuck/5",
                    "Characters/Super Mutant/Focused/emotions/upper floor fuck/6"
                  ],
                  "lineAfterHevent": "Ahh... Meu corpo... p-parece tão vazio... por favor, me encha de novo...",
                  "auto_lines": [
                    "Oh porra... p-por favor... só continue me enchendo—ahh! Meu cérebro está uma papa, não consigo—uhn—viver sem pau... por favor... mais fundo...",
                    "M-mais porra, papai—encha meu útero vadio... p-por favor, serei boazinha... Deus, farei qualquer coisa, s-só não pare de me foder...",
                    "Ahh... p-pau duro... tanto pau... sou apenas um depósito de porra inútil, me procrie... me quebre... foda meu cérebro para fora...",
                    "Por favor... meus buracos doem... caramba, e-estou viciada... não consigo ficar cinco minutos sem pau—me encha pra caralho, me use, por favor, não me deixe vazia...",
                    "Porra... s-só me sufoque com isso... sou sua cadela de procriação pessoal... me arruíne, m-me faça gozar de novo... eu imploro—vou implorar o dia todo pelo seu pau...",
                    "M-me fode de novo... p-por favor... não consigo pensar... vazia sem pau...",
                    "N-nenhum pensamento sobrando... só p-pau... preciso de mais... agora...",
                    "Q-qualquer um... por favor, me use... e-eu preciso tanto...",
                    "N-não consigo parar de tremer... só... preciso de porra dentro de mim... uhh, p-porra...",
                    "Não me d-deixe vazia... por favor, enfie... agora...",
                    "E-eu sou sua... a-animal de estimação, buraco, brinquedo... tanto faz... s-só me foda...",
                    "M-me quebre de novo... arruíne este d-depósito de porra inútil... por favor...",
                    "Mais pau... p-por favor... d-dói estar vazia...",
                    "E-eu não consigo... respirar... sem paus... dentro...",
                    "D-despeje sua porra em mim... preciso dela vazando... sempre...",
                    "Uhh... Deus... viciada... p-preciso de mais... por favor...",
                    "P-puxe meu cabelo... me sufoque... s-só não pare de me foder...",
                    "Meus buracos... doendo... gritando por p-pau...",
                    "E-encha meu útero vadio... p-por favor, eu te imploro...",
                    "G-goze em todo o meu corpo... me cubra... marque sua p-propriedade...",
                    "M-me diga... que sou seu brinquedo sexual inútil... por favor...",
                    "P-por favor, me foda sem camisinha... use meu corpo... mais forte...",
                    "M-me dê seu pau... serei boazinha... prometo... t-tão boazinha...",
                    "Sou apenas... uma burra, quebrada d-depósito de porra... m-me fode de novo...",
                    "M-me use com mais força... me arruíne completamente... e-eu quero..."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Esquece. Aproveite sua 'diversão'.",
      "responseText": "Homem verde sempre aproveita. Você sai agora, humano fraco.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Não toque! Vez do Homem verde! Homem verde pagou boas tampinhas. Homem verde leva seu tempo."
  ],
  "showShadowFigures": "Raider Slut Room"
}
