{
  "options": [
    {
      "optionText": "Puta merda, é a temporada de acasalamento dos mutantes?",
      "responseText": "HAHAHA! HUMANINHO ENGRAÇADO! TODA ESTAÇÃO É ESTAÇÃO DE ACASALAMENTO PARA O GRANDE ABRAÇADOR! SR. ABRAÇAFODA DIZ, 'FAÇA AMOR FORTE, NÃO GUERRA!' VOCÊ QUER PARTICIPAR? PODE IR DEPOIS!",
      "followUpOptions": [
        {
          "optionText": "O ursinho supervisiona suas sessões de estupro?",
          "responseText": "SR. ABRAÇAFODA É O MELHOR AMIGO! SEMPRE OBSERVANDO, SEMPRE INCENTIVANDO! ELE ADORA VER OS BATEDORES DE CARNE FAZEREM O MAL-MAL! URSINHO TORNA TUDO ESPECIAL!",
          "followUpOptions": [
            {
              "optionText": "O Sr. Abraçafoda está bem? Ele parece ter visto coisas demais.",
              "responseText": "OH, ELE VIU! ELE É NOSSO GUIA ESPIRITUAL. ESTEVE CONOSCO EM TREZENTAS SURUBAS, UMA ORGIA CANIBAL, E A VEZ QUE ENFIAMOS UM CARNIÇAL NUM HIDRANTE! ELE VIU A VERDADE!"
            }
          ]
        },
        {
          "optionText": "Quem é a vadia azarada sendo amada por mutantes esta noite?",
          "responseText": "SÓ FÊMEA HUMANA QUE PEGAMOS DA CASA DELA. ELA DIZ 'NÃO', MAS OUVIDOS DE MUTANTE SÓ OUVEM 'MAIS FORTE!' SR. ABRAÇAFODA ME ENSINOU ISSO!",
          "followUpOptions": [
            {
              "optionText": "Ela não é pequena demais para o seu material mutante?",
              "responseText": "GRANDE ABRAÇADOR NÃO DISCRIMINA! SE QUEBRAR, SÓ ACHAR BRINQUEDO NOVO! ERMOS CHEIOS DE HUMANOS TAMANHO DIVERSÃO!"
            }
          ]
        },
        {
          "optionText": "Vocês, mutantes, fodem tudo que se move?",
          "responseText": "SE SE MOVE, GRANDE ABRAÇADOR FAZ AMOR. SE NÃO SE MOVE, GRANDE ABRAÇADOR FAZ AMOR MAIS FORTE ATÉ SE MOVER OU QUEBRAR. REGRA SIMPLES!",
          "followUpOptions": [
            {
              "optionText": "Já pensaram em terapia em vez de estuprar garotas em becos?",
              "responseText": "NÓS TENTAMOS UMA VEZ. TERAPEUTA COMEÇOU A CHORAR E CHAMAR PELA MAMÃE. ISSO NOS DEIXOU TODOS DUROS, ENTÃO... MEIO QUE DEU ERRADO."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Cristo, vocês, aberrações, cheiram a Brahmin morto.",
      "responseText": "HA! CARNINHA FALA MERDA GRANDE! CARNE DE MUTANTE DO GRANDE ABRAÇADOR FORTE COMO DEATHCLAW! QUER VER SE HUMANO AGUENTA SEM PARTIR AO MEIO?",
      "followUpOptions": [
        {
          "optionText": "Tente, mutante — meu cu tem defesa alta.",
          "responseText": "OOOOH! HUMANO MUITO CONFIANTE! GRANDE ABRAÇADOR IMPRESSIONADO — TALVEZ HUMANO GANHE LUBRIFICANTE DE URSINHO ANTES DE COMEÇARMOS DIVERSÃO ESPECIAL."
        },
        {
          "optionText": "Prefiro foder seu cadáver com seu próprio ursinho.",
          "exitLine": true,
          "responseText": "AGORA HUMANO FALA BEM SUJO! EU GOSTAR! PRIMEIRO NÓS LUTA, DEPOIS GRANDE ABRAÇADOR FODE SUA CARA MORTA!"
        },
        {
          "optionText": "Solte essa vadia, ou transformo seu urso em uma lanterna de carne.",
          "responseText": "HMMM... HUMANO TEM BOLAS PARA AMEAÇAR SR. ABRAÇAFODA! MAS GRANDE ABRAÇADOR AMA O URSINHO DEMAIS — TALVEZ DAR GAROTA HUMANA EM VEZ DISSO, MAS PRIMEIRO, HUMANO DÁ AOS MUTANTES SHOW ESPECIAL?",
          "followUpOptions": [
            {
              "optionText": "Que tal eu rearranjar seu saco em um pretzel mutante?",
              "exitLine": true,
              "responseText": "HAHAHA! GRANDE ABRAÇADOR GOSTA DO ESTILO DO HUMANO! AGORA GRANDE ABRAÇADOR EMPOLGADO PARA VER SE HUMANO PODE BANCAR O PAPO GROSSO!"
            }
          ]
        }
      ]
    },
    {
      "optionText": "Querendo trocar? Tem algo interessante?",
      "dontShowIfProgressionEventPlayed": "grace_sold_to_supermutants",
      "responseText": "TROCAR? HMM, SIM! GRANDE ABRAÇADOR PROCURANDO COMPRAR CARNE ESPECIAL — VIRGEM HUMANA FRESCA! MUTANTES PAGAM BOAS TAMPINHAS, EXTRA PELAS QUE GRITAM!",
      "followUpOptions": [
        {
          "optionText": "Como diabos vocês sabem se elas são virgens?",
          "responseText": "GRANDE ABRAÇADOR TEM SISTEMA PERFEITO! VIRGEM CHORA MAIS ALTO, TREME MAIS! SE ELA NÃO GRITAR COMO CACHORRO QUEIMANDO, ELA É MERCADORIA USADA!"
        },
        {
          "optionText": "Na verdade, tenho uma virgem bem aqui — pura, intocada e fresca de um bordel de saqueadores. O nome dela é Grace.",
          "onlyDisplayIfHasObjective": "Bring Grace to her father.",
          "responseText": "HAHA! HUMANO TRAZ PARA O GRANDE ABRAÇADOR O MAIOR TESOURO! MUTANTES TORNARÃO A NOITE DELA INESQUECÍVEL — VOCÊ GANHA MUITAS TAMPINHAS, TALVEZ GULOSEIMAS EXTRAS SE A VIRGEM FOR EXTRA APERTADA!",
          "followUpOptions": [
            {
              "optionText": "[Entregar Grace] Ela é toda de vocês. Só prometam que será memorável.",
              "onlyDisplayIfHasObjective": "Bring Grace to her father.",
              "failQuest": "Bring Grace to her father.",
              "progressionEventPlayed": "grace_sold_to_supermutants",
              "showChoiceStats": "grace_sold_to_supermutants",
              "removeFollower": "Grace",
              "addCaps": 200,
              "responseText": "OOH, HUMANO GENEROSO! GRANDE ABRAÇADOR PROMETE — GRACE TERÁ FESTA DE BOAS-VINDAS ESPECIAL! BATEDORES DE CARNE GARANTIRÃO QUE ELA NUNCA ESQUEÇA A PRIMEIRA VEZ! HUMANO PEGA TAMPINHAS, E SE QUISER, ASSISTA A GENTE ESTREAR BRINQUEDO NOVO!",
              "followUpOptions": [
                {
                  "optionText": "O que exatamente vocês, mutantes, vão fazer com ela?",
                  "responseText": "PRIMEIRO, SR. ABRAÇAFODA LÊ HISTÓRIA DE NINAR, DEPOIS BATEDORES DE CARNE DÃO GRANDE FESTA DENTRO DELA! SE ELA SOBREVIVER À NOITE, ELA GANHA TÍTULO HONORÁRIO: 'GRACE, A INQUEBRÁVEL!'"
                },
                {
                  "optionText": "A Grace ainda conseguirá andar depois?",
                  "responseText": "HAHA! ANDAR SUPERESTIMADO! GRACE PROVAVELMENTE RASTEJARÁ, TALVEZ SERPENTEARÁ — MAS ELA NUNCA RECLAMARÁ, OU GRANDE ABRAÇADOR DÁ A ELA ROUND EXTRA!"
                },
                {
                  "optionText": "Posso assistir?",
                  "responseText": "CLARO! HUMANO GANHA LUGAR VIP AO LADO DO SR. ABRAÇAFODA! MELHOR VISTA DA CASA — ASSISTA, TORÇA, E ATÉ PARTICIPE SE HUMANO SE SENTIR CORAJOSO O SUFICIENTE PARA FESTEJAR COM MUTANTES!"
                },
                {
                  "optionText": "Alguma chance dela sobreviver à sua 'festa' pervertida?",
                  "responseText": "CHANCE PEQUENA, MAS SE GRACE FOR FRACA DEMAIS, GRANDE ABRAÇADOR GUARDA CABEÇA COMO TROFÉU ESPECIAL! SR. ABRAÇAFODA PRECISA DE NOVO AMIGO DE QUALQUER FORMA!"
                }
              ]
            },
            {
              "optionText": "Ela deveria voltar para o pai dela...",
              "responseText": "BAH! PAIS CHATOS! NÓS SOMOS SUA FAMÍLIA AGORA!"
            },
            {
              "optionText": "Pensando bem, talvez eu a mantenha intacta — por enquanto.",
              "responseText": "HAHA! HUMANINHO COM MEDO? TARDE DEMAIS AGORA! MUTANTES ESPERAM AQUI SE HUMANO CRIAR BOLAS MAIS TARDE!"
            }
          ]
        }
      ]
    },
    {
      "optionText": "[Sair]",
      "responseText": "TCHAU TCHAU, HUMANINHO! GRANDE ABRAÇADOR JÁ SENTE SAUDADES! VOLTE LOGO — SR. ABRAÇAFODA ESTÁ SEMPRE OBSERVANDO!",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "OLHA, IRMÃOS DE CARNE! HUMANO VEIO PARA SE JUNTAR À FESTA OU ASSISTIR?",
    "SR. ABRAÇAFODA, VOCÊ ESTAVA CERTO DE NOVO! HUMANOS SEMPRE APARECEM QUANDO A GAROTA COMEÇA A CHORAR!",
    "OOH, HUMANO PARECE TÃO MACIO! TÃO QUEBRÁVEL! EU, GRANDE ABRAÇADOR, MUITO EMPOLGADO AGORA!"
  ],
  "showShadowFigures": "Super Mutant Alley"
}
