{
  "options": [
    {
      "optionText": "Vejo que você não aprendeu a lição.",
      "responseText": "Bem, bem, se não é o meu Morador do Refúgio favorito. Voltou para terminar o que começou?",
      "followUpOptions": [
        {
          "optionText": "Entregue tudo que você tem. De novo.",
          "exitLine": true,
          "addCaps": 145,
          "responseText": "Tem certeza que quer fazer isso? A segunda vez é que dá sorte, hein? Tudo bem, pegue tudo, só deixe minhas garotas em paz... de novo."
        }
      ]
    },
    {
      "optionText": "Só estou aqui para ver como as coisas estão.",
      "responseText": "Ah, você quer dizer como você chutou meu traseiro na frente das minhas garotas da última vez? Sim, estamos ótimas, obrigada por perguntar. Não pensei que você voltaria, no entanto.",
      "followUpOptions": [
        {
          "optionText": "Você tem sorte de eu não ter acabado com todas vocês.",
          "responseText": "Sorte? Garoto do refúgio, a única coisa de sorte aqui é que eu não enfiei seu Pip-Boy onde o sol não bate. Eu sou a rainha aqui — poder da xoxota e tudo mais. Você sentiria minha falta, e você sabe disso."
        },
        {
          "optionText": "Você já pensou em se juntar ao Refúgio 6969?",
          "responseText": "Refúgio 6969? Ah sim, o refúgio onde todo mundo tem medo de tocar no próprio pau. Qual é o lema lá? 'Saco azul constrói caráter?' Querido, prefiro morrer de cara numa pilha de merda de Brahmin a nunca mais cavalgar um pau."
        }
      ]
    },
    {
      "optionText": "Então, quem são seus clientes favoritos?",
      "responseText": "Hmm, se você está perguntando quem fode melhor, são os super mutantes. Aqueles desgraçados grandes, burros e verdes têm paus do tamanho do pescoço de um Brahmin. Juro, uma das minhas garotas foi tão arrombada que os gritos dela espantaram metade dos meus outros clientes naquela noite. Além disso, eles pagam as melhores tampinhas porque são burros demais para pechinchar, e deixam minhas garotas andando engraçado por uma semana. É uma vitória para todos.",
      "followUpOptions": [
        {
          "optionText": "Como diabos suas garotas sobrevivem a isso?",
          "responseText": "Sobrevivem? Pfft, a maioria não sobrevive. Tive uma garota que tentou 'aguentar como uma campeã', mas essa campeã acabou parecendo restos de Deathclaw. Agora eu cobro extra por um 'serviço descartável'. Os clientes adoram, e eu não desperdiço recursos limpando as mortas. Capitalismo, garoto do refúgio!"
        },
        {
          "optionText": "Já deixou um deles te foder?",
          "responseText": "Pode apostar que sim. Você acha que eu venderia essa merda sem saber como é? Na primeira vez, pensei que ia me matar. Acontece que foi a melhor foda que já tive. Claro, não consegui andar direito por alguns dias, mas é um preço pequeno a pagar. Agora, porém, só deixo os que têm modos me darem uma volta. Tenho que impor limites, sabe?"
        },
        {
          "optionText": "Isso é... perturbador.",
          "responseText": "Perturbador? Docinho, você ainda não viu nada!"
        }
      ]
    },
    {
      "optionText": "Tem algo para trocar?",
      "icon": "GUI/trade icon",
      "neverGreyOut": true,
      "responseText": "Bem, bem, se não é o pervertido dos Ermos vindo se abastecer. Tenho uísque forte o suficiente para apagar a noite passada e Rad-Lube o bastante para lidar com qualquer depravação que você planejou. Vai comprar ou só está perdendo meu tempo?",
      "isTrading": true
    },
    {
      "optionText": "Tchau.",
      "responseText": "Dá o fora daqui, Garoto do Refúgio. Da próxima vez, sou eu quem chuta seu traseiro.",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "Você é como eine infestação de radroaches — feio, persistente e impossível de matar. O que você quer desta vez?"
  ]
}
