{
  "options": [
    {
      "optionText": "Então, o que te faz pensar que eu não deveria simplesmente colocar uma bala entre seus olhos?",
      "dontDisplayIfObjectiveComplete": "Talk to Tina",
      "icon": "GUI/quest mark",
      "responseText": "Opa, opa, vamos com calma no gatilho, gostosão! Você já me humilhou na frente das minhas garotas, certo? Não precisa terminar o serviço. Que tal isso — deixe eu e minhas vadias irmos, e eu melhoro a oferta. Você gosta de tampinhas, certo?",
      "followUpOptions": [
        {
          "optionText": "Continue.",
          "icon": "GUI/quest mark",
          "responseText": "Aquela coisinha metida de bunda pequena ali? A Grace? Sim, ela não é qualquer lixo dos Ermos. Ela é a princesa virgem de Cumorah Crest. O pai dela é um barão importante, nadando em tampinhas. Te dou ela e as coordenadas do papai querido. Você a leva para casa, ele te paga uma grana preta e provavelmente faz um desfile ou alguma merda assim.",
          "followUpOptions": [
            {
              "optionText": "Grace? O que ela tem de tão especial?",
              "responseText": "Oh, você vai adorar isso — ela é a única virgem no bordel. Tipo, sério, a *única*. Você sabe como é difícil encontrar alguém tão puro por aqui? Ela é tipo... ouro de saqueador. Os caras adoram a fantasia da 'intocada', e eu ia faturar alto. Mas ei, sua vitória, minha derrota. Leve-a. Seja um herói ou o que for."
            },
            {
              "optionText": "Tampinhas, hein? E o que me impede de simplesmente te matar e pegar a garota?",
              "responseText": "Uh, já ouviu falar de boa vontade? Sabe, não fazer inimigos por onde passa? Além disso, tenho a localização do pai dela. Se você me matar, boa sorte para encontrá-lo."
            },
            {
              "optionText": "Por que diabos eu deveria confiar em você? Você é uma saqueadora.",
              "responseText": "Justo. Mas se eu estivesse mentindo, não te ofereceria alguma besteira falsa em vez da verdade? O pai da Grace é podre de rico, e se você a levar de volta, está feito para a vida. Além disso, se eu te sacanear, você vai me caçar de qualquer maneira, certo? Não vale a pena."
            },
            {
              "optionText": "Tudo bem. Fale. Dê-me as coordenadas.",
              "icon": "GUI/quest mark",
              "addObjective": "Talk to Grace",
              "markObjectiveComplete": "Talk to Tina",
              "dontDisplayIfObjectiveComplete": "Talk to Tina",
              "exitLine": true,
              "responseText": "Esse é o espírito! Certo, escuta — Cumorah Crest fica a uns três dias ao sul daqui, atravessando o grande cinturão de tempestades de radiação. Não tem como errar. Muros chiques, todos brilhantes e com aparência pré-guerra."
            },
            {
              "optionText": "Sem acordo. Você e suas vadias morrem aqui.",
              "dontDisplayIfObjectiveComplete": "Talk to Tina",
              "exitLine": true,
              "responseText": "Oh, qual é! Qual o sentido? Você não ganha nada nos matando! Tampinhas, uma garota bonita, talvez até sexo de gratidão se jogar suas cartas direito! Você realmente quer jogar isso fora só para se exibir?"
            }
          ]
        }
      ]
    },
    {
      "optionText": "Quem diabos é você, afinal?",
      "responseText": "Eu? Eu sou a Thicc Tina, querido. Rainha saqueadora, chefe durona e a mente por trás deste pequeno pedaço do paraíso. Sim, o nome não é sutil, mas ei, está vendo toda essa gostosura? Tenho que assumir.",
      "followUpOptions": [
        {
          "optionText": "'Thicc Tina'? Sério?",
          "responseText": "Tem algum problema com isso? 'Thicc' não é só minha marca, é meu estilo de vida. E confie em mim, funcionou muito bem até agora — até você aparecer, claro."
        },
        {
          "optionText": "O que é este lugar? Algum tipo de bordel de saqueadores?",
          "responseText": "Pode apostar que sim! Bem-vindo ao covil das Vadias Saqueadoras. Damos às massas com tesão o que elas querem — xoxota, bebidas e um puta tempo bom.",
          "followUpOptions": [
            {
              "optionText": "Então, você administra um bordel e se chamam de 'Vadias Saqueadoras'? Sutil.",
              "responseText": "Sutileza é para burocratas pré-guerra. Somos barulhentas, orgulhosas e sabemos como festejar. Tem algum problema com isso?"
            },
            {
              "optionText": "Como você acabou administrando um lugar como este?",
              "responseText": "Oh, é uma verdadeira história de superação. Comecei como uma saqueadora qualquer, lutei para chegar ao topo com coragem, cérebro e estas coxas de aço. Agora tenho minha própria equipe, meu próprio bordel e uma grande reputação."
            },
            {
              "optionText": "Qual é a da Grace? Por que mantê-la por perto?",
              "responseText": "Como eu disse, ela é um unicórnio — uma virgem em um mar de degenerados dos Ermos. Isso a torna valiosa pra caralho. Além disso, ela tem aquela vibe de metida e indefesa que realmente vende o pacote completo. O dinheiro do papai era só a cereja do bolo."
            }
          ]
        },
        {
          "optionText": "Sua gangue te chama de 'Thicc Tina' na sua cara, ou só pelas costas?",
          "responseText": "Oh, eles dizem na minha cara, sim. Porque sabem que vou enfiar um punho biônico no cu deles se não disserem com respeito.",
          "followUpOptions": [
            {
              "optionText": "Respeito? Mais para medo. Grande diferença.",
              "responseText": "Medo *é* respeito nos Ermos, docinho. Talvez você aprenda isso algum dia — se viver o suficiente."
            },
            {
              "optionText": "Sinceramente, justo. Eu também não discutiria com alguém do seu tamanho.",
              "responseText": "Escolha inteligente. Siga esse instinto e você irá longe por aqui."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tem algo para trocar?",
      "icon": "GUI/trade icon",
      "neverGreyOut": true,
      "responseText": "Bem, bem, se não é o pervertido dos Ermos vindo se abastecer. Tenho uísque forte o suficiente para apagar a noite passada e Rad-Lube o bastante para lidar com qualquer depravação que você planejou. Vai comprar ou só está perdendo meu tempo?",
      "isTrading": true
    }
  ],
  "auto_lines": [
    "Tudo bem, tudo bem, você venceu! Caramba, minhas garotas nem me apoiaram, as vadias traiçoeiras. Agora, que tal a gente resolver isso?"
  ]
}
