{
  "options": [
    {
      "optionText": "QUEM... O QUE É VOCÊ?!",
      "dontShowIfProgressionEventsPlayed": [
        "refusedToAcceptToddBlessing",
        "ToddBlessingComplete"
      ],
      "emotion": "Characters/Todd Howard/emotions/open eyes",
      "responseText": "Ah, seu ajudantezinho do Enclave. Eu sou Todd Howard. Deus dos glitches, senhor dos arquivos de salvamento e, aparentemente, o único aqui com bom senso. Eu sou a força cósmica que mantém este universo mal e mal remendado. E VOCÊ acabou de entregar uma arma para o próprio Hitler do refúgio. Parabéns, campeão.",
      "followUpOptions": [
        {
          "optionText": "Por que você está aqui, sua divindade cheia de glitches?",
          "responseText": "Por que estou aqui? Ah, não sei. Talvez porque você acabou de fazer um speedrun para o final mais amaldiçoado da história da Vault-Tec?",
          "followUpOptions": [
            {
              "optionText": "Certo, justo. Você pode consertar isso?",
              "progressionEventPlayed": "agreedToAcceptToddBlessing",
              "responseText": "Consertar? CONSERTAR?! CLARO que posso consertar. Mas devo? Afinal, você é o psicopata que se fez de amiguinho de um membro do Enclave.",
              "followUpOptions": [
                {
                  "optionText": "Sim, POR FAVOR, conserte! Eu faço qualquer coisa!",
                  "addObjective": "Undo your mess.",
                  "responseText": "Qualquer coisa? Ah, agora você está falando a minha língua, seu pequeno glitch imundo no sistema. Para limpar seus pecados, você deve provar sua devoção. Apenas o mantra sagrado pode te salvar. Repita comigo: 'Simplesmente funciona.'",
                  "followUpOptions": [
                    {
                      "optionText": "Simplesmente funciona.",
                      "responseText": "Patético! Você acha que os bugs de Fallout 76 morreram com uma convicção tão fraca? DE NOVO, mais alto!",
                      "followUpOptions": [
                        {
                          "optionText": "SIMPLESMENTE FUNCIONA!",
                          "responseText": "Sim! Sim! Deixe o mantra fluir através de você! Agora cante como se o destino de toda a Creation Engine da Bethesda dependesse da sua alminha quebrada.",
                          "followUpOptions": [
                            {
                              "optionText": "SIMPLESMENTE FUNCIONA!!",
                              "responseText": "Lindo! Posso sentir a Todd-energia irradiando de você! Mais uma vez! Grite como se estivesse corrigindo um lançamento do primeiro dia!",
                              "followUpOptions": [
                                {
                                  "optionText": "SIMPLESMENTE FUNCIONA!!!",
                                  "responseText": "PERFEITO! Sua devoção me agrada. Seus pecados estão temporariamente corrigidos, mas lembre-se: estou observando. Sempre observando.",
                                  "markObjectiveComplete": "Undo your mess.",
                                  "specialEffects": ["restore color filter"],
                                  "showChoiceStats": "ToddBlessingComplete",
                                  "progressionEventPlayed": "ToddBlessingComplete",
                                  "advanceDayWithStatusMessage": "O divino Todd falou. Seus pecados estão corrigidos... por enquanto. Louve-o, pois simplesmente funciona.",
                                  "fadeOutCharacter": true,
                                  "exitLine": true
                                },
                                {
                                  "optionText": "Eu realmente tenho que continuar gritando isso?",
                                  "responseText": "Você quer viver em um refúgio cheio de cadáveres, ou quer que Todd abençoe seu pequeno mundo patético? CONTINUE!"
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "optionText": "Espera, qual é a pegadinha?",
                  "responseText": "A pegadinha? Ah, seu doce novato de verão. A pegadinha é que eu vou consertar do MEU jeito. Pode funcionar. Pode não funcionar. Simplesmente funciona... às vezes."
                }
              ]
            },
            {
              "optionText": "Não, vou viver com minhas escolhas. Mesmo que seja uma merda.",
              "responseText": "Tudo bem, bonzão, aproveite seu melhor amigo nazista e sua exposição de arte encharcada de sangue. Estarei bem aqui... observando.",
              "showChoiceStats": "refusedToAcceptToddBlessing",
              "progressionEventPlayed": "refusedToAcceptToddBlessing",
              "fadeOutCharacter": true,
              "exitLine": true
            }
          ]
        }
      ]
    }
  ]
}
