{
  "options": [
    {
      "optionText": "Adivinha? Acabei de quebrar um recorde do refúgio: Primeiro a profanar um robô. Supere essa.",
      "responseText": "SEU MONSTRO! Aquele robô foi REPROGRAMADO para inspirar contenção, não para inspirar… seja lá que exibição nojenta foi aquela!",
      "dontShowIfProgressionEventPlayed": "virginatrix_punished_player",
      "reqProgressionEvent": "sexbot sex",
      "followUpOptions": [
        {
          "optionText": "Admita, você gostou do show. Você estava praticamente na primeira fila.",
          "responseText": "EU ESTAVA GARANTINDO A LEI E A ORDEM, não me deliciando com sua exibição depravada!",
          "followUpOptions": [
            {
              "optionText": "Oh, então você ESTAVA assistindo! Qual foi sua parte favorita? A hidráulica? Os gemidos?",
              "responseText": "Eu—Você—COMO OUSA?! Eu não estava! Eu estava OBSERVANDO VIOLAÇÕES!",
              "followUpOptions": [
                {
                  "optionText": "Admita, você adorou.",
                  "responseText": "EU QUERO VOCÊ… FORA DA MINHA VISTA, SUA BESTA PECAMINOSA INCORRIGÍVEL!",
                  "followUpOptions": [
                    {
                      "optionText": "Admita mais alto para os moradores do refúgio lá no fundo!",
                      "progressionEventPlayed": "virginatrix_punished_player",
                      "addWillpowerTokens": -9999,
                      "advanceDayWithStatusMessage": "A Virginatrix confiscou seus tokens de força de vontade e depois jogou seu traseiro lamentável na Câmara da Vergonha. Você passou o dia amarrado a uma cadeira assistindo ao 'Diga Não à Xoxota, Diga Sim à Produtividade!' da Vault-Tec enquanto um Cassetete de Bonk te batia toda vez que você piscava com tesão demais.",
                      "exitLine": true,
                      "responseText": "EU VOU DIZER A ELES O QUANTO VOCÊ MERECE PUNIÇÃO! É ISSO! CÂMARA DA VERGONHA!"
                    },
                    {
                      "optionText": "Quer que eu suma? Desculpe, docinho, sou o arco principal da sua história.",
                      "addWillpowerTokens": -9999,
                      "advanceDayWithStatusMessage": "A Virginatrix confiscou seus tokens de força de vontade e depois jogou seu traseiro lamentável na Câmara da Vergonha. Você passou o dia amarrado a uma cadeira assistindo ao 'Diga Não à Xoxota, Diga Sim à Produtividade!' da Vault-Tec enquanto um Cassetete de Bonk te batia toda vez que você piscava com tesão demais.",
                      "exitLine": true,
                      "progressionEventPlayed": "virginatrix_punished_player",
                      "responseText": "PERSONAGEM PRINCIPAL?! Você é a principal DESGRAÇA! CASSETE DE BONK, ATIVAR!"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "optionText": "Eu só estava pensando em batatas. Muitas... batatas grandes... e redondas.",
      "responseTexts": [
        "Batatas? Você acha que sou estúpida? Batatas não fazem suas pupilas dilatarem assim. Que imundície está passando pela sua mente?! Desembucha, ou será serviço dobrado na Câmara da Vergonha para você!"
      ],
      "followUpOptions": [
        {
          "optionText": "Juro, só batatas! Talvez com um pouco de manteiga... e um pouco de chantilly?",
          "responseText": "Você me enoja! Chantilly? A única coisa chicoteada por aqui será você se continuar com isso!"
        },
        {
          "optionText": "Qual é a da Câmara da Vergonha?",
          "responseText": "A Câmara da Vergonha é onde mentes fracas são purificadas. É um lugar de reflexão, onde seus impulsos pecaminosos são esmagados pela glória saudável dos valores familiares dos anos 1950. Você ficaria surpreso com a rapidez com que assistir a um cachorro de desenho animado cortar a grama pode reprogramar seu cérebro.",
          "followUpOptions": [
            {
              "optionText": "Parece uma festa. Posso levar lanches?",
              "responseText": "O único lanche permitido na Câmara da Vergonha é uma tigela de aveia sem açúcar. O sabor é uma distração, e distrações são uma porta de entrada para a impureza! Agora, a menos que você esteja se voluntariando para provar, guarde suas piadas equivocadas para si mesmo."
            },
            {
              "optionText": "E se eu realmente gostar de desenhos dos anos 1950?",
              "responseText": "Então você está mais quebrado do que eu pensava. Esses desenhos são para te entediar até a sanidade, не para servir como seu entretenimento pessoal. Sabe de uma coisa, só por isso, vou agendar para você uma maratona de fim de semana. Vamos ver o quanto você 'gosta' depois de 48 horas seguidas."
            }
          ]
        }
      ]
    },
    {
      "optionText": "Uh, belo chicote que você tem aí...",
      "responseText": "Isto não é apenas um chicote, seu pervertido de baixo nível! É o Chicote da Castidade 9000, projetado para arrancar a depravação da sua alma. Uma estalada, e você estará clamando pelo doce abraço da castidade como um cordeirinho recém-nascido. Então, a menos que esteja pronto para implorar por uma surra, cale a boca!",
      "followUpOptions": [
        {
          "optionText": "E se eu, uh, o pegasse emprestado por um tempo?",
          "responseText": "Você? HA! A única coisa que você chicotearia é a si mesmo em um frenesi por um anúncio de sutiã pré-guerra. Este chicote é para purgar pensamentos impuros, não para incentivá-los. Quer uma vez? Tudo bem, mas terei que te amarrar primeiro. Por segurança, claro."
        },
        {
          "optionText": "Aposto que você o guarda debaixo do travesseiro à noite.",
          "responseText": "Errado! Eu o guardo em uma caixa de vidro na minha mesa de cabeceira, para que seja a primeira coisa que vejo todas as manhãs. O chicote e eu estamos em perfeita harmonia. É como um casamento, exceto sem toda aquela bobagem nojenta de amor. Ou toque. Ou felicidade. Pura bem-aventurança."
        }
      ]
    },
    {
      "optionText": "Onde eu apresento uma queixa sobre a Polícia da Pureza?",
      "responseText": "No final do corredor, segunda porta à esquerda. Brincadeirinha! Não há departamento de queixas. Todas as queixas vão diretamente para o triturador."
    },
    {
      "optionText": "Tchau",
      "responseText": "Não deixe a porta do refúgio bater em seus pensamentos imundos ao sair. E lembre-se, a Polícia da Pureza é como herpes — sempre observando, sempre pronta para atacar quando você menos espera!",
      "exitLine": true
    }
  ],
  "auto_lines": [
    "O que você está fazendo aqui? O salão é para relaxar, não para contaminar! Consigo sentir o cheiro de suas impurezas do outro lado da sala, seu verme!"
  ]
}
