{
  "options": [
    {
      "optionText": "Belos mamilos, Comandante Suprema. São de fábrica ou apenas uma vantagem por bom comportamento?",
      "responseText": "Seu degenerado imundo! Minha determinação é mais dura que o seu... bem, você sabe. Isto foi um teste, e claramente, você está falhando espetacularmente!",
      "followUpOptions": [
        {
          "optionText": "Mais dura que o quê, exatamente? Vamos, diga. Eu te desafio.",
          "responseText": "Cale a boca, pecador! Serei eu quem dará as lições duras por aqui!"
        },
        {
          "optionText": "Não seja tímida agora, Comandante. Parece que você está a cinco segundos de quebrar.",
          "responseText": "Eu… eu NÃO vou quebrar! Vocês são todos fracos, deixando seus instintos básicos tomarem conta! Mas eu? *olha para baixo* ... Estou no controle total. Totalmente. Completamente. Oh, Deus...",
          "followUpOptions": [
            {
              "optionText": "Controle total? Sério?",
              "responseText": "Nem comece! Esta ainda é uma Zona Sem Pau Duro, e vou arrancar o pecado de você na base do 'bonk' até você esquecer para que serve essa coisa entre suas pernas!"
            },
            {
              "optionText": "Sejamos realistas. Todo mundo está se divertindo, e aqui está você... mamilos de fora, agindo como se não estivesse pronta para se juntar à diversão.",
              "exitLine": true,
              "responseText": "Não se ATREVA a insinuar que eu me rebaixaria aos seus... seus... impulsos primitivos! Mas se eu for cair, vou te levar junto. Para a Câmara da Vergonha. Nu. Acorrentado. E você nunca... nunca mais... verá a luz do dia!"
            }
          ]
        }
      ]
    },
    {
      "optionText": "Tchau",
      "responseText": "Corra, pecador, mas você não pode escapar do Bonk para sempre! Vou te encontrar... e quando o fizer, será uma longa sessão na Câmara da Vergonha!",
      "exitLine": true
    }
  ]
}
